const ProvinceData = '''
[
  {
    "code": "150000",
    "name": "内蒙古自治区",
    "next": [
      {
        "code": "152500",
        "name": "锡林郭勒盟",
        "next": [
          {
            "code": "152531",
            "name": "多伦县",
            "next": []
          },
          {
            "code": "152530",
            "name": "正蓝旗",
            "next": []
          },
          {
            "code": "152528",
            "name": "镶黄旗",
            "next": []
          },
          {
            "code": "152523",
            "name": "苏尼特左旗",
            "next": []
          },
          {
            "code": "152522",
            "name": "阿巴嘎旗",
            "next": []
          },
          {
            "code": "152525",
            "name": "东乌珠穆沁旗",
            "next": []
          },
          {
            "code": "152524",
            "name": "苏尼特右旗",
            "next": []
          },
          {
            "code": "152527",
            "name": "太仆寺旗",
            "next": []
          },
          {
            "code": "152526",
            "name": "西乌珠穆沁旗",
            "next": []
          },
          {
            "code": "152529",
            "name": "正镶白旗",
            "next": []
          },
          {
            "code": "152502",
            "name": "锡林浩特市",
            "next": []
          },
          {
            "code": "152501",
            "name": "二连浩特市",
            "next": []
          }
        ]
      },
      {
        "code": "150400",
        "name": "赤峰市",
        "next": [
          {
            "code": "150404",
            "name": "松山区",
            "next": []
          },
          {
            "code": "150401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "150402",
            "name": "红山区",
            "next": []
          },
          {
            "code": "150403",
            "name": "元宝山区",
            "next": []
          },
          {
            "code": "150428",
            "name": "喀喇沁旗",
            "next": []
          },
          {
            "code": "150429",
            "name": "宁城县",
            "next": []
          },
          {
            "code": "150430",
            "name": "敖汉旗",
            "next": []
          },
          {
            "code": "150422",
            "name": "巴林左旗",
            "next": []
          },
          {
            "code": "150423",
            "name": "巴林右旗",
            "next": []
          },
          {
            "code": "150421",
            "name": "阿鲁科尔沁旗",
            "next": []
          },
          {
            "code": "150426",
            "name": "翁牛特旗",
            "next": []
          },
          {
            "code": "150424",
            "name": "林西县",
            "next": []
          },
          {
            "code": "150425",
            "name": "克什克腾旗",
            "next": []
          }
        ]
      },
      {
        "code": "152900",
        "name": "阿拉善盟",
        "next": [
          {
            "code": "152921",
            "name": "阿拉善左旗",
            "next": []
          },
          {
            "code": "152923",
            "name": "额济纳旗",
            "next": []
          },
          {
            "code": "152922",
            "name": "阿拉善右旗",
            "next": []
          }
        ]
      },
      {
        "code": "150800",
        "name": "巴彦淖尔市",
        "next": [
          {
            "code": "150826",
            "name": "杭锦后旗",
            "next": []
          },
          {
            "code": "150801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "150802",
            "name": "临河区",
            "next": []
          },
          {
            "code": "150825",
            "name": "乌拉特后旗",
            "next": []
          },
          {
            "code": "150822",
            "name": "磴口县",
            "next": []
          },
          {
            "code": "150823",
            "name": "乌拉特前旗",
            "next": []
          },
          {
            "code": "150821",
            "name": "五原县",
            "next": []
          },
          {
            "code": "150824",
            "name": "乌拉特中旗",
            "next": []
          }
        ]
      },
      {
        "code": "150100",
        "name": "呼和浩特市",
        "next": [
          {
            "code": "150101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "150103",
            "name": "回民区",
            "next": []
          },
          {
            "code": "150102",
            "name": "新城区",
            "next": []
          },
          {
            "code": "150105",
            "name": "赛罕区",
            "next": []
          },
          {
            "code": "150104",
            "name": "玉泉区",
            "next": []
          },
          {
            "code": "150123",
            "name": "和林格尔县",
            "next": []
          },
          {
            "code": "150122",
            "name": "托克托县",
            "next": []
          },
          {
            "code": "150121",
            "name": "土左旗",
            "next": []
          },
          {
            "code": "150125",
            "name": "武川县",
            "next": []
          },
          {
            "code": "150124",
            "name": "清水河县",
            "next": []
          }
        ]
      },
      {
        "code": "150500",
        "name": "通辽市",
        "next": [
          {
            "code": "150501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "150502",
            "name": "科尔沁区",
            "next": []
          },
          {
            "code": "150526",
            "name": "扎鲁特旗",
            "next": []
          },
          {
            "code": "150525",
            "name": "奈曼旗",
            "next": []
          },
          {
            "code": "150524",
            "name": "库伦旗",
            "next": []
          },
          {
            "code": "150523",
            "name": "开鲁县",
            "next": []
          },
          {
            "code": "150522",
            "name": "科左后旗",
            "next": []
          },
          {
            "code": "150521",
            "name": "科尔沁左翼中旗",
            "next": []
          },
          {
            "code": "150581",
            "name": "霍林郭勒市",
            "next": []
          }
        ]
      },
      {
        "code": "150900",
        "name": "乌兰察布市",
        "next": [
          {
            "code": "150928",
            "name": "察哈尔右翼后旗",
            "next": []
          },
          {
            "code": "150901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "150981",
            "name": "丰镇市",
            "next": []
          },
          {
            "code": "150929",
            "name": "四子王旗",
            "next": []
          },
          {
            "code": "150902",
            "name": "集宁区",
            "next": []
          },
          {
            "code": "150923",
            "name": "商都县",
            "next": []
          },
          {
            "code": "150922",
            "name": "化德县",
            "next": []
          },
          {
            "code": "150921",
            "name": "卓资县",
            "next": []
          },
          {
            "code": "150927",
            "name": "察右中旗",
            "next": []
          },
          {
            "code": "150926",
            "name": "察哈尔右翼前旗",
            "next": []
          },
          {
            "code": "150925",
            "name": "凉城县",
            "next": []
          },
          {
            "code": "150924",
            "name": "兴和县",
            "next": []
          }
        ]
      },
      {
        "code": "150200",
        "name": "包头市",
        "next": [
          {
            "code": "150202",
            "name": "东河区",
            "next": []
          },
          {
            "code": "150203",
            "name": "昆都仑区",
            "next": []
          },
          {
            "code": "150201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "150206",
            "name": "白云鄂博矿区",
            "next": []
          },
          {
            "code": "150207",
            "name": "九原区",
            "next": []
          },
          {
            "code": "150204",
            "name": "青山区",
            "next": []
          },
          {
            "code": "150205",
            "name": "石拐区",
            "next": []
          },
          {
            "code": "150221",
            "name": "土默特右旗",
            "next": []
          },
          {
            "code": "150222",
            "name": "固阳县",
            "next": []
          },
          {
            "code": "150223",
            "name": "达茂联合旗",
            "next": []
          }
        ]
      },
      {
        "code": "150600",
        "name": "鄂尔多斯市",
        "next": [
          {
            "code": "150621",
            "name": "达拉特旗",
            "next": []
          },
          {
            "code": "150622",
            "name": "准格尔旗",
            "next": []
          },
          {
            "code": "150623",
            "name": "鄂托克前旗",
            "next": []
          },
          {
            "code": "150624",
            "name": "鄂托克旗",
            "next": []
          },
          {
            "code": "150625",
            "name": "杭锦旗",
            "next": []
          },
          {
            "code": "150626",
            "name": "乌审旗",
            "next": []
          },
          {
            "code": "150627",
            "name": "伊金霍洛旗",
            "next": []
          },
          {
            "code": "150602",
            "name": "东胜区",
            "next": []
          }
        ]
      },
      {
        "code": "152200",
        "name": "兴安盟",
        "next": [
          {
            "code": "152201",
            "name": "乌兰浩特市",
            "next": []
          },
          {
            "code": "152202",
            "name": "阿尔山市",
            "next": []
          },
          {
            "code": "152222",
            "name": "科右中旗",
            "next": []
          },
          {
            "code": "152223",
            "name": "扎赉特旗",
            "next": []
          },
          {
            "code": "152221",
            "name": "科右前旗",
            "next": []
          },
          {
            "code": "152224",
            "name": "突泉县",
            "next": []
          }
        ]
      },
      {
        "code": "150300",
        "name": "乌海市",
        "next": [
          {
            "code": "150303",
            "name": "海南区",
            "next": []
          },
          {
            "code": "150302",
            "name": "海勃湾区",
            "next": []
          },
          {
            "code": "150301",
            "name": "乌海市辖区",
            "next": []
          },
          {
            "code": "150304",
            "name": "乌达区",
            "next": []
          }
        ]
      },
      {
        "code": "150700",
        "name": "呼伦贝尔市",
        "next": [
          {
            "code": "150781",
            "name": "满洲里市",
            "next": []
          },
          {
            "code": "150784",
            "name": "额尔古纳市",
            "next": []
          },
          {
            "code": "150785",
            "name": "根河市",
            "next": []
          },
          {
            "code": "150725",
            "name": "陈巴尔虎旗镇",
            "next": []
          },
          {
            "code": "150724",
            "name": "鄂温克族自治旗",
            "next": []
          },
          {
            "code": "150727",
            "name": "新巴尔虎右旗",
            "next": []
          },
          {
            "code": "150726",
            "name": "新巴尔虎左旗",
            "next": []
          },
          {
            "code": "150721",
            "name": "阿荣旗",
            "next": []
          },
          {
            "code": "150782",
            "name": "牙克石市",
            "next": []
          },
          {
            "code": "150723",
            "name": "鄂伦春自治旗",
            "next": []
          },
          {
            "code": "150722",
            "name": "莫力达瓦达斡尔族自治旗",
            "next": []
          },
          {
            "code": "150783",
            "name": "扎兰屯市",
            "next": []
          },
          {
            "code": "150702",
            "name": "海拉尔区",
            "next": []
          },
          {
            "code": "150701",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "110000",
    "name": "北京市",
    "next": [
      {
        "code": "110100",
        "name": "北京市",
        "next": [
          {
            "code": "110115",
            "name": "大兴区",
            "next": []
          },
          {
            "code": "110109",
            "name": "门头沟区",
            "next": []
          },
          {
            "code": "110108",
            "name": "海淀区",
            "next": []
          },
          {
            "code": "110105",
            "name": "朝阳区",
            "next": []
          },
          {
            "code": "110104",
            "name": "宣武区",
            "next": []
          },
          {
            "code": "110107",
            "name": "石景山区",
            "next": []
          },
          {
            "code": "110106",
            "name": "丰台区",
            "next": []
          },
          {
            "code": "110101",
            "name": "东城区",
            "next": []
          },
          {
            "code": "110113",
            "name": "顺义区",
            "next": []
          },
          {
            "code": "110103",
            "name": "崇文区",
            "next": []
          },
          {
            "code": "110102",
            "name": "西城区",
            "next": []
          },
          {
            "code": "110116",
            "name": "怀柔区",
            "next": []
          },
          {
            "code": "110117",
            "name": "平谷区",
            "next": []
          },
          {
            "code": "110111",
            "name": "房山区",
            "next": []
          },
          {
            "code": "110114",
            "name": "昌平区",
            "next": []
          },
          {
            "code": "110112",
            "name": "通州区",
            "next": []
          },
          {
            "code": "110128",
            "name": "密云县",
            "next": []
          },
          {
            "code": "110129",
            "name": "延庆县",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "420000",
    "name": "湖北省",
    "next": [
      {
        "code": "420800",
        "name": "荆门市",
        "next": [
          {
            "code": "420801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "420802",
            "name": "东宝区",
            "next": []
          },
          {
            "code": "420804",
            "name": "掇刀区",
            "next": []
          },
          {
            "code": "420821",
            "name": "京山县",
            "next": []
          },
          {
            "code": "420822",
            "name": "沙洋县",
            "next": []
          },
          {
            "code": "420881",
            "name": "钟祥市",
            "next": []
          }
        ]
      },
      {
        "code": "420300",
        "name": "十堰市",
        "next": [
          {
            "code": "420303",
            "name": "张湾区",
            "next": []
          },
          {
            "code": "420302",
            "name": "茅箭区",
            "next": []
          },
          {
            "code": "420301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "420381",
            "name": "丹江口市",
            "next": []
          },
          {
            "code": "420321",
            "name": "郧县",
            "next": []
          },
          {
            "code": "420323",
            "name": "竹山县",
            "next": []
          },
          {
            "code": "420322",
            "name": "郧西县",
            "next": []
          },
          {
            "code": "420325",
            "name": "房县",
            "next": []
          },
          {
            "code": "420324",
            "name": "竹溪县",
            "next": []
          }
        ]
      },
      {
        "code": "421100",
        "name": "黄冈市",
        "next": [
          {
            "code": "421121",
            "name": "团风县",
            "next": []
          },
          {
            "code": "421122",
            "name": "红安县",
            "next": []
          },
          {
            "code": "421123",
            "name": "罗田县",
            "next": []
          },
          {
            "code": "421102",
            "name": "黄州区",
            "next": []
          },
          {
            "code": "421125",
            "name": "浠水县",
            "next": []
          },
          {
            "code": "421126",
            "name": "蕲春县",
            "next": []
          },
          {
            "code": "421101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "421127",
            "name": "黄梅县",
            "next": []
          },
          {
            "code": "421124",
            "name": "英山县",
            "next": []
          },
          {
            "code": "421182",
            "name": "武穴市",
            "next": []
          },
          {
            "code": "421181",
            "name": "麻城市",
            "next": []
          }
        ]
      },
      {
        "code": "420700",
        "name": "鄂州市",
        "next": [
          {
            "code": "420704",
            "name": "鄂城区",
            "next": []
          },
          {
            "code": "420703",
            "name": "华容区",
            "next": []
          },
          {
            "code": "420702",
            "name": "粱子湖区",
            "next": []
          },
          {
            "code": "420701",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "420900",
        "name": "孝感市",
        "next": [
          {
            "code": "420981",
            "name": "应城市",
            "next": []
          },
          {
            "code": "420982",
            "name": "安陆市",
            "next": []
          },
          {
            "code": "420984",
            "name": "汉川市",
            "next": []
          },
          {
            "code": "420901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "420902",
            "name": "孝南区",
            "next": []
          },
          {
            "code": "420923",
            "name": "云梦县",
            "next": []
          },
          {
            "code": "420922",
            "name": "大悟县",
            "next": []
          },
          {
            "code": "420921",
            "name": "孝昌县",
            "next": []
          }
        ]
      },
      {
        "code": "421000",
        "name": "荆州市",
        "next": [
          {
            "code": "421087",
            "name": "松滋市",
            "next": []
          },
          {
            "code": "421024",
            "name": "江陵县",
            "next": []
          },
          {
            "code": "421083",
            "name": "洪湖市",
            "next": []
          },
          {
            "code": "421081",
            "name": "石首市",
            "next": []
          },
          {
            "code": "421023",
            "name": "监利县",
            "next": []
          },
          {
            "code": "421022",
            "name": "公安县",
            "next": []
          },
          {
            "code": "421003",
            "name": "荆州区",
            "next": []
          },
          {
            "code": "421002",
            "name": "沙市区",
            "next": []
          },
          {
            "code": "421001",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "420100",
        "name": "武汉市",
        "next": [
          {
            "code": "420111",
            "name": "洪山区",
            "next": []
          },
          {
            "code": "420114",
            "name": "蔡甸区",
            "next": []
          },
          {
            "code": "420112",
            "name": "东西湖区",
            "next": []
          },
          {
            "code": "420115",
            "name": "江夏区",
            "next": []
          },
          {
            "code": "420101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "420113",
            "name": "汉南区",
            "next": []
          },
          {
            "code": "420103",
            "name": "江汉区",
            "next": []
          },
          {
            "code": "420102",
            "name": "江岸区",
            "next": []
          },
          {
            "code": "420105",
            "name": "汉阳区",
            "next": []
          },
          {
            "code": "420104",
            "name": "_口区",
            "next": []
          },
          {
            "code": "420107",
            "name": "青山区",
            "next": []
          },
          {
            "code": "420106",
            "name": "武昌区",
            "next": []
          },
          {
            "code": "420116",
            "name": "黄陂区",
            "next": []
          },
          {
            "code": "420117",
            "name": "武汉市新洲区",
            "next": []
          }
        ]
      },
      {
        "code": "421300",
        "name": "随州市",
        "next": [
          {
            "code": "421301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "421302",
            "name": "曾都区",
            "next": []
          },
          {
            "code": "421381",
            "name": "广水市",
            "next": []
          }
        ]
      },
      {
        "code": "420500",
        "name": "宜昌市",
        "next": [
          {
            "code": "420529",
            "name": "五峰土家族自治县",
            "next": []
          },
          {
            "code": "420528",
            "name": "长阳土家族自治县",
            "next": []
          },
          {
            "code": "420581",
            "name": "宜都市",
            "next": []
          },
          {
            "code": "420583",
            "name": "枝江市",
            "next": []
          },
          {
            "code": "420582",
            "name": "当阳市",
            "next": []
          },
          {
            "code": "420505",
            "name": "_亭区",
            "next": []
          },
          {
            "code": "420504",
            "name": "点军区",
            "next": []
          },
          {
            "code": "420506",
            "name": "夷陵区",
            "next": []
          },
          {
            "code": "420501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "420503",
            "name": "伍家岗区",
            "next": []
          },
          {
            "code": "420502",
            "name": "西陵区",
            "next": []
          },
          {
            "code": "420527",
            "name": "秭归县",
            "next": []
          },
          {
            "code": "420526",
            "name": "兴山县",
            "next": []
          },
          {
            "code": "420525",
            "name": "远安县",
            "next": []
          }
        ]
      },
      {
        "code": "422800",
        "name": "恩施州",
        "next": [
          {
            "code": "422827",
            "name": "来凤县",
            "next": []
          },
          {
            "code": "422822",
            "name": "建始县",
            "next": []
          },
          {
            "code": "422823",
            "name": "巴东县",
            "next": []
          },
          {
            "code": "422802",
            "name": "利川市",
            "next": []
          },
          {
            "code": "422825",
            "name": "宣恩县",
            "next": []
          },
          {
            "code": "422826",
            "name": "咸丰县",
            "next": []
          },
          {
            "code": "422801",
            "name": "恩施市",
            "next": []
          },
          {
            "code": "422828",
            "name": "鹤峰县",
            "next": []
          }
        ]
      },
      {
        "code": "420200",
        "name": "黄石市",
        "next": [
          {
            "code": "420222",
            "name": "阳新县",
            "next": []
          },
          {
            "code": "420281",
            "name": "大冶市",
            "next": []
          },
          {
            "code": "420202",
            "name": "黄石港区",
            "next": []
          },
          {
            "code": "420203",
            "name": "西塞山区",
            "next": []
          },
          {
            "code": "420201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "420204",
            "name": "下陆区",
            "next": []
          },
          {
            "code": "420205",
            "name": "铁山区",
            "next": []
          }
        ]
      },
      {
        "code": "421200",
        "name": "咸宁市",
        "next": [
          {
            "code": "421224",
            "name": "通山县",
            "next": []
          },
          {
            "code": "421223",
            "name": "崇阳县",
            "next": []
          },
          {
            "code": "421222",
            "name": "通城县",
            "next": []
          },
          {
            "code": "421221",
            "name": "嘉鱼县",
            "next": []
          },
          {
            "code": "421281",
            "name": "赤壁市",
            "next": []
          },
          {
            "code": "421201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "421202",
            "name": "咸安区",
            "next": []
          }
        ]
      },
      {
        "code": "420600",
        "name": "襄樊市",
        "next": [
          {
            "code": "420684",
            "name": "宜城市",
            "next": []
          },
          {
            "code": "420682",
            "name": "老河口市",
            "next": []
          },
          {
            "code": "420683",
            "name": "枣阳市",
            "next": []
          },
          {
            "code": "420602",
            "name": "襄城区",
            "next": []
          },
          {
            "code": "420606",
            "name": "樊城区",
            "next": []
          },
          {
            "code": "420607",
            "name": "襄阳区",
            "next": []
          },
          {
            "code": "420624",
            "name": "南漳县",
            "next": []
          },
          {
            "code": "420625",
            "name": "谷城县",
            "next": []
          },
          {
            "code": "420626",
            "name": "保康县",
            "next": []
          },
          {
            "code": "420601",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "420700",
        "name": "天门市",
        "next": []
      },
      {
        "code": "420800",
        "name": "潜江市",
        "next": []
      },
      {
        "code": "420900",
        "name": "仙桃市",
        "next": []
      },
      {
        "code": "421000",
        "name": "神农架林区",
        "next": []
      }
    ]
  },
  {
    "code": "460000",
    "name": "海南省",
    "next": [
      {
        "code": "469000",
        "name": "海南",
        "next": [
          {
            "code": "469033",
            "name": "乐东黎族自治县",
            "next": []
          },
          {
            "code": "469030",
            "name": "白沙黎族自治县",
            "next": []
          },
          {
            "code": "469031",
            "name": "昌江黎族自治县",
            "next": []
          },
          {
            "code": "469025",
            "name": "定安县",
            "next": []
          },
          {
            "code": "469034",
            "name": "陵水黎族自治县",
            "next": []
          },
          {
            "code": "469027",
            "name": "澄迈县",
            "next": []
          },
          {
            "code": "469026",
            "name": "屯昌县",
            "next": []
          },
          {
            "code": "469003",
            "name": "儋州市",
            "next": []
          },
          {
            "code": "469002",
            "name": "琼海市",
            "next": []
          },
          {
            "code": "469001",
            "name": "五指山市",
            "next": []
          },
          {
            "code": "469035",
            "name": "保亭黎族苗族自治县",
            "next": []
          },
          {
            "code": "469007",
            "name": "东方市",
            "next": []
          },
          {
            "code": "469006",
            "name": "万宁市",
            "next": []
          },
          {
            "code": "469005",
            "name": "文昌市",
            "next": []
          },
          {
            "code": "469028",
            "name": "临高县",
            "next": []
          },
          {
            "code": "469036",
            "name": "琼中黎族苗族自治县",
            "next": []
          },
          {
            "code": "469039",
            "name": "中沙群岛的岛礁及其海域",
            "next": []
          },
          {
            "code": "469038",
            "name": "南沙群岛",
            "next": []
          },
          {
            "code": "469037",
            "name": "西沙群岛",
            "next": []
          }
        ]
      },
      {
        "code": "460100",
        "name": "海口市",
        "next": [
          {
            "code": "460105",
            "name": "秀英区",
            "next": []
          },
          {
            "code": "460107",
            "name": "琼山区",
            "next": []
          },
          {
            "code": "460106",
            "name": "龙华区",
            "next": []
          },
          {
            "code": "460101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "460108",
            "name": "美兰区",
            "next": []
          }
        ]
      },
      {
        "code": "460200",
        "name": "三亚市",
        "next": [
          {
            "code": "460201",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "140000",
    "name": "山西省",
    "next": [
      {
        "code": "140900",
        "name": "忻州市",
        "next": [
          {
            "code": "140926",
            "name": "静乐县",
            "next": []
          },
          {
            "code": "140901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "140902",
            "name": "忻府区",
            "next": []
          },
          {
            "code": "140925",
            "name": "宁武县",
            "next": []
          },
          {
            "code": "140922",
            "name": "五台县",
            "next": []
          },
          {
            "code": "140923",
            "name": "代县",
            "next": []
          },
          {
            "code": "140921",
            "name": "定襄县",
            "next": []
          },
          {
            "code": "140932",
            "name": "偏关县",
            "next": []
          },
          {
            "code": "140924",
            "name": "繁峙县",
            "next": []
          },
          {
            "code": "140928",
            "name": "五寨县",
            "next": []
          },
          {
            "code": "140929",
            "name": "岢岚县",
            "next": []
          },
          {
            "code": "140981",
            "name": "原平市",
            "next": []
          },
          {
            "code": "140927",
            "name": "神池县",
            "next": []
          },
          {
            "code": "140931",
            "name": "保德县",
            "next": []
          },
          {
            "code": "140930",
            "name": "河曲县",
            "next": []
          }
        ]
      },
      {
        "code": "140200",
        "name": "大同市",
        "next": [
          {
            "code": "140203",
            "name": "矿区",
            "next": []
          },
          {
            "code": "140202",
            "name": "大同市城区",
            "next": []
          },
          {
            "code": "140201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "140211",
            "name": "南郊区",
            "next": []
          },
          {
            "code": "140212",
            "name": "新荣区",
            "next": []
          },
          {
            "code": "140221",
            "name": "阳高县",
            "next": []
          },
          {
            "code": "140223",
            "name": "广灵县",
            "next": []
          },
          {
            "code": "140222",
            "name": "天镇县",
            "next": []
          },
          {
            "code": "140225",
            "name": "浑源县",
            "next": []
          },
          {
            "code": "140224",
            "name": "灵丘县",
            "next": []
          },
          {
            "code": "140227",
            "name": "大同县",
            "next": []
          },
          {
            "code": "140226",
            "name": "左云县",
            "next": []
          }
        ]
      },
      {
        "code": "140600",
        "name": "朔州市",
        "next": [
          {
            "code": "140603",
            "name": "平鲁区",
            "next": []
          },
          {
            "code": "140602",
            "name": "朔城区",
            "next": []
          },
          {
            "code": "140601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "140624",
            "name": "怀仁县",
            "next": []
          },
          {
            "code": "140621",
            "name": "山阴县",
            "next": []
          },
          {
            "code": "140623",
            "name": "右玉县",
            "next": []
          },
          {
            "code": "140622",
            "name": "应县",
            "next": []
          }
        ]
      },
      {
        "code": "140100",
        "name": "太原市",
        "next": [
          {
            "code": "140108",
            "name": "尖草坪区",
            "next": []
          },
          {
            "code": "140109",
            "name": "万柏林区",
            "next": []
          },
          {
            "code": "140101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "140122",
            "name": "阳曲县",
            "next": []
          },
          {
            "code": "140105",
            "name": "小店区(人口含高新经济区)",
            "next": []
          },
          {
            "code": "140106",
            "name": "迎泽区",
            "next": []
          },
          {
            "code": "140107",
            "name": "杏花岭区",
            "next": []
          },
          {
            "code": "140181",
            "name": "古交市",
            "next": []
          },
          {
            "code": "140110",
            "name": "晋源区",
            "next": []
          },
          {
            "code": "140123",
            "name": "娄烦县",
            "next": []
          },
          {
            "code": "140121",
            "name": "清徐县",
            "next": []
          }
        ]
      },
      {
        "code": "140800",
        "name": "运城市",
        "next": [
          {
            "code": "140881",
            "name": "永济市",
            "next": []
          },
          {
            "code": "140882",
            "name": "河津市",
            "next": []
          },
          {
            "code": "140801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "140802",
            "name": "盐湖区",
            "next": []
          },
          {
            "code": "140823",
            "name": "闻喜县",
            "next": []
          },
          {
            "code": "140822",
            "name": "万荣县",
            "next": []
          },
          {
            "code": "140821",
            "name": "临猗县",
            "next": []
          },
          {
            "code": "140827",
            "name": "垣曲县",
            "next": []
          },
          {
            "code": "140826",
            "name": "绛县",
            "next": []
          },
          {
            "code": "140825",
            "name": "新绛县",
            "next": []
          },
          {
            "code": "140824",
            "name": "稷山县",
            "next": []
          },
          {
            "code": "140830",
            "name": "芮城县",
            "next": []
          },
          {
            "code": "140829",
            "name": "平陆县",
            "next": []
          },
          {
            "code": "140828",
            "name": "夏县",
            "next": []
          }
        ]
      },
      {
        "code": "140500",
        "name": "晋城市",
        "next": [
          {
            "code": "140522",
            "name": "阳城县",
            "next": []
          },
          {
            "code": "140521",
            "name": "沁水县",
            "next": []
          },
          {
            "code": "140524",
            "name": "陵川县",
            "next": []
          },
          {
            "code": "140525",
            "name": "泽州县",
            "next": []
          },
          {
            "code": "140501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "140502",
            "name": "晋城市城区",
            "next": []
          },
          {
            "code": "140581",
            "name": "高平市",
            "next": []
          }
        ]
      },
      {
        "code": "141100",
        "name": "吕梁市",
        "next": [
          {
            "code": "141102",
            "name": "离石区",
            "next": []
          },
          {
            "code": "141101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "141130",
            "name": "交口县",
            "next": []
          },
          {
            "code": "141181",
            "name": "孝义市",
            "next": []
          },
          {
            "code": "141129",
            "name": "中阳县",
            "next": []
          },
          {
            "code": "141128",
            "name": "方山县",
            "next": []
          },
          {
            "code": "141121",
            "name": "文水县",
            "next": []
          },
          {
            "code": "141182",
            "name": "汾阳市",
            "next": []
          },
          {
            "code": "141123",
            "name": "兴县",
            "next": []
          },
          {
            "code": "141122",
            "name": "交城县",
            "next": []
          },
          {
            "code": "141125",
            "name": "柳林县",
            "next": []
          },
          {
            "code": "141124",
            "name": "临县",
            "next": []
          },
          {
            "code": "141127",
            "name": "岚县",
            "next": []
          },
          {
            "code": "141126",
            "name": "石楼县",
            "next": []
          }
        ]
      },
      {
        "code": "140400",
        "name": "长治市",
        "next": [
          {
            "code": "140431",
            "name": "沁源县",
            "next": []
          },
          {
            "code": "140402",
            "name": "长治市城区",
            "next": []
          },
          {
            "code": "140481",
            "name": "潞城市",
            "next": []
          },
          {
            "code": "140430",
            "name": "沁县",
            "next": []
          },
          {
            "code": "140428",
            "name": "长子县",
            "next": []
          },
          {
            "code": "140401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "140429",
            "name": "武乡县",
            "next": []
          },
          {
            "code": "140411",
            "name": "长治市郊区",
            "next": []
          },
          {
            "code": "140427",
            "name": "壶关县",
            "next": []
          },
          {
            "code": "140426",
            "name": "黎城县",
            "next": []
          },
          {
            "code": "140425",
            "name": "平顺县",
            "next": []
          },
          {
            "code": "140424",
            "name": "屯留县",
            "next": []
          },
          {
            "code": "140423",
            "name": "襄垣县",
            "next": []
          },
          {
            "code": "140421",
            "name": "长治县",
            "next": []
          }
        ]
      },
      {
        "code": "140300",
        "name": "阳泉市",
        "next": [
          {
            "code": "140321",
            "name": "平定县",
            "next": []
          },
          {
            "code": "140322",
            "name": "盂县",
            "next": []
          },
          {
            "code": "140311",
            "name": "郊区",
            "next": []
          },
          {
            "code": "140302",
            "name": "城区",
            "next": []
          },
          {
            "code": "140303",
            "name": "矿区",
            "next": []
          },
          {
            "code": "140301",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "141000",
        "name": "临汾市",
        "next": [
          {
            "code": "141024",
            "name": "洪洞县",
            "next": []
          },
          {
            "code": "141025",
            "name": "古县",
            "next": []
          },
          {
            "code": "141026",
            "name": "安泽县",
            "next": []
          },
          {
            "code": "141027",
            "name": "浮山县",
            "next": []
          },
          {
            "code": "141021",
            "name": "曲沃县",
            "next": []
          },
          {
            "code": "141022",
            "name": "翼城县",
            "next": []
          },
          {
            "code": "141023",
            "name": "襄汾县",
            "next": []
          },
          {
            "code": "141034",
            "name": "汾西县",
            "next": []
          },
          {
            "code": "141028",
            "name": "吉县",
            "next": []
          },
          {
            "code": "141029",
            "name": "乡宁县",
            "next": []
          },
          {
            "code": "141033",
            "name": "蒲县",
            "next": []
          },
          {
            "code": "141082",
            "name": "霍州市",
            "next": []
          },
          {
            "code": "141030",
            "name": "大宁县",
            "next": []
          },
          {
            "code": "141031",
            "name": "隰县",
            "next": []
          },
          {
            "code": "141002",
            "name": "尧都区",
            "next": []
          },
          {
            "code": "141032",
            "name": "永和县",
            "next": []
          },
          {
            "code": "141081",
            "name": "侯马市",
            "next": []
          },
          {
            "code": "141001",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "140700",
        "name": "晋中市",
        "next": [
          {
            "code": "140781",
            "name": "介休市",
            "next": []
          },
          {
            "code": "140724",
            "name": "昔阳县",
            "next": []
          },
          {
            "code": "140728",
            "name": "平遥县",
            "next": []
          },
          {
            "code": "140729",
            "name": "灵石县",
            "next": []
          },
          {
            "code": "140727",
            "name": "祁县",
            "next": []
          },
          {
            "code": "140721",
            "name": "榆社县",
            "next": []
          },
          {
            "code": "140722",
            "name": "左权县",
            "next": []
          },
          {
            "code": "140723",
            "name": "和顺县",
            "next": []
          },
          {
            "code": "140702",
            "name": "榆次区",
            "next": []
          },
          {
            "code": "140725",
            "name": "寿阳县",
            "next": []
          },
          {
            "code": "140726",
            "name": "太谷县",
            "next": []
          },
          {
            "code": "140701",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "230000",
    "name": "黑龙江省",
    "next": [
      {
        "code": "230200",
        "name": "齐齐哈尔市",
        "next": [
          {
            "code": "230201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "230203",
            "name": "建华区",
            "next": []
          },
          {
            "code": "230202",
            "name": "龙沙区",
            "next": []
          },
          {
            "code": "230205",
            "name": "昂昂溪区",
            "next": []
          },
          {
            "code": "230204",
            "name": "铁锋区",
            "next": []
          },
          {
            "code": "230207",
            "name": "碾子山区",
            "next": []
          },
          {
            "code": "230206",
            "name": "富拉尔基区",
            "next": []
          },
          {
            "code": "230223",
            "name": "依安县",
            "next": []
          },
          {
            "code": "230208",
            "name": "梅里斯达斡尔族区",
            "next": []
          },
          {
            "code": "230221",
            "name": "龙江县",
            "next": []
          },
          {
            "code": "230227",
            "name": "富裕县",
            "next": []
          },
          {
            "code": "230229",
            "name": "克山县",
            "next": []
          },
          {
            "code": "230225",
            "name": "甘南县",
            "next": []
          },
          {
            "code": "230224",
            "name": "泰来县",
            "next": []
          },
          {
            "code": "230281",
            "name": "讷河市",
            "next": []
          },
          {
            "code": "230231",
            "name": "拜泉县",
            "next": []
          },
          {
            "code": "230230",
            "name": "克东县",
            "next": []
          }
        ]
      },
      {
        "code": "230900",
        "name": "七台河市",
        "next": [
          {
            "code": "230902",
            "name": "新兴区",
            "next": []
          },
          {
            "code": "230903",
            "name": "桃山区",
            "next": []
          },
          {
            "code": "230901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "230921",
            "name": "勃利县",
            "next": []
          },
          {
            "code": "230904",
            "name": "茄子河区",
            "next": []
          }
        ]
      },
      {
        "code": "230600",
        "name": "大庆市",
        "next": [
          {
            "code": "230605",
            "name": "红岗区",
            "next": []
          },
          {
            "code": "230604",
            "name": "让胡路区",
            "next": []
          },
          {
            "code": "230606",
            "name": "大同区",
            "next": []
          },
          {
            "code": "230601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "230603",
            "name": "龙凤区",
            "next": []
          },
          {
            "code": "230602",
            "name": "萨尔图区",
            "next": []
          },
          {
            "code": "230624",
            "name": "杜尔伯特县",
            "next": []
          },
          {
            "code": "230623",
            "name": "林甸县",
            "next": []
          },
          {
            "code": "230622",
            "name": "肇源县",
            "next": []
          },
          {
            "code": "230621",
            "name": "肇州县",
            "next": []
          }
        ]
      },
      {
        "code": "232700",
        "name": "大兴安岭地区",
        "next": [
          {
            "code": "232721",
            "name": "呼玛县",
            "next": []
          },
          {
            "code": "232722",
            "name": "塔河县",
            "next": []
          },
          {
            "code": "232723",
            "name": "漠河县",
            "next": []
          },
          {
            "code": "232702",
            "name": "松岭区",
            "next": []
          },
          {
            "code": "232703",
            "name": "新林区",
            "next": []
          },
          {
            "code": "232701",
            "name": "加格达奇区",
            "next": []
          },
          {
            "code": "232704",
            "name": "呼中区",
            "next": []
          }
        ]
      },
      {
        "code": "231000",
        "name": "牡丹江市",
        "next": [
          {
            "code": "231084",
            "name": "宁安市",
            "next": []
          },
          {
            "code": "231085",
            "name": "穆棱市",
            "next": []
          },
          {
            "code": "231081",
            "name": "绥芬河市",
            "next": []
          },
          {
            "code": "231083",
            "name": "海林市",
            "next": []
          },
          {
            "code": "231024",
            "name": "东宁县",
            "next": []
          },
          {
            "code": "231025",
            "name": "林口县",
            "next": []
          },
          {
            "code": "231004",
            "name": "爱民区",
            "next": []
          },
          {
            "code": "231005",
            "name": "西安区",
            "next": []
          },
          {
            "code": "231001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "231002",
            "name": "东安区",
            "next": []
          },
          {
            "code": "231003",
            "name": "阳明区",
            "next": []
          }
        ]
      },
      {
        "code": "230100",
        "name": "哈尔滨市",
        "next": [
          {
            "code": "230182",
            "name": "双城市",
            "next": []
          },
          {
            "code": "230124",
            "name": "方正县",
            "next": []
          },
          {
            "code": "230108",
            "name": "平房区",
            "next": []
          },
          {
            "code": "230109",
            "name": "松北区",
            "next": []
          },
          {
            "code": "230184",
            "name": "五常市",
            "next": []
          },
          {
            "code": "230125",
            "name": "宾县",
            "next": []
          },
          {
            "code": "230102",
            "name": "道里区",
            "next": []
          },
          {
            "code": "230103",
            "name": "南岗区",
            "next": []
          },
          {
            "code": "230101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "230104",
            "name": "道外区",
            "next": []
          },
          {
            "code": "230123",
            "name": "依兰县",
            "next": []
          },
          {
            "code": "230111",
            "name": "呼兰区",
            "next": []
          },
          {
            "code": "230126",
            "name": "巴彦县",
            "next": []
          },
          {
            "code": "230127",
            "name": "木兰县",
            "next": []
          },
          {
            "code": "230110",
            "name": "香坊区",
            "next": []
          },
          {
            "code": "230183",
            "name": "尚志市",
            "next": []
          },
          {
            "code": "230112",
            "name": "阿城区",
            "next": []
          },
          {
            "code": "230128",
            "name": "通河县",
            "next": []
          },
          {
            "code": "230129",
            "name": "延寿县",
            "next": []
          }
        ]
      },
      {
        "code": "230800",
        "name": "佳木斯市",
        "next": [
          {
            "code": "230833",
            "name": "抚远县",
            "next": []
          },
          {
            "code": "230822",
            "name": "桦南县",
            "next": []
          },
          {
            "code": "230826",
            "name": "桦川县",
            "next": []
          },
          {
            "code": "230803",
            "name": "向阳区",
            "next": []
          },
          {
            "code": "230828",
            "name": "汤原县",
            "next": []
          },
          {
            "code": "230801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "230811",
            "name": "郊区",
            "next": []
          },
          {
            "code": "230805",
            "name": "东风区",
            "next": []
          },
          {
            "code": "230804",
            "name": "前进区",
            "next": []
          },
          {
            "code": "230882",
            "name": "富锦市",
            "next": []
          },
          {
            "code": "230881",
            "name": "同江市",
            "next": []
          }
        ]
      },
      {
        "code": "230500",
        "name": "双鸭山市",
        "next": [
          {
            "code": "230523",
            "name": "宝清县",
            "next": []
          },
          {
            "code": "230524",
            "name": "饶河县",
            "next": []
          },
          {
            "code": "230506",
            "name": "宝山区",
            "next": []
          },
          {
            "code": "230521",
            "name": "集贤县",
            "next": []
          },
          {
            "code": "230522",
            "name": "友谊县",
            "next": []
          },
          {
            "code": "230505",
            "name": "四方台区",
            "next": []
          },
          {
            "code": "230502",
            "name": "尖山区",
            "next": []
          },
          {
            "code": "230503",
            "name": "岭东区",
            "next": []
          },
          {
            "code": "230501",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "231200",
        "name": "绥化市",
        "next": [
          {
            "code": "231225",
            "name": "明水县",
            "next": []
          },
          {
            "code": "231221",
            "name": "望奎县",
            "next": []
          },
          {
            "code": "231222",
            "name": "兰西县",
            "next": []
          },
          {
            "code": "231223",
            "name": "青冈县",
            "next": []
          },
          {
            "code": "231202",
            "name": "北林区",
            "next": []
          },
          {
            "code": "231224",
            "name": "庆安县",
            "next": []
          },
          {
            "code": "231226",
            "name": "绥棱县",
            "next": []
          },
          {
            "code": "231201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "231282",
            "name": "肇东市",
            "next": []
          },
          {
            "code": "231283",
            "name": "海伦市",
            "next": []
          },
          {
            "code": "231281",
            "name": "安达市",
            "next": []
          }
        ]
      },
      {
        "code": "230400",
        "name": "鹤岗市",
        "next": [
          {
            "code": "230421",
            "name": "萝北县",
            "next": []
          },
          {
            "code": "230422",
            "name": "绥滨县",
            "next": []
          },
          {
            "code": "230407",
            "name": "兴山区",
            "next": []
          },
          {
            "code": "230406",
            "name": "东山区",
            "next": []
          },
          {
            "code": "230405",
            "name": "兴安区",
            "next": []
          },
          {
            "code": "230404",
            "name": "南山区",
            "next": []
          },
          {
            "code": "230403",
            "name": "工农区",
            "next": []
          },
          {
            "code": "230402",
            "name": "向阳区",
            "next": []
          },
          {
            "code": "230401",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "230300",
        "name": "鸡西市",
        "next": [
          {
            "code": "230381",
            "name": "虎林市",
            "next": []
          },
          {
            "code": "230382",
            "name": "密山市",
            "next": []
          },
          {
            "code": "230321",
            "name": "鸡东县",
            "next": []
          },
          {
            "code": "230301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "230302",
            "name": "鸡冠区",
            "next": []
          },
          {
            "code": "230303",
            "name": "恒山区",
            "next": []
          },
          {
            "code": "230304",
            "name": "滴道区",
            "next": []
          },
          {
            "code": "230305",
            "name": "梨树区",
            "next": []
          },
          {
            "code": "230306",
            "name": "城子河区",
            "next": []
          },
          {
            "code": "230307",
            "name": "麻山区",
            "next": []
          }
        ]
      },
      {
        "code": "230700",
        "name": "伊春市",
        "next": [
          {
            "code": "230710",
            "name": "五营区",
            "next": []
          },
          {
            "code": "230781",
            "name": "铁力市",
            "next": []
          },
          {
            "code": "230714",
            "name": "乌伊岭区",
            "next": []
          },
          {
            "code": "230715",
            "name": "红星区",
            "next": []
          },
          {
            "code": "230716",
            "name": "上甘岭区",
            "next": []
          },
          {
            "code": "230722",
            "name": "嘉荫县",
            "next": []
          },
          {
            "code": "230713",
            "name": "带岭区",
            "next": []
          },
          {
            "code": "230708",
            "name": "美溪区",
            "next": []
          },
          {
            "code": "230709",
            "name": "金山屯区",
            "next": []
          },
          {
            "code": "230711",
            "name": "乌马河区",
            "next": []
          },
          {
            "code": "230712",
            "name": "汤旺河区",
            "next": []
          },
          {
            "code": "230704",
            "name": "友好区",
            "next": []
          },
          {
            "code": "230705",
            "name": "西林区",
            "next": []
          },
          {
            "code": "230706",
            "name": "翠峦区",
            "next": []
          },
          {
            "code": "230707",
            "name": "新青区",
            "next": []
          },
          {
            "code": "230701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "230702",
            "name": "伊春区",
            "next": []
          },
          {
            "code": "230703",
            "name": "南岔区",
            "next": []
          }
        ]
      },
      {
        "code": "231100",
        "name": "黑河市",
        "next": [
          {
            "code": "231101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "231102",
            "name": "爱辉区",
            "next": []
          },
          {
            "code": "231124",
            "name": "孙吴县",
            "next": []
          },
          {
            "code": "231123",
            "name": "逊克县",
            "next": []
          },
          {
            "code": "231121",
            "name": "嫩江县",
            "next": []
          },
          {
            "code": "231181",
            "name": "北安市",
            "next": []
          },
          {
            "code": "231182",
            "name": "五大连池市",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "360000",
    "name": "江西省",
    "next": [
      {
        "code": "360800",
        "name": "吉安市",
        "next": [
          {
            "code": "360801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360830",
            "name": "永新县",
            "next": []
          },
          {
            "code": "360803",
            "name": "青原区",
            "next": []
          },
          {
            "code": "360802",
            "name": "吉州区",
            "next": []
          },
          {
            "code": "360829",
            "name": "安福县",
            "next": []
          },
          {
            "code": "360823",
            "name": "峡江县",
            "next": []
          },
          {
            "code": "360822",
            "name": "吉水县",
            "next": []
          },
          {
            "code": "360821",
            "name": "吉安县",
            "next": []
          },
          {
            "code": "360827",
            "name": "遂川县",
            "next": []
          },
          {
            "code": "360826",
            "name": "泰和县",
            "next": []
          },
          {
            "code": "360825",
            "name": "永丰县",
            "next": []
          },
          {
            "code": "360824",
            "name": "新干县",
            "next": []
          },
          {
            "code": "360881",
            "name": "井冈山市",
            "next": []
          },
          {
            "code": "360828",
            "name": "万安县",
            "next": []
          }
        ]
      },
      {
        "code": "360300",
        "name": "萍乡市",
        "next": [
          {
            "code": "360302",
            "name": "安源区",
            "next": []
          },
          {
            "code": "360313",
            "name": "湘东区",
            "next": []
          },
          {
            "code": "360301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360321",
            "name": "莲花县",
            "next": []
          },
          {
            "code": "360322",
            "name": "上栗县",
            "next": []
          },
          {
            "code": "360323",
            "name": "芦溪县",
            "next": []
          }
        ]
      },
      {
        "code": "361100",
        "name": "上饶市",
        "next": [
          {
            "code": "361121",
            "name": "上饶县",
            "next": []
          },
          {
            "code": "361123",
            "name": "玉山县",
            "next": []
          },
          {
            "code": "361122",
            "name": "广丰县",
            "next": []
          },
          {
            "code": "361125",
            "name": "横峰县",
            "next": []
          },
          {
            "code": "361124",
            "name": "铅山县",
            "next": []
          },
          {
            "code": "361127",
            "name": "余干县",
            "next": []
          },
          {
            "code": "361126",
            "name": "弋阳县",
            "next": []
          },
          {
            "code": "361129",
            "name": "万年县",
            "next": []
          },
          {
            "code": "361102",
            "name": "信州区",
            "next": []
          },
          {
            "code": "361101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "361130",
            "name": "婺源县",
            "next": []
          },
          {
            "code": "361181",
            "name": "德兴市",
            "next": []
          },
          {
            "code": "361128",
            "name": "鄱阳县",
            "next": []
          }
        ]
      },
      {
        "code": "360700",
        "name": "赣州市",
        "next": [
          {
            "code": "360721",
            "name": "赣县",
            "next": []
          },
          {
            "code": "360722",
            "name": "信丰县",
            "next": []
          },
          {
            "code": "360723",
            "name": "大余县",
            "next": []
          },
          {
            "code": "360702",
            "name": "章贡区",
            "next": []
          },
          {
            "code": "360725",
            "name": "崇义县",
            "next": []
          },
          {
            "code": "360726",
            "name": "安远县",
            "next": []
          },
          {
            "code": "360701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360728",
            "name": "定南县",
            "next": []
          },
          {
            "code": "360729",
            "name": "全南县",
            "next": []
          },
          {
            "code": "360735",
            "name": "石城县",
            "next": []
          },
          {
            "code": "360727",
            "name": "龙南县",
            "next": []
          },
          {
            "code": "360733",
            "name": "会昌县",
            "next": []
          },
          {
            "code": "360732",
            "name": "兴国县",
            "next": []
          },
          {
            "code": "360731",
            "name": "于都县",
            "next": []
          },
          {
            "code": "360730",
            "name": "宁都县",
            "next": []
          },
          {
            "code": "360734",
            "name": "寻乌县",
            "next": []
          },
          {
            "code": "360724",
            "name": "上犹县",
            "next": []
          },
          {
            "code": "360782",
            "name": "南康市",
            "next": []
          },
          {
            "code": "360781",
            "name": "瑞金市",
            "next": []
          }
        ]
      },
      {
        "code": "360200",
        "name": "景德镇市",
        "next": [
          {
            "code": "360203",
            "name": "珠山区",
            "next": []
          },
          {
            "code": "360202",
            "name": "昌江区",
            "next": []
          },
          {
            "code": "360201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360222",
            "name": "浮梁县",
            "next": []
          },
          {
            "code": "360281",
            "name": "乐平市",
            "next": []
          }
        ]
      },
      {
        "code": "361000",
        "name": "抚州市",
        "next": [
          {
            "code": "361002",
            "name": "临川区",
            "next": []
          },
          {
            "code": "361030",
            "name": "广昌县",
            "next": []
          },
          {
            "code": "361001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "361028",
            "name": "资溪县",
            "next": []
          },
          {
            "code": "361029",
            "name": "东乡县",
            "next": []
          },
          {
            "code": "361024",
            "name": "崇仁县",
            "next": []
          },
          {
            "code": "361025",
            "name": "乐安县",
            "next": []
          },
          {
            "code": "361026",
            "name": "宜黄县",
            "next": []
          },
          {
            "code": "361027",
            "name": "金溪县",
            "next": []
          },
          {
            "code": "361021",
            "name": "南城县",
            "next": []
          },
          {
            "code": "361022",
            "name": "黎川县",
            "next": []
          },
          {
            "code": "361023",
            "name": "南丰县",
            "next": []
          }
        ]
      },
      {
        "code": "360600",
        "name": "鹰潭市",
        "next": [
          {
            "code": "360681",
            "name": "贵溪市",
            "next": []
          },
          {
            "code": "360602",
            "name": "月湖区",
            "next": []
          },
          {
            "code": "360601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360622",
            "name": "余江县",
            "next": []
          }
        ]
      },
      {
        "code": "360100",
        "name": "南昌市",
        "next": [
          {
            "code": "360124",
            "name": "进贤县",
            "next": []
          },
          {
            "code": "360101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360102",
            "name": "东湖区",
            "next": []
          },
          {
            "code": "360103",
            "name": "西湖区",
            "next": []
          },
          {
            "code": "360104",
            "name": "青云谱区",
            "next": []
          },
          {
            "code": "360105",
            "name": "湾里区",
            "next": []
          },
          {
            "code": "360121",
            "name": "南昌县",
            "next": []
          },
          {
            "code": "360122",
            "name": "新建县",
            "next": []
          },
          {
            "code": "360111",
            "name": "青山湖区",
            "next": []
          },
          {
            "code": "360123",
            "name": "安义县",
            "next": []
          }
        ]
      },
      {
        "code": "360500",
        "name": "新余市",
        "next": [
          {
            "code": "360521",
            "name": "分宜县",
            "next": []
          },
          {
            "code": "360501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360502",
            "name": "渝水区",
            "next": []
          }
        ]
      },
      {
        "code": "360900",
        "name": "宜春市",
        "next": [
          {
            "code": "360981",
            "name": "丰城市",
            "next": []
          },
          {
            "code": "360982",
            "name": "樟树市",
            "next": []
          },
          {
            "code": "360983",
            "name": "高安市",
            "next": []
          },
          {
            "code": "360923",
            "name": "上高县",
            "next": []
          },
          {
            "code": "360926",
            "name": "铜鼓县",
            "next": []
          },
          {
            "code": "360901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360902",
            "name": "袁州区",
            "next": []
          },
          {
            "code": "360925",
            "name": "靖安县                              ",
            "next": []
          },
          {
            "code": "360922",
            "name": "万载县",
            "next": []
          },
          {
            "code": "360924",
            "name": "宜丰县",
            "next": []
          },
          {
            "code": "360921",
            "name": "奉新县",
            "next": []
          }
        ]
      },
      {
        "code": "360400",
        "name": "九江市",
        "next": [
          {
            "code": "360427",
            "name": "星子县",
            "next": []
          },
          {
            "code": "360426",
            "name": "德安县",
            "next": []
          },
          {
            "code": "360425",
            "name": "永修县",
            "next": []
          },
          {
            "code": "360424",
            "name": "修水县",
            "next": []
          },
          {
            "code": "360423",
            "name": "武宁县",
            "next": []
          },
          {
            "code": "360421",
            "name": "九江县",
            "next": []
          },
          {
            "code": "360429",
            "name": "湖口县",
            "next": []
          },
          {
            "code": "360428",
            "name": "都昌县",
            "next": []
          },
          {
            "code": "360430",
            "name": "彭泽县",
            "next": []
          },
          {
            "code": "360481",
            "name": "瑞昌市",
            "next": []
          },
          {
            "code": "360401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "360403",
            "name": "浔阳区",
            "next": []
          },
          {
            "code": "360402",
            "name": "庐山区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "500000",
    "name": "重庆市",
    "next": [
      {
        "code": "500100",
        "name": "重庆市",
        "next": [
          {
            "code": "500119",
            "name": "南川区",
            "next": []
          },
          {
            "code": "500116",
            "name": "江津区",
            "next": []
          },
          {
            "code": "500117",
            "name": "合川区",
            "next": []
          },
          {
            "code": "500118",
            "name": "永川区",
            "next": []
          },
          {
            "code": "500101",
            "name": "万州区",
            "next": []
          },
          {
            "code": "500102",
            "name": "涪陵区",
            "next": []
          },
          {
            "code": "500103",
            "name": "渝中区",
            "next": []
          },
          {
            "code": "500104",
            "name": "大渡口区",
            "next": []
          },
          {
            "code": "500105",
            "name": "江北区",
            "next": []
          },
          {
            "code": "500106",
            "name": "沙坪坝区",
            "next": []
          },
          {
            "code": "500107",
            "name": "九龙坡区",
            "next": []
          },
          {
            "code": "500108",
            "name": "南岸区",
            "next": []
          },
          {
            "code": "500109",
            "name": "北碚区",
            "next": []
          },
          {
            "code": "500115",
            "name": "长寿区",
            "next": []
          },
          {
            "code": "500114",
            "name": "黔江区",
            "next": []
          },
          {
            "code": "500113",
            "name": "巴南区",
            "next": []
          },
          {
            "code": "500112",
            "name": "渝北区",
            "next": []
          },
          {
            "code": "500111",
            "name": "双桥区",
            "next": []
          },
          {
            "code": "500110",
            "name": "万盛区",
            "next": []
          },
          {
            "code": "500132",
            "name": "武隆县",
            "next": []
          },
          {
            "code": "500133",
            "name": "忠县",
            "next": []
          },
          {
            "code": "500123",
            "name": "潼南县",
            "next": []
          },
          {
            "code": "500122",
            "name": "綦江县",
            "next": []
          },
          {
            "code": "500125",
            "name": "大足县",
            "next": []
          },
          {
            "code": "500124",
            "name": "铜梁县",
            "next": []
          },
          {
            "code": "500127",
            "name": "璧山县",
            "next": []
          },
          {
            "code": "500126",
            "name": "荣昌县",
            "next": []
          },
          {
            "code": "500129",
            "name": "城口县",
            "next": []
          },
          {
            "code": "500128",
            "name": "梁平县",
            "next": []
          },
          {
            "code": "500138",
            "name": "巫溪县",
            "next": []
          },
          {
            "code": "500135",
            "name": "云阳县",
            "next": []
          },
          {
            "code": "500143",
            "name": "彭水苗族土家族自治县",
            "next": []
          },
          {
            "code": "500130",
            "name": "丰都县",
            "next": []
          },
          {
            "code": "500142",
            "name": "酉阳土家族苗族自治县",
            "next": []
          },
          {
            "code": "500140",
            "name": "石柱县",
            "next": []
          },
          {
            "code": "500131",
            "name": "垫江县",
            "next": []
          },
          {
            "code": "500141",
            "name": "秀山土家族苗族自治县",
            "next": []
          },
          {
            "code": "500136",
            "name": "奉节县",
            "next": []
          },
          {
            "code": "500134",
            "name": "开县",
            "next": []
          },
          {
            "code": "500137",
            "name": "巫山县",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "410000",
    "name": "河南省",
    "next": [
      {
        "code": "410300",
        "name": "洛阳市",
        "next": [
          {
            "code": "410326",
            "name": "汝阳县",
            "next": []
          },
          {
            "code": "410301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "410302",
            "name": "老城区",
            "next": []
          },
          {
            "code": "410303",
            "name": "西工区",
            "next": []
          },
          {
            "code": "410304",
            "name": "廛河回族区",
            "next": []
          },
          {
            "code": "410305",
            "name": "涧西区",
            "next": []
          },
          {
            "code": "410306",
            "name": "吉利区",
            "next": []
          },
          {
            "code": "410307",
            "name": "洛龙区",
            "next": []
          },
          {
            "code": "410324",
            "name": "栾川县",
            "next": []
          },
          {
            "code": "410328",
            "name": "洛宁县",
            "next": []
          },
          {
            "code": "410329",
            "name": "伊川县",
            "next": []
          },
          {
            "code": "410325",
            "name": "嵩县",
            "next": []
          },
          {
            "code": "410381",
            "name": "偃师市",
            "next": []
          },
          {
            "code": "410322",
            "name": "孟津县",
            "next": []
          },
          {
            "code": "410327",
            "name": "宜阳县",
            "next": []
          },
          {
            "code": "410323",
            "name": "新安县",
            "next": []
          }
        ]
      },
      {
        "code": "411400",
        "name": "商丘市",
        "next": [
          {
            "code": "411426",
            "name": "夏邑县",
            "next": []
          },
          {
            "code": "411401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "411402",
            "name": "梁园区",
            "next": []
          },
          {
            "code": "411403",
            "name": "睢阳区",
            "next": []
          },
          {
            "code": "411422",
            "name": "睢县",
            "next": []
          },
          {
            "code": "411423",
            "name": "宁陵县",
            "next": []
          },
          {
            "code": "411421",
            "name": "民权县",
            "next": []
          },
          {
            "code": "411424",
            "name": "柘城县",
            "next": []
          },
          {
            "code": "411425",
            "name": "虞城县",
            "next": []
          },
          {
            "code": "411481",
            "name": "永城市",
            "next": []
          }
        ]
      },
      {
        "code": "410800",
        "name": "焦作市",
        "next": [
          {
            "code": "410803",
            "name": "中站区",
            "next": []
          },
          {
            "code": "410802",
            "name": "解放区",
            "next": []
          },
          {
            "code": "410801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "410811",
            "name": "山阳区",
            "next": []
          },
          {
            "code": "410804",
            "name": "马村区",
            "next": []
          },
          {
            "code": "410883",
            "name": "孟州市",
            "next": []
          },
          {
            "code": "410821",
            "name": "修武县",
            "next": []
          },
          {
            "code": "410882",
            "name": "沁阳市",
            "next": []
          },
          {
            "code": "410823",
            "name": "武陟县",
            "next": []
          },
          {
            "code": "410822",
            "name": "博爱县",
            "next": []
          },
          {
            "code": "410825",
            "name": "温县",
            "next": []
          },
          {
            "code": "410881",
            "name": "济源市",
            "next": []
          }
        ]
      },
      {
        "code": "410700",
        "name": "新乡市",
        "next": [
          {
            "code": "410704",
            "name": "凤泉区",
            "next": []
          },
          {
            "code": "410711",
            "name": "牧野区",
            "next": []
          },
          {
            "code": "410701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "410702",
            "name": "红旗区",
            "next": []
          },
          {
            "code": "410703",
            "name": "卫滨区",
            "next": []
          },
          {
            "code": "410781",
            "name": "卫辉市",
            "next": []
          },
          {
            "code": "410728",
            "name": "长垣县",
            "next": []
          },
          {
            "code": "410782",
            "name": "辉县市",
            "next": []
          },
          {
            "code": "410721",
            "name": "新乡县",
            "next": []
          },
          {
            "code": "410726",
            "name": "延津县",
            "next": []
          },
          {
            "code": "410727",
            "name": "封丘县",
            "next": []
          },
          {
            "code": "410724",
            "name": "获嘉县",
            "next": []
          },
          {
            "code": "410725",
            "name": "原阳县",
            "next": []
          }
        ]
      },
      {
        "code": "411200",
        "name": "三门峡市",
        "next": [
          {
            "code": "411282",
            "name": "灵宝市",
            "next": []
          },
          {
            "code": "411281",
            "name": "义马市",
            "next": []
          },
          {
            "code": "411221",
            "name": "渑池县",
            "next": []
          },
          {
            "code": "411222",
            "name": "陕县",
            "next": []
          },
          {
            "code": "411202",
            "name": "湖滨区",
            "next": []
          },
          {
            "code": "411201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "411224",
            "name": "卢氏县",
            "next": []
          }
        ]
      },
      {
        "code": "410200",
        "name": "开封市",
        "next": [
          {
            "code": "410211",
            "name": "金明区",
            "next": []
          },
          {
            "code": "410201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "410203",
            "name": "顺河区",
            "next": []
          },
          {
            "code": "410202",
            "name": "龙亭区",
            "next": []
          },
          {
            "code": "410205",
            "name": "禹王台区",
            "next": []
          },
          {
            "code": "410204",
            "name": "鼓楼区",
            "next": []
          },
          {
            "code": "410223",
            "name": "尉氏县",
            "next": []
          },
          {
            "code": "410222",
            "name": "通许县",
            "next": []
          },
          {
            "code": "410221",
            "name": "杞县",
            "next": []
          },
          {
            "code": "410225",
            "name": "兰考县",
            "next": []
          },
          {
            "code": "410224",
            "name": "开封县",
            "next": []
          }
        ]
      },
      {
        "code": "410600",
        "name": "鹤壁市",
        "next": [
          {
            "code": "410601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "410603",
            "name": "山城区",
            "next": []
          },
          {
            "code": "410611",
            "name": "淇滨区",
            "next": []
          },
          {
            "code": "410622",
            "name": "淇县",
            "next": []
          },
          {
            "code": "410621",
            "name": "浚县",
            "next": []
          },
          {
            "code": "410602",
            "name": "鹤山区",
            "next": []
          }
        ]
      },
      {
        "code": "411700",
        "name": "驻马店市",
        "next": [
          {
            "code": "411728",
            "name": "遂平县",
            "next": []
          },
          {
            "code": "411721",
            "name": "西平县",
            "next": []
          },
          {
            "code": "411723",
            "name": "平舆县",
            "next": []
          },
          {
            "code": "411722",
            "name": "上蔡县",
            "next": []
          },
          {
            "code": "411725",
            "name": "确山县",
            "next": []
          },
          {
            "code": "411724",
            "name": "正阳县",
            "next": []
          },
          {
            "code": "411727",
            "name": "汝南县",
            "next": []
          },
          {
            "code": "411726",
            "name": "泌阳县",
            "next": []
          },
          {
            "code": "411729",
            "name": "新蔡县",
            "next": []
          },
          {
            "code": "411702",
            "name": "驿城区",
            "next": []
          },
          {
            "code": "411701",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "411100",
        "name": "漯河市",
        "next": [
          {
            "code": "411104",
            "name": "召陵区",
            "next": []
          },
          {
            "code": "411101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "411103",
            "name": "郾城区",
            "next": []
          },
          {
            "code": "411102",
            "name": "源汇区",
            "next": []
          },
          {
            "code": "411122",
            "name": "临颖县",
            "next": []
          },
          {
            "code": "411121",
            "name": "舞阳县",
            "next": []
          }
        ]
      },
      {
        "code": "410100",
        "name": "郑州市",
        "next": [
          {
            "code": "410102",
            "name": "中原区",
            "next": []
          },
          {
            "code": "410103",
            "name": "二七区",
            "next": []
          },
          {
            "code": "410101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "410106",
            "name": "上街区",
            "next": []
          },
          {
            "code": "410184",
            "name": "新郑市",
            "next": []
          },
          {
            "code": "410104",
            "name": "管城回族区",
            "next": []
          },
          {
            "code": "410105",
            "name": "金水区",
            "next": []
          },
          {
            "code": "410182",
            "name": "荥阳市",
            "next": []
          },
          {
            "code": "410183",
            "name": "新密市",
            "next": []
          },
          {
            "code": "410108",
            "name": "惠济区",
            "next": []
          },
          {
            "code": "410181",
            "name": "巩义市",
            "next": []
          },
          {
            "code": "410122",
            "name": "中牟县",
            "next": []
          },
          {
            "code": "410185",
            "name": "登封市",
            "next": []
          }
        ]
      },
      {
        "code": "410500",
        "name": "安阳市",
        "next": [
          {
            "code": "410527",
            "name": "内黄县",
            "next": []
          },
          {
            "code": "410523",
            "name": "汤阴县",
            "next": []
          },
          {
            "code": "410581",
            "name": "林州市",
            "next": []
          },
          {
            "code": "410506",
            "name": "龙安区",
            "next": []
          },
          {
            "code": "410522",
            "name": "安阳县",
            "next": []
          },
          {
            "code": "410505",
            "name": "殷都区",
            "next": []
          },
          {
            "code": "410502",
            "name": "文峰区",
            "next": []
          },
          {
            "code": "410503",
            "name": "北关区",
            "next": []
          },
          {
            "code": "410526",
            "name": "滑县",
            "next": []
          },
          {
            "code": "410501",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "411500",
        "name": "信阳市",
        "next": [
          {
            "code": "411501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "411503",
            "name": "平桥区",
            "next": []
          },
          {
            "code": "411502",
            "name": "_河区",
            "next": []
          },
          {
            "code": "411523",
            "name": "新县",
            "next": []
          },
          {
            "code": "411522",
            "name": "光山县",
            "next": []
          },
          {
            "code": "411521",
            "name": "罗山县",
            "next": []
          },
          {
            "code": "411527",
            "name": "淮滨县",
            "next": []
          },
          {
            "code": "411526",
            "name": "潢川县",
            "next": []
          },
          {
            "code": "411525",
            "name": "固始县",
            "next": []
          },
          {
            "code": "411524",
            "name": "商城县",
            "next": []
          },
          {
            "code": "411528",
            "name": "息县",
            "next": []
          }
        ]
      },
      {
        "code": "411600",
        "name": "周口市",
        "next": [
          {
            "code": "411681",
            "name": "项城市",
            "next": []
          },
          {
            "code": "411602",
            "name": "川汇区",
            "next": []
          },
          {
            "code": "411601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "411628",
            "name": "鹿邑县",
            "next": []
          },
          {
            "code": "411624",
            "name": "沈丘县",
            "next": []
          },
          {
            "code": "411625",
            "name": "郸城县",
            "next": []
          },
          {
            "code": "411626",
            "name": "淮阳县",
            "next": []
          },
          {
            "code": "411627",
            "name": "太康县",
            "next": []
          },
          {
            "code": "411621",
            "name": "扶沟县",
            "next": []
          },
          {
            "code": "411622",
            "name": "西华县",
            "next": []
          },
          {
            "code": "411623",
            "name": "商水县",
            "next": []
          }
        ]
      },
      {
        "code": "411000",
        "name": "许昌市",
        "next": [
          {
            "code": "411001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "411002",
            "name": "魏都区",
            "next": []
          },
          {
            "code": "411082",
            "name": "长葛市",
            "next": []
          },
          {
            "code": "411023",
            "name": "许昌县",
            "next": []
          },
          {
            "code": "411081",
            "name": "禹州市",
            "next": []
          },
          {
            "code": "411024",
            "name": "鄢陵县",
            "next": []
          },
          {
            "code": "411025",
            "name": "襄城县",
            "next": []
          }
        ]
      },
      {
        "code": "410900",
        "name": "濮阳市",
        "next": [
          {
            "code": "410926",
            "name": "范县",
            "next": []
          },
          {
            "code": "410927",
            "name": "台前县",
            "next": []
          },
          {
            "code": "410922",
            "name": "清丰县",
            "next": []
          },
          {
            "code": "410923",
            "name": "南乐县",
            "next": []
          },
          {
            "code": "410928",
            "name": "濮阳县",
            "next": []
          },
          {
            "code": "410902",
            "name": "华龙区",
            "next": []
          },
          {
            "code": "410901",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "411300",
        "name": "南阳市",
        "next": [
          {
            "code": "411330",
            "name": "桐柏县",
            "next": []
          },
          {
            "code": "411381",
            "name": "邓州市",
            "next": []
          },
          {
            "code": "411329",
            "name": "新野县",
            "next": []
          },
          {
            "code": "411328",
            "name": "唐河县",
            "next": []
          },
          {
            "code": "411325",
            "name": "内乡县",
            "next": []
          },
          {
            "code": "411324",
            "name": "镇平县",
            "next": []
          },
          {
            "code": "411327",
            "name": "社旗县",
            "next": []
          },
          {
            "code": "411326",
            "name": "淅川县",
            "next": []
          },
          {
            "code": "411321",
            "name": "南召县",
            "next": []
          },
          {
            "code": "411323",
            "name": "西峡县",
            "next": []
          },
          {
            "code": "411322",
            "name": "方城县",
            "next": []
          },
          {
            "code": "411303",
            "name": "卧龙区",
            "next": []
          },
          {
            "code": "411302",
            "name": "宛城区",
            "next": []
          },
          {
            "code": "411301",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "410400",
        "name": "平顶山市",
        "next": [
          {
            "code": "410481",
            "name": "舞钢市",
            "next": []
          },
          {
            "code": "410425",
            "name": "郏 县",
            "next": []
          },
          {
            "code": "410411",
            "name": "湛河区",
            "next": []
          },
          {
            "code": "410421",
            "name": "宝丰县",
            "next": []
          },
          {
            "code": "410482",
            "name": "汝州市",
            "next": []
          },
          {
            "code": "410423",
            "name": "鲁山县",
            "next": []
          },
          {
            "code": "410422",
            "name": "叶 县",
            "next": []
          },
          {
            "code": "410404",
            "name": "石龙区",
            "next": []
          },
          {
            "code": "410403",
            "name": "卫东区",
            "next": []
          },
          {
            "code": "410402",
            "name": "新华区",
            "next": []
          },
          {
            "code": "410401",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "220000",
    "name": "吉林省",
    "next": [
      {
        "code": "220400",
        "name": "辽源市",
        "next": [
          {
            "code": "220421",
            "name": "东丰县",
            "next": []
          },
          {
            "code": "220422",
            "name": "东辽县",
            "next": []
          },
          {
            "code": "220402",
            "name": "龙山区",
            "next": []
          },
          {
            "code": "220403",
            "name": "西安区",
            "next": []
          },
          {
            "code": "220401",
            "name": "辽源市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "220800",
        "name": "白城市",
        "next": [
          {
            "code": "220882",
            "name": "大安市",
            "next": []
          },
          {
            "code": "220881",
            "name": "洮南市",
            "next": []
          },
          {
            "code": "220802",
            "name": "洮北区",
            "next": []
          },
          {
            "code": "220801",
            "name": "白城市辖区",
            "next": []
          },
          {
            "code": "220821",
            "name": "镇赉县",
            "next": []
          },
          {
            "code": "220822",
            "name": "通榆县",
            "next": []
          }
        ]
      },
      {
        "code": "220100",
        "name": "长春市",
        "next": [
          {
            "code": "220122",
            "name": "农安县",
            "next": []
          },
          {
            "code": "220103",
            "name": "宽城区",
            "next": []
          },
          {
            "code": "220102",
            "name": "南关区",
            "next": []
          },
          {
            "code": "220101",
            "name": "长春市辖区",
            "next": []
          },
          {
            "code": "220106",
            "name": "绿园区",
            "next": []
          },
          {
            "code": "220105",
            "name": "二道区",
            "next": []
          },
          {
            "code": "220104",
            "name": "朝阳区",
            "next": []
          },
          {
            "code": "220183",
            "name": "德惠市",
            "next": []
          },
          {
            "code": "220182",
            "name": "榆树市",
            "next": []
          },
          {
            "code": "220181",
            "name": "九台市",
            "next": []
          },
          {
            "code": "220112",
            "name": "双阳区",
            "next": []
          }
        ]
      },
      {
        "code": "220500",
        "name": "通化市",
        "next": [
          {
            "code": "220524",
            "name": "柳河县",
            "next": []
          },
          {
            "code": "220521",
            "name": "通化县",
            "next": []
          },
          {
            "code": "220581",
            "name": "梅河口市",
            "next": []
          },
          {
            "code": "220523",
            "name": "辉南县",
            "next": []
          },
          {
            "code": "220503",
            "name": "二道江区",
            "next": []
          },
          {
            "code": "220502",
            "name": "东昌区",
            "next": []
          },
          {
            "code": "220501",
            "name": "通化市辖区",
            "next": []
          },
          {
            "code": "220582",
            "name": "集安市",
            "next": []
          }
        ]
      },
      {
        "code": "220200",
        "name": "吉林市",
        "next": [
          {
            "code": "220281",
            "name": "蛟河市",
            "next": []
          },
          {
            "code": "220282",
            "name": "桦甸市",
            "next": []
          },
          {
            "code": "220283",
            "name": "舒兰市",
            "next": []
          },
          {
            "code": "220284",
            "name": "磐石市",
            "next": []
          },
          {
            "code": "220201",
            "name": "吉林市辖区",
            "next": []
          },
          {
            "code": "220202",
            "name": "昌邑区",
            "next": []
          },
          {
            "code": "220203",
            "name": "龙潭区",
            "next": []
          },
          {
            "code": "220204",
            "name": "船营区",
            "next": []
          },
          {
            "code": "220221",
            "name": "永吉县",
            "next": []
          },
          {
            "code": "220211",
            "name": "丰满区",
            "next": []
          }
        ]
      },
      {
        "code": "220600",
        "name": "白山市",
        "next": [
          {
            "code": "220622",
            "name": "靖宇县",
            "next": []
          },
          {
            "code": "220623",
            "name": "长白朝鲜族自治县",
            "next": []
          },
          {
            "code": "220621",
            "name": "抚松县",
            "next": []
          },
          {
            "code": "220681",
            "name": "临江市",
            "next": []
          },
          {
            "code": "220604",
            "name": "江源区",
            "next": []
          },
          {
            "code": "220601",
            "name": "白山市辖区",
            "next": []
          },
          {
            "code": "220602",
            "name": "八道江区",
            "next": []
          }
        ]
      },
      {
        "code": "222400",
        "name": "延边朝鲜族自治州",
        "next": [
          {
            "code": "222424",
            "name": "汪清县",
            "next": []
          },
          {
            "code": "222426",
            "name": "安图县",
            "next": []
          },
          {
            "code": "222401",
            "name": "延吉市",
            "next": []
          },
          {
            "code": "222402",
            "name": "图们市",
            "next": []
          },
          {
            "code": "222403",
            "name": "敦化市",
            "next": []
          },
          {
            "code": "222404",
            "name": "珲春市",
            "next": []
          },
          {
            "code": "222405",
            "name": "龙井市",
            "next": []
          },
          {
            "code": "222406",
            "name": "和龙市",
            "next": []
          }
        ]
      },
      {
        "code": "220300",
        "name": "四平市",
        "next": [
          {
            "code": "220323",
            "name": "伊通满族自治县",
            "next": []
          },
          {
            "code": "220322",
            "name": "梨树县",
            "next": []
          },
          {
            "code": "220381",
            "name": "公主岭市",
            "next": []
          },
          {
            "code": "220382",
            "name": "双辽市",
            "next": []
          },
          {
            "code": "220301",
            "name": "四平市辖区",
            "next": []
          },
          {
            "code": "220303",
            "name": "铁东区",
            "next": []
          },
          {
            "code": "220302",
            "name": "铁西区",
            "next": []
          }
        ]
      },
      {
        "code": "220700",
        "name": "松原市",
        "next": [
          {
            "code": "220724",
            "name": "扶余县",
            "next": []
          },
          {
            "code": "220723",
            "name": "乾安县",
            "next": []
          },
          {
            "code": "220722",
            "name": "长岭县",
            "next": []
          },
          {
            "code": "220721",
            "name": "前郭尔罗斯蒙古族自治县",
            "next": []
          },
          {
            "code": "220701",
            "name": "松原市辖区",
            "next": []
          },
          {
            "code": "220702",
            "name": "宁江区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "520000",
    "name": "贵州省",
    "next": [
      {
        "code": "520300",
        "name": "遵义市",
        "next": [
          {
            "code": "520326",
            "name": "务川仡佬族苗族自治县",
            "next": []
          },
          {
            "code": "520301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "520302",
            "name": "红花岗区",
            "next": []
          },
          {
            "code": "520303",
            "name": "汇川区",
            "next": []
          },
          {
            "code": "520322",
            "name": "桐梓县",
            "next": []
          },
          {
            "code": "520323",
            "name": "绥阳县",
            "next": []
          },
          {
            "code": "520321",
            "name": "遵义县",
            "next": []
          },
          {
            "code": "520324",
            "name": "正安县",
            "next": []
          },
          {
            "code": "520328",
            "name": "湄潭县",
            "next": []
          },
          {
            "code": "520329",
            "name": "余庆县",
            "next": []
          },
          {
            "code": "520327",
            "name": "凤冈县",
            "next": []
          },
          {
            "code": "520325",
            "name": "道真仡佬族苗族自治县",
            "next": []
          },
          {
            "code": "520381",
            "name": "赤水市",
            "next": []
          },
          {
            "code": "520382",
            "name": "仁怀市",
            "next": []
          },
          {
            "code": "520330",
            "name": "习水县",
            "next": []
          }
        ]
      },
      {
        "code": "522400",
        "name": "毕节地区",
        "next": [
          {
            "code": "522401",
            "name": "毕节市",
            "next": []
          },
          {
            "code": "522428",
            "name": "赫章县",
            "next": []
          },
          {
            "code": "522427",
            "name": "威宁彝族回族苗族自治县",
            "next": []
          },
          {
            "code": "522426",
            "name": "纳雍县",
            "next": []
          },
          {
            "code": "522425",
            "name": "织金县",
            "next": []
          },
          {
            "code": "522424",
            "name": "金沙县",
            "next": []
          },
          {
            "code": "522423",
            "name": "黔西县",
            "next": []
          },
          {
            "code": "522422",
            "name": "大方县",
            "next": []
          }
        ]
      },
      {
        "code": "520200",
        "name": "六盘水市",
        "next": [
          {
            "code": "520201",
            "name": "钟山区",
            "next": []
          },
          {
            "code": "520222",
            "name": "盘县",
            "next": []
          },
          {
            "code": "520203",
            "name": "六枝特区",
            "next": []
          },
          {
            "code": "520221",
            "name": "水城县",
            "next": []
          }
        ]
      },
      {
        "code": "522300",
        "name": "黔西南州",
        "next": [
          {
            "code": "522301",
            "name": "兴义市",
            "next": []
          },
          {
            "code": "522324",
            "name": "晴隆县",
            "next": []
          },
          {
            "code": "522325",
            "name": "贞丰县",
            "next": []
          },
          {
            "code": "522326",
            "name": "望谟县",
            "next": []
          },
          {
            "code": "522327",
            "name": "册亨县",
            "next": []
          },
          {
            "code": "522322",
            "name": "兴仁县",
            "next": []
          },
          {
            "code": "522323",
            "name": "普安县",
            "next": []
          },
          {
            "code": "522328",
            "name": "安龙县",
            "next": []
          }
        ]
      },
      {
        "code": "522700",
        "name": "黔南布依族苗族自治州",
        "next": [
          {
            "code": "522728",
            "name": "罗甸县",
            "next": []
          },
          {
            "code": "522729",
            "name": "长顺县",
            "next": []
          },
          {
            "code": "522722",
            "name": "荔波县",
            "next": []
          },
          {
            "code": "522723",
            "name": "贵定县",
            "next": []
          },
          {
            "code": "522702",
            "name": "福泉市",
            "next": []
          },
          {
            "code": "522725",
            "name": "瓮安县",
            "next": []
          },
          {
            "code": "522726",
            "name": "独山县",
            "next": []
          },
          {
            "code": "522701",
            "name": "都匀市",
            "next": []
          },
          {
            "code": "522732",
            "name": "三都水族自治县",
            "next": []
          },
          {
            "code": "522731",
            "name": "惠水县",
            "next": []
          },
          {
            "code": "522730",
            "name": "龙里县",
            "next": []
          },
          {
            "code": "522727",
            "name": "平塘县",
            "next": []
          }
        ]
      },
      {
        "code": "520100",
        "name": "贵阳市",
        "next": [
          {
            "code": "520111",
            "name": "花溪区",
            "next": []
          },
          {
            "code": "520101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "520102",
            "name": "南明区",
            "next": []
          },
          {
            "code": "520103",
            "name": "云岩区",
            "next": []
          },
          {
            "code": "520113",
            "name": "白云区",
            "next": []
          },
          {
            "code": "520112",
            "name": "乌当区",
            "next": []
          },
          {
            "code": "520114",
            "name": "小河区",
            "next": []
          },
          {
            "code": "520181",
            "name": "清镇市",
            "next": []
          },
          {
            "code": "520121",
            "name": "开阳县",
            "next": []
          },
          {
            "code": "520122",
            "name": "息烽县",
            "next": []
          },
          {
            "code": "520123",
            "name": "修文县",
            "next": []
          }
        ]
      },
      {
        "code": "522200",
        "name": "铜仁地区",
        "next": [
          {
            "code": "522229",
            "name": "松桃苗族自治县",
            "next": []
          },
          {
            "code": "522228",
            "name": "沿河土家族自治县",
            "next": []
          },
          {
            "code": "522223",
            "name": "玉屏侗族自治县",
            "next": []
          },
          {
            "code": "522222",
            "name": "江口县",
            "next": []
          },
          {
            "code": "522225",
            "name": "思南县",
            "next": []
          },
          {
            "code": "522224",
            "name": "石阡县",
            "next": []
          },
          {
            "code": "522227",
            "name": "德江县",
            "next": []
          },
          {
            "code": "522226",
            "name": "印江土家族苗族自治县",
            "next": []
          },
          {
            "code": "522201",
            "name": "铜仁市",
            "next": []
          },
          {
            "code": "522230",
            "name": "万山特区",
            "next": []
          }
        ]
      },
      {
        "code": "522600",
        "name": "黔东南苗族侗族自治州",
        "next": [
          {
            "code": "522635",
            "name": "麻江县",
            "next": []
          },
          {
            "code": "522629",
            "name": "剑河县",
            "next": []
          },
          {
            "code": "522628",
            "name": "锦屏县",
            "next": []
          },
          {
            "code": "522625",
            "name": "镇远县",
            "next": []
          },
          {
            "code": "522624",
            "name": "三穗县",
            "next": []
          },
          {
            "code": "522627",
            "name": "天柱县",
            "next": []
          },
          {
            "code": "522626",
            "name": "岑巩县",
            "next": []
          },
          {
            "code": "522632",
            "name": "榕江县",
            "next": []
          },
          {
            "code": "522633",
            "name": "从江县",
            "next": []
          },
          {
            "code": "522623",
            "name": "施秉县",
            "next": []
          },
          {
            "code": "522622",
            "name": "黄平县",
            "next": []
          },
          {
            "code": "522636",
            "name": "丹寨县",
            "next": []
          },
          {
            "code": "522630",
            "name": "台江县",
            "next": []
          },
          {
            "code": "522601",
            "name": "凯里市",
            "next": []
          },
          {
            "code": "522631",
            "name": "黎平县",
            "next": []
          },
          {
            "code": "522634",
            "name": "雷山县",
            "next": []
          }
        ]
      },
      {
        "code": "520400",
        "name": "安顺市",
        "next": [
          {
            "code": "520425",
            "name": "紫云苗族布依族自治县",
            "next": []
          },
          {
            "code": "520424",
            "name": "关岭自治县",
            "next": []
          },
          {
            "code": "520421",
            "name": "平坝县",
            "next": []
          },
          {
            "code": "520423",
            "name": "镇宁布依族苗族自治县",
            "next": []
          },
          {
            "code": "520422",
            "name": "普定县",
            "next": []
          },
          {
            "code": "520402",
            "name": "西秀区",
            "next": []
          },
          {
            "code": "520401",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "610000",
    "name": "陕西省",
    "next": [
      {
        "code": "610400",
        "name": "咸阳市",
        "next": [
          {
            "code": "610401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610403",
            "name": "杨凌区",
            "next": []
          },
          {
            "code": "610402",
            "name": "秦都区",
            "next": []
          },
          {
            "code": "610404",
            "name": "渭城区",
            "next": []
          },
          {
            "code": "610423",
            "name": "泾阳县",
            "next": []
          },
          {
            "code": "610422",
            "name": "三原县",
            "next": []
          },
          {
            "code": "610427",
            "name": "彬县",
            "next": []
          },
          {
            "code": "610426",
            "name": "永寿县",
            "next": []
          },
          {
            "code": "610425",
            "name": "礼泉县",
            "next": []
          },
          {
            "code": "610424",
            "name": "乾县",
            "next": []
          },
          {
            "code": "610430",
            "name": "淳化县",
            "next": []
          },
          {
            "code": "610481",
            "name": "兴平市",
            "next": []
          },
          {
            "code": "610428",
            "name": "长武县",
            "next": []
          },
          {
            "code": "610429",
            "name": "旬邑县",
            "next": []
          },
          {
            "code": "610431",
            "name": "武功县",
            "next": []
          }
        ]
      },
      {
        "code": "610700",
        "name": "汉中市",
        "next": [
          {
            "code": "610730",
            "name": "佛坪县",
            "next": []
          },
          {
            "code": "610702",
            "name": "汉台区",
            "next": []
          },
          {
            "code": "610701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610724",
            "name": "西乡县",
            "next": []
          },
          {
            "code": "610725",
            "name": "勉县",
            "next": []
          },
          {
            "code": "610726",
            "name": "宁强县",
            "next": []
          },
          {
            "code": "610727",
            "name": "略阳县",
            "next": []
          },
          {
            "code": "610721",
            "name": "南郑县",
            "next": []
          },
          {
            "code": "610722",
            "name": "城固县",
            "next": []
          },
          {
            "code": "610723",
            "name": "洋县",
            "next": []
          },
          {
            "code": "610728",
            "name": "镇巴县",
            "next": []
          },
          {
            "code": "610729",
            "name": "留坝县",
            "next": []
          }
        ]
      },
      {
        "code": "610300",
        "name": "宝鸡市",
        "next": [
          {
            "code": "610328",
            "name": "千阳县",
            "next": []
          },
          {
            "code": "610329",
            "name": "麟游县",
            "next": []
          },
          {
            "code": "610324",
            "name": "扶风县",
            "next": []
          },
          {
            "code": "610322",
            "name": "凤翔县",
            "next": []
          },
          {
            "code": "610323",
            "name": "岐山县",
            "next": []
          },
          {
            "code": "610302",
            "name": "渭滨区",
            "next": []
          },
          {
            "code": "610303",
            "name": "金台区",
            "next": []
          },
          {
            "code": "610326",
            "name": "眉县",
            "next": []
          },
          {
            "code": "610301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610331",
            "name": "太白县",
            "next": []
          },
          {
            "code": "610330",
            "name": "凤县",
            "next": []
          },
          {
            "code": "610327",
            "name": "陇县",
            "next": []
          },
          {
            "code": "610304",
            "name": "陈仓区",
            "next": []
          }
        ]
      },
      {
        "code": "610600",
        "name": "延安市",
        "next": [
          {
            "code": "610629",
            "name": "洛川县",
            "next": []
          },
          {
            "code": "610628",
            "name": "富县",
            "next": []
          },
          {
            "code": "610631",
            "name": "黄龙县",
            "next": []
          },
          {
            "code": "610621",
            "name": "延长县",
            "next": []
          },
          {
            "code": "610623",
            "name": "子长县",
            "next": []
          },
          {
            "code": "610622",
            "name": "延川县",
            "next": []
          },
          {
            "code": "610625",
            "name": "志丹县",
            "next": []
          },
          {
            "code": "610624",
            "name": "安塞县",
            "next": []
          },
          {
            "code": "610627",
            "name": "甘泉县",
            "next": []
          },
          {
            "code": "610626",
            "name": "吴起县",
            "next": []
          },
          {
            "code": "610602",
            "name": "宝塔区",
            "next": []
          },
          {
            "code": "610601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610632",
            "name": "黄陵县",
            "next": []
          },
          {
            "code": "610630",
            "name": "宜川县",
            "next": []
          }
        ]
      },
      {
        "code": "610900",
        "name": "安康市",
        "next": [
          {
            "code": "610928",
            "name": "旬阳县",
            "next": []
          },
          {
            "code": "610929",
            "name": "白河县",
            "next": []
          },
          {
            "code": "610922",
            "name": "石泉县",
            "next": []
          },
          {
            "code": "610923",
            "name": "宁陕县",
            "next": []
          },
          {
            "code": "610921",
            "name": "汉阴县",
            "next": []
          },
          {
            "code": "610926",
            "name": "平利县",
            "next": []
          },
          {
            "code": "610927",
            "name": "镇坪县",
            "next": []
          },
          {
            "code": "610924",
            "name": "紫阳县",
            "next": []
          },
          {
            "code": "610925",
            "name": "岚皋县",
            "next": []
          },
          {
            "code": "610901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610902",
            "name": "汉滨区",
            "next": []
          }
        ]
      },
      {
        "code": "611000",
        "name": "商洛市",
        "next": [
          {
            "code": "611024",
            "name": "山阳县",
            "next": []
          },
          {
            "code": "611021",
            "name": "洛南县",
            "next": []
          },
          {
            "code": "611022",
            "name": "丹凤县",
            "next": []
          },
          {
            "code": "611023",
            "name": "商南县",
            "next": []
          },
          {
            "code": "611002",
            "name": "商州区",
            "next": []
          },
          {
            "code": "611025",
            "name": "镇安县",
            "next": []
          },
          {
            "code": "611026",
            "name": "柞水县",
            "next": []
          },
          {
            "code": "611001",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "610200",
        "name": "铜川市",
        "next": [
          {
            "code": "610204",
            "name": "耀州区",
            "next": []
          },
          {
            "code": "610203",
            "name": "印台区",
            "next": []
          },
          {
            "code": "610202",
            "name": "王益区",
            "next": []
          },
          {
            "code": "610201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610222",
            "name": "宜君县",
            "next": []
          }
        ]
      },
      {
        "code": "610500",
        "name": "渭南市",
        "next": [
          {
            "code": "610581",
            "name": "韩城市",
            "next": []
          },
          {
            "code": "610582",
            "name": "华阴市",
            "next": []
          },
          {
            "code": "610523",
            "name": "大荔县",
            "next": []
          },
          {
            "code": "610528",
            "name": "富平县",
            "next": []
          },
          {
            "code": "610527",
            "name": "白水县",
            "next": []
          },
          {
            "code": "610526",
            "name": "蒲城县",
            "next": []
          },
          {
            "code": "610501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610524",
            "name": "合阳县",
            "next": []
          },
          {
            "code": "610525",
            "name": "澄城县",
            "next": []
          },
          {
            "code": "610522",
            "name": "潼关县",
            "next": []
          },
          {
            "code": "610502",
            "name": "临渭区",
            "next": []
          },
          {
            "code": "610521",
            "name": "华县",
            "next": []
          }
        ]
      },
      {
        "code": "610100",
        "name": "西安市",
        "next": [
          {
            "code": "610116",
            "name": "长安区",
            "next": []
          },
          {
            "code": "610122",
            "name": "蓝田县",
            "next": []
          },
          {
            "code": "610113",
            "name": "雁塔区",
            "next": []
          },
          {
            "code": "610126",
            "name": "高陵县",
            "next": []
          },
          {
            "code": "610115",
            "name": "临潼区",
            "next": []
          },
          {
            "code": "610124",
            "name": "周至县",
            "next": []
          },
          {
            "code": "610125",
            "name": "户县",
            "next": []
          },
          {
            "code": "610104",
            "name": "莲湖区",
            "next": []
          },
          {
            "code": "610112",
            "name": "未央区",
            "next": []
          },
          {
            "code": "610111",
            "name": "灞桥区",
            "next": []
          },
          {
            "code": "610114",
            "name": "阎良区",
            "next": []
          },
          {
            "code": "610101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610102",
            "name": "新城区",
            "next": []
          },
          {
            "code": "610103",
            "name": "碑林区",
            "next": []
          }
        ]
      },
      {
        "code": "610800",
        "name": "榆林市",
        "next": [
          {
            "code": "610827",
            "name": "米脂县",
            "next": []
          },
          {
            "code": "610826",
            "name": "绥德县",
            "next": []
          },
          {
            "code": "610825",
            "name": "定边县",
            "next": []
          },
          {
            "code": "610824",
            "name": "靖边县",
            "next": []
          },
          {
            "code": "610823",
            "name": "横山县",
            "next": []
          },
          {
            "code": "610822",
            "name": "府谷县",
            "next": []
          },
          {
            "code": "610821",
            "name": "神木县",
            "next": []
          },
          {
            "code": "610829",
            "name": "吴堡县",
            "next": []
          },
          {
            "code": "610828",
            "name": "佳县",
            "next": []
          },
          {
            "code": "610830",
            "name": "清涧县",
            "next": []
          },
          {
            "code": "610831",
            "name": "子洲县",
            "next": []
          },
          {
            "code": "610801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "610802",
            "name": "榆阳区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "130000",
    "name": "河北省",
    "next": [
      {
        "code": "130400",
        "name": "邯郸市",
        "next": [
          {
            "code": "130402",
            "name": "邯山区",
            "next": []
          },
          {
            "code": "130403",
            "name": "丛台区",
            "next": []
          },
          {
            "code": "130401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "130406",
            "name": "峰峰矿区",
            "next": []
          },
          {
            "code": "130429",
            "name": "永年县",
            "next": []
          },
          {
            "code": "130404",
            "name": "复兴区",
            "next": []
          },
          {
            "code": "130424",
            "name": "成安县",
            "next": []
          },
          {
            "code": "130425",
            "name": "大名县",
            "next": []
          },
          {
            "code": "130426",
            "name": "涉县",
            "next": []
          },
          {
            "code": "130427",
            "name": "磁县",
            "next": []
          },
          {
            "code": "130421",
            "name": "邯郸县",
            "next": []
          },
          {
            "code": "130435",
            "name": "曲周县",
            "next": []
          },
          {
            "code": "130423",
            "name": "临漳县",
            "next": []
          },
          {
            "code": "130433",
            "name": "馆陶县",
            "next": []
          },
          {
            "code": "130430",
            "name": "邱县",
            "next": []
          },
          {
            "code": "130481",
            "name": "武安市",
            "next": []
          },
          {
            "code": "130432",
            "name": "广平县",
            "next": []
          },
          {
            "code": "130428",
            "name": "肥乡县",
            "next": []
          },
          {
            "code": "130434",
            "name": "魏县",
            "next": []
          },
          {
            "code": "130431",
            "name": "鸡泽县",
            "next": []
          }
        ]
      },
      {
        "code": "131000",
        "name": "廊坊市",
        "next": [
          {
            "code": "131026",
            "name": "文安县",
            "next": []
          },
          {
            "code": "131025",
            "name": "大城县",
            "next": []
          },
          {
            "code": "131024",
            "name": "香河县",
            "next": []
          },
          {
            "code": "131023",
            "name": "永清县",
            "next": []
          },
          {
            "code": "131022",
            "name": "固安县",
            "next": []
          },
          {
            "code": "131082",
            "name": "三河市",
            "next": []
          },
          {
            "code": "131028",
            "name": "大厂回族自治县",
            "next": []
          },
          {
            "code": "131081",
            "name": "霸州市",
            "next": []
          },
          {
            "code": "131001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "131003",
            "name": "广阳区",
            "next": []
          },
          {
            "code": "131002",
            "name": "安次区",
            "next": []
          }
        ]
      },
      {
        "code": "130500",
        "name": "邢台市",
        "next": [
          {
            "code": "130521",
            "name": "邢台县",
            "next": []
          },
          {
            "code": "130532",
            "name": "平乡县",
            "next": []
          },
          {
            "code": "130523",
            "name": "内邱县",
            "next": []
          },
          {
            "code": "130522",
            "name": "临城县",
            "next": []
          },
          {
            "code": "130525",
            "name": "隆尧县",
            "next": []
          },
          {
            "code": "130524",
            "name": "柏乡县",
            "next": []
          },
          {
            "code": "130527",
            "name": "南和县",
            "next": []
          },
          {
            "code": "130526",
            "name": "任县",
            "next": []
          },
          {
            "code": "130503",
            "name": "桥西区",
            "next": []
          },
          {
            "code": "130502",
            "name": "桥东区",
            "next": []
          },
          {
            "code": "130501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "130535",
            "name": "临西县",
            "next": []
          },
          {
            "code": "130530",
            "name": "新河县",
            "next": []
          },
          {
            "code": "130529",
            "name": "巨鹿县",
            "next": []
          },
          {
            "code": "130581",
            "name": "南宫市",
            "next": []
          },
          {
            "code": "130531",
            "name": "广宗县",
            "next": []
          },
          {
            "code": "130534",
            "name": "清河县",
            "next": []
          },
          {
            "code": "130528",
            "name": "宁晋县",
            "next": []
          },
          {
            "code": "130582",
            "name": "沙河市",
            "next": []
          },
          {
            "code": "130533",
            "name": "威县",
            "next": []
          }
        ]
      },
      {
        "code": "131100",
        "name": "衡水市",
        "next": [
          {
            "code": "131128",
            "name": "阜城县",
            "next": []
          },
          {
            "code": "131182",
            "name": "深州市",
            "next": []
          },
          {
            "code": "131122",
            "name": "武邑县",
            "next": []
          },
          {
            "code": "131123",
            "name": "武强县",
            "next": []
          },
          {
            "code": "131181",
            "name": "冀州市",
            "next": []
          },
          {
            "code": "131121",
            "name": "枣强县",
            "next": []
          },
          {
            "code": "131126",
            "name": "故城县",
            "next": []
          },
          {
            "code": "131127",
            "name": "景县",
            "next": []
          },
          {
            "code": "131124",
            "name": "饶阳县",
            "next": []
          },
          {
            "code": "131125",
            "name": "安平县",
            "next": []
          },
          {
            "code": "131101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "131102",
            "name": "桃城区",
            "next": []
          }
        ]
      },
      {
        "code": "130800",
        "name": "承德市",
        "next": [
          {
            "code": "130828",
            "name": "围场满族蒙古族自治县",
            "next": []
          },
          {
            "code": "130825",
            "name": "隆化县",
            "next": []
          },
          {
            "code": "130824",
            "name": "滦平县",
            "next": []
          },
          {
            "code": "130821",
            "name": "承德县",
            "next": []
          },
          {
            "code": "130822",
            "name": "兴隆县",
            "next": []
          },
          {
            "code": "130823",
            "name": "平泉县",
            "next": []
          },
          {
            "code": "130802",
            "name": "双桥区",
            "next": []
          },
          {
            "code": "130803",
            "name": "双滦区",
            "next": []
          },
          {
            "code": "130826",
            "name": "丰宁满族自治县",
            "next": []
          },
          {
            "code": "130801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "130827",
            "name": "宽城满族自治县",
            "next": []
          },
          {
            "code": "130804",
            "name": "鹰手营子矿区",
            "next": []
          }
        ]
      },
      {
        "code": "130100",
        "name": "石家庄市",
        "next": [
          {
            "code": "130185",
            "name": "鹿泉市",
            "next": []
          },
          {
            "code": "130184",
            "name": "新乐市",
            "next": []
          },
          {
            "code": "130183",
            "name": "晋州市",
            "next": []
          },
          {
            "code": "130182",
            "name": "藁城市",
            "next": []
          },
          {
            "code": "130181",
            "name": "辛集市",
            "next": []
          },
          {
            "code": "130103",
            "name": "桥东区",
            "next": []
          },
          {
            "code": "130128",
            "name": "深泽县",
            "next": []
          },
          {
            "code": "130125",
            "name": "行唐县",
            "next": []
          },
          {
            "code": "130124",
            "name": "栾城县",
            "next": []
          },
          {
            "code": "130127",
            "name": "高邑县",
            "next": []
          },
          {
            "code": "130126",
            "name": "灵寿县",
            "next": []
          },
          {
            "code": "130121",
            "name": "井陉县",
            "next": []
          },
          {
            "code": "130123",
            "name": "正定县",
            "next": []
          },
          {
            "code": "130108",
            "name": "裕华区",
            "next": []
          },
          {
            "code": "130107",
            "name": "井陉矿区",
            "next": []
          },
          {
            "code": "130105",
            "name": "新华区",
            "next": []
          },
          {
            "code": "130104",
            "name": "桥西区",
            "next": []
          },
          {
            "code": "130129",
            "name": "赞皇县",
            "next": []
          },
          {
            "code": "130102",
            "name": "长安区",
            "next": []
          },
          {
            "code": "130132",
            "name": "元氏县",
            "next": []
          },
          {
            "code": "130133",
            "name": "赵县",
            "next": []
          },
          {
            "code": "130130",
            "name": "无极县",
            "next": []
          },
          {
            "code": "130131",
            "name": "平山县",
            "next": []
          }
        ]
      },
      {
        "code": "130600",
        "name": "保定市",
        "next": [
          {
            "code": "130635",
            "name": "蠡县",
            "next": []
          },
          {
            "code": "130634",
            "name": "曲阳县",
            "next": []
          },
          {
            "code": "130637",
            "name": "博野县",
            "next": []
          },
          {
            "code": "130636",
            "name": "顺平县",
            "next": []
          },
          {
            "code": "130631",
            "name": "望都县",
            "next": []
          },
          {
            "code": "130630",
            "name": "涞源县",
            "next": []
          },
          {
            "code": "130633",
            "name": "易县",
            "next": []
          },
          {
            "code": "130632",
            "name": "安新县",
            "next": []
          },
          {
            "code": "130638",
            "name": "雄县",
            "next": []
          },
          {
            "code": "130681",
            "name": "涿州市",
            "next": []
          },
          {
            "code": "130682",
            "name": "定州市",
            "next": []
          },
          {
            "code": "130683",
            "name": "安国市",
            "next": []
          },
          {
            "code": "130684",
            "name": "高碑店市",
            "next": []
          },
          {
            "code": "130626",
            "name": "定兴县",
            "next": []
          },
          {
            "code": "130627",
            "name": "唐县",
            "next": []
          },
          {
            "code": "130624",
            "name": "阜平县",
            "next": []
          },
          {
            "code": "130603",
            "name": "北市区",
            "next": []
          },
          {
            "code": "130604",
            "name": "南市区",
            "next": []
          },
          {
            "code": "130623",
            "name": "涞水县",
            "next": []
          },
          {
            "code": "130621",
            "name": "满城县",
            "next": []
          },
          {
            "code": "130628",
            "name": "高阳县",
            "next": []
          },
          {
            "code": "130629",
            "name": "容城县",
            "next": []
          },
          {
            "code": "130601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "130602",
            "name": "新市区",
            "next": []
          },
          {
            "code": "130625",
            "name": "徐水县",
            "next": []
          },
          {
            "code": "130622",
            "name": "清苑县",
            "next": []
          }
        ]
      },
      {
        "code": "130200",
        "name": "唐山市",
        "next": [
          {
            "code": "130230",
            "name": "唐海县",
            "next": []
          },
          {
            "code": "130229",
            "name": "玉田县",
            "next": []
          },
          {
            "code": "130281",
            "name": "遵化市",
            "next": []
          },
          {
            "code": "130223",
            "name": "滦县",
            "next": []
          },
          {
            "code": "130227",
            "name": "迁西县",
            "next": []
          },
          {
            "code": "130224",
            "name": "滦南县",
            "next": []
          },
          {
            "code": "130225",
            "name": "乐亭县",
            "next": []
          },
          {
            "code": "130204",
            "name": "古冶区",
            "next": []
          },
          {
            "code": "130205",
            "name": "开平区",
            "next": []
          },
          {
            "code": "130207",
            "name": "丰南区",
            "next": []
          },
          {
            "code": "130201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "130202",
            "name": "路南区",
            "next": []
          },
          {
            "code": "130203",
            "name": "路北区",
            "next": []
          },
          {
            "code": "130283",
            "name": "迁安市",
            "next": []
          },
          {
            "code": "130208",
            "name": "丰润区",
            "next": []
          }
        ]
      },
      {
        "code": "130900",
        "name": "沧州市",
        "next": [
          {
            "code": "130929",
            "name": "献县",
            "next": []
          },
          {
            "code": "130928",
            "name": "吴桥县",
            "next": []
          },
          {
            "code": "130925",
            "name": "盐山县",
            "next": []
          },
          {
            "code": "130924",
            "name": "海兴县",
            "next": []
          },
          {
            "code": "130927",
            "name": "南皮县",
            "next": []
          },
          {
            "code": "130926",
            "name": "肃宁县",
            "next": []
          },
          {
            "code": "130921",
            "name": "沧县",
            "next": []
          },
          {
            "code": "130923",
            "name": "东光县",
            "next": []
          },
          {
            "code": "130922",
            "name": "青县",
            "next": []
          },
          {
            "code": "130930",
            "name": "孟村回族自治县",
            "next": []
          },
          {
            "code": "130903",
            "name": "运河区",
            "next": []
          },
          {
            "code": "130902",
            "name": "新华区",
            "next": []
          },
          {
            "code": "130901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "130984",
            "name": "河间市",
            "next": []
          },
          {
            "code": "130983",
            "name": "黄骅市",
            "next": []
          },
          {
            "code": "130982",
            "name": "任邱市",
            "next": []
          },
          {
            "code": "130981",
            "name": "泊头市",
            "next": []
          }
        ]
      },
      {
        "code": "130700",
        "name": "张家口市",
        "next": [
          {
            "code": "130723",
            "name": "康保县",
            "next": []
          },
          {
            "code": "130722",
            "name": "张北县",
            "next": []
          },
          {
            "code": "130721",
            "name": "宣化县",
            "next": []
          },
          {
            "code": "130727",
            "name": "阳原县",
            "next": []
          },
          {
            "code": "130726",
            "name": "蔚县",
            "next": []
          },
          {
            "code": "130725",
            "name": "尚义县",
            "next": []
          },
          {
            "code": "130724",
            "name": "沽源县",
            "next": []
          },
          {
            "code": "130729",
            "name": "万全县",
            "next": []
          },
          {
            "code": "130728",
            "name": "怀安县",
            "next": []
          },
          {
            "code": "130733",
            "name": "崇礼县",
            "next": []
          },
          {
            "code": "130732",
            "name": "赤城县",
            "next": []
          },
          {
            "code": "130731",
            "name": "涿鹿县",
            "next": []
          },
          {
            "code": "130701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "130730",
            "name": "怀来县",
            "next": []
          },
          {
            "code": "130703",
            "name": "桥西区",
            "next": []
          },
          {
            "code": "130702",
            "name": "桥东区",
            "next": []
          },
          {
            "code": "130705",
            "name": "宣化区",
            "next": []
          },
          {
            "code": "130706",
            "name": "下花园区",
            "next": []
          }
        ]
      },
      {
        "code": "130300",
        "name": "秦皇岛市",
        "next": [
          {
            "code": "130324",
            "name": "卢龙县",
            "next": []
          },
          {
            "code": "130323",
            "name": "抚宁县",
            "next": []
          },
          {
            "code": "130322",
            "name": "昌黎县",
            "next": []
          },
          {
            "code": "130321",
            "name": "青龙满族自治县",
            "next": []
          },
          {
            "code": "130304",
            "name": "北戴河区",
            "next": []
          },
          {
            "code": "130301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "130303",
            "name": "山海关区",
            "next": []
          },
          {
            "code": "130302",
            "name": "海港区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "440000",
    "name": "广东省",
    "next": [
      {
        "code": "441600",
        "name": "河源市",
        "next": [
          {
            "code": "441621",
            "name": "紫金县",
            "next": []
          },
          {
            "code": "441623",
            "name": "连平县",
            "next": []
          },
          {
            "code": "441622",
            "name": "龙川县",
            "next": []
          },
          {
            "code": "441625",
            "name": "东源县",
            "next": []
          },
          {
            "code": "441624",
            "name": "和平县",
            "next": []
          },
          {
            "code": "441602",
            "name": "源城区",
            "next": []
          }
        ]
      },
      {
        "code": "440700",
        "name": "江门市",
        "next": [
          {
            "code": "440703",
            "name": "蓬江区",
            "next": []
          },
          {
            "code": "440705",
            "name": "新会区",
            "next": []
          },
          {
            "code": "440704",
            "name": "江海区",
            "next": []
          },
          {
            "code": "440781",
            "name": "台山市",
            "next": []
          },
          {
            "code": "440783",
            "name": "开平市",
            "next": []
          },
          {
            "code": "440785",
            "name": "恩平市",
            "next": []
          },
          {
            "code": "440784",
            "name": "鹤山市",
            "next": []
          }
        ]
      },
      {
        "code": "442000",
        "name": "中山市",
        "next": [
          {
            "code": "442001",
            "name": "中山市",
            "next": []
          }
        ]
      },
      {
        "code": "440300",
        "name": "深圳市",
        "next": [
          {
            "code": "440305",
            "name": "南山区",
            "next": []
          },
          {
            "code": "440304",
            "name": "福田区",
            "next": []
          },
          {
            "code": "440307",
            "name": "龙岗区",
            "next": []
          },
          {
            "code": "440306",
            "name": "宝安区",
            "next": []
          },
          {
            "code": "440303",
            "name": "罗湖区",
            "next": []
          },
          {
            "code": "440308",
            "name": "盐田区",
            "next": []
          }
        ]
      },
      {
        "code": "440800",
        "name": "湛江市",
        "next": [
          {
            "code": "440804",
            "name": "湛江市坡头区",
            "next": []
          },
          {
            "code": "440823",
            "name": "遂溪县",
            "next": []
          },
          {
            "code": "440811",
            "name": "湛江市麻章区",
            "next": []
          },
          {
            "code": "440803",
            "name": "湛江市霞山区",
            "next": []
          },
          {
            "code": "440802",
            "name": "湛江市赤坎区",
            "next": []
          },
          {
            "code": "440881",
            "name": "廉江市",
            "next": []
          },
          {
            "code": "440882",
            "name": "雷州市",
            "next": []
          },
          {
            "code": "440883",
            "name": "吴川市",
            "next": []
          },
          {
            "code": "440825",
            "name": "徐闻县",
            "next": []
          }
        ]
      },
      {
        "code": "441400",
        "name": "梅州市",
        "next": [
          {
            "code": "441402",
            "name": "梅江区",
            "next": []
          },
          {
            "code": "441423",
            "name": "丰顺县",
            "next": []
          },
          {
            "code": "441422",
            "name": "大埔县",
            "next": []
          },
          {
            "code": "441421",
            "name": "梅县",
            "next": []
          },
          {
            "code": "441427",
            "name": "蕉岭县",
            "next": []
          },
          {
            "code": "441426",
            "name": "平远县",
            "next": []
          },
          {
            "code": "441424",
            "name": "五华县",
            "next": []
          },
          {
            "code": "441481",
            "name": "兴宁市",
            "next": []
          }
        ]
      },
      {
        "code": "440400",
        "name": "珠海市",
        "next": [
          {
            "code": "440402",
            "name": "香洲区",
            "next": []
          },
          {
            "code": "440403",
            "name": "斗门区",
            "next": []
          },
          {
            "code": "440404",
            "name": "金湾区",
            "next": []
          }
        ]
      },
      {
        "code": "441200",
        "name": "肇庆市",
        "next": [
          {
            "code": "441225",
            "name": "封开县",
            "next": []
          },
          {
            "code": "441224",
            "name": "怀集县",
            "next": []
          },
          {
            "code": "441226",
            "name": "德庆县",
            "next": []
          },
          {
            "code": "441223",
            "name": "广宁县",
            "next": []
          },
          {
            "code": "441203",
            "name": "鼎湖区",
            "next": []
          },
          {
            "code": "441202",
            "name": "端州区",
            "next": []
          },
          {
            "code": "441284",
            "name": "四会市",
            "next": []
          },
          {
            "code": "441283",
            "name": "高要市",
            "next": []
          }
        ]
      },
      {
        "code": "441800",
        "name": "清远市",
        "next": [
          {
            "code": "441827",
            "name": "清新县",
            "next": []
          },
          {
            "code": "441826",
            "name": "连南瑶族自治县",
            "next": []
          },
          {
            "code": "441825",
            "name": "连山县",
            "next": []
          },
          {
            "code": "441823",
            "name": "阳山县",
            "next": []
          },
          {
            "code": "441821",
            "name": "佛冈县",
            "next": []
          },
          {
            "code": "441882",
            "name": "连州市",
            "next": []
          },
          {
            "code": "441881",
            "name": "英德市",
            "next": []
          },
          {
            "code": "441802",
            "name": "清城区",
            "next": []
          }
        ]
      },
      {
        "code": "441300",
        "name": "惠州市",
        "next": [
          {
            "code": "441324",
            "name": "龙门县",
            "next": []
          },
          {
            "code": "441322",
            "name": "博罗县",
            "next": []
          },
          {
            "code": "441323",
            "name": "惠东县",
            "next": []
          },
          {
            "code": "441302",
            "name": "惠城区",
            "next": []
          },
          {
            "code": "441303",
            "name": "惠阳区",
            "next": []
          }
        ]
      },
      {
        "code": "440900",
        "name": "茂名市",
        "next": [
          {
            "code": "440983",
            "name": "信宜市",
            "next": []
          },
          {
            "code": "440923",
            "name": "电白县",
            "next": []
          },
          {
            "code": "440981",
            "name": "高州市",
            "next": []
          },
          {
            "code": "440903",
            "name": "茂港区",
            "next": []
          },
          {
            "code": "440902",
            "name": "茂南区",
            "next": []
          },
          {
            "code": "440982",
            "name": "化州市",
            "next": []
          }
        ]
      },
      {
        "code": "441500",
        "name": "汕尾市",
        "next": [
          {
            "code": "441581",
            "name": "陆丰市",
            "next": []
          },
          {
            "code": "441501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "441502",
            "name": "城区",
            "next": []
          },
          {
            "code": "441523",
            "name": "陆河县",
            "next": []
          },
          {
            "code": "441521",
            "name": "海丰县",
            "next": []
          }
        ]
      },
      {
        "code": "445300",
        "name": "云浮市",
        "next": [
          {
            "code": "445302",
            "name": "云城区",
            "next": []
          },
          {
            "code": "445381",
            "name": "罗定市",
            "next": []
          },
          {
            "code": "445321",
            "name": "新兴县",
            "next": []
          },
          {
            "code": "445322",
            "name": "郁南县",
            "next": []
          },
          {
            "code": "445323",
            "name": "云安县",
            "next": []
          }
        ]
      },
      {
        "code": "440500",
        "name": "汕头市",
        "next": [
          {
            "code": "440523",
            "name": "南澳县",
            "next": []
          },
          {
            "code": "440514",
            "name": "潮南区",
            "next": []
          },
          {
            "code": "440515",
            "name": "澄海区",
            "next": []
          },
          {
            "code": "440507",
            "name": "龙湖区",
            "next": []
          },
          {
            "code": "440511",
            "name": "金平区",
            "next": []
          },
          {
            "code": "440512",
            "name": "濠江区",
            "next": []
          },
          {
            "code": "440513",
            "name": "潮阳区",
            "next": []
          }
        ]
      },
      {
        "code": "441900",
        "name": "东莞市",
        "next": [
          {
            "code": "441901",
            "name": "东莞市",
            "next": []
          }
        ]
      },
      {
        "code": "445100",
        "name": "潮州市",
        "next": [
          {
            "code": "445102",
            "name": "潮州市湘桥区",
            "next": []
          },
          {
            "code": "445122",
            "name": "潮州市饶平县",
            "next": []
          },
          {
            "code": "445121",
            "name": "潮州市潮安县",
            "next": []
          }
        ]
      },
      {
        "code": "440100",
        "name": "广州市",
        "next": [
          {
            "code": "440111",
            "name": "白云区",
            "next": []
          },
          {
            "code": "440112",
            "name": "黄埔区",
            "next": []
          },
          {
            "code": "440113",
            "name": "番禺区",
            "next": []
          },
          {
            "code": "440114",
            "name": "花都区",
            "next": []
          },
          {
            "code": "440115",
            "name": "南沙区",
            "next": []
          },
          {
            "code": "440116",
            "name": "萝岗区",
            "next": []
          },
          {
            "code": "440106",
            "name": "天河区",
            "next": []
          },
          {
            "code": "440105",
            "name": "海珠区",
            "next": []
          },
          {
            "code": "440104",
            "name": "越秀区",
            "next": []
          },
          {
            "code": "440103",
            "name": "荔湾区",
            "next": []
          },
          {
            "code": "440184",
            "name": "从化市",
            "next": []
          },
          {
            "code": "440183",
            "name": "增城市",
            "next": []
          }
        ]
      },
      {
        "code": "440600",
        "name": "佛山市",
        "next": [
          {
            "code": "440608",
            "name": "高明区",
            "next": []
          },
          {
            "code": "440604",
            "name": "禅城区",
            "next": []
          },
          {
            "code": "440605",
            "name": "南海区",
            "next": []
          },
          {
            "code": "440606",
            "name": "顺德区",
            "next": []
          },
          {
            "code": "440607",
            "name": "三水区",
            "next": []
          }
        ]
      },
      {
        "code": "445200",
        "name": "揭阳市",
        "next": [
          {
            "code": "445221",
            "name": "揭东县",
            "next": []
          },
          {
            "code": "445202",
            "name": "榕城区",
            "next": []
          },
          {
            "code": "445281",
            "name": "普宁市",
            "next": []
          },
          {
            "code": "445222",
            "name": "揭西县",
            "next": []
          },
          {
            "code": "445224",
            "name": "惠来县",
            "next": []
          }
        ]
      },
      {
        "code": "440200",
        "name": "韶关市",
        "next": [
          {
            "code": "440281",
            "name": "乐昌市",
            "next": []
          },
          {
            "code": "440282",
            "name": "南雄市",
            "next": []
          },
          {
            "code": "440222",
            "name": "始兴县",
            "next": []
          },
          {
            "code": "440233",
            "name": "新丰县",
            "next": []
          },
          {
            "code": "440232",
            "name": "乳源瑶族自治县",
            "next": []
          },
          {
            "code": "440224",
            "name": "仁化县",
            "next": []
          },
          {
            "code": "440204",
            "name": "浈江区",
            "next": []
          },
          {
            "code": "440205",
            "name": "曲江区",
            "next": []
          },
          {
            "code": "440229",
            "name": "翁源县",
            "next": []
          },
          {
            "code": "440203",
            "name": "武江区",
            "next": []
          }
        ]
      },
      {
        "code": "441700",
        "name": "阳江市",
        "next": [
          {
            "code": "441702",
            "name": "江城区",
            "next": []
          },
          {
            "code": "441781",
            "name": "阳春市",
            "next": []
          },
          {
            "code": "441721",
            "name": "阳西县",
            "next": []
          },
          {
            "code": "441723",
            "name": "阳东县",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "640000",
    "name": "宁夏回族自治区",
    "next": [
      {
        "code": "640100",
        "name": "银川市",
        "next": [
          {
            "code": "640122",
            "name": "贺兰县",
            "next": []
          },
          {
            "code": "640121",
            "name": "永宁县",
            "next": []
          },
          {
            "code": "640181",
            "name": "灵武市",
            "next": []
          },
          {
            "code": "640101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "640105",
            "name": "西夏区",
            "next": []
          },
          {
            "code": "640104",
            "name": "兴庆区",
            "next": []
          },
          {
            "code": "640106",
            "name": "金凤区",
            "next": []
          }
        ]
      },
      {
        "code": "640200",
        "name": "石嘴山市",
        "next": [
          {
            "code": "640202",
            "name": "大武口区",
            "next": []
          },
          {
            "code": "640201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "640221",
            "name": "平罗县",
            "next": []
          },
          {
            "code": "640205",
            "name": "惠农区",
            "next": []
          }
        ]
      },
      {
        "code": "640300",
        "name": "吴忠市",
        "next": [
          {
            "code": "640302",
            "name": "利通区",
            "next": []
          },
          {
            "code": "640301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "640323",
            "name": "盐池县",
            "next": []
          },
          {
            "code": "640381",
            "name": "青铜峡市",
            "next": []
          },
          {
            "code": "640324",
            "name": "同心县",
            "next": []
          }
        ]
      },
      {
        "code": "640400",
        "name": "固原市",
        "next": [
          {
            "code": "640422",
            "name": "西吉县",
            "next": []
          },
          {
            "code": "640423",
            "name": "隆德县",
            "next": []
          },
          {
            "code": "640424",
            "name": "泾源县",
            "next": []
          },
          {
            "code": "640425",
            "name": "彭阳县",
            "next": []
          },
          {
            "code": "640401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "640402",
            "name": "原州区",
            "next": []
          }
        ]
      },
      {
        "code": "640500",
        "name": "中卫市",
        "next": [
          {
            "code": "640501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "640522",
            "name": "海原县",
            "next": []
          },
          {
            "code": "640521",
            "name": "中宁县",
            "next": []
          },
          {
            "code": "640502",
            "name": "沙坡头区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "510000",
    "name": "四川省",
    "next": [
      {
        "code": "510800",
        "name": "广元市",
        "next": [
          {
            "code": "510801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "510802",
            "name": "市中区",
            "next": []
          },
          {
            "code": "510822",
            "name": "青川县",
            "next": []
          },
          {
            "code": "510823",
            "name": "剑阁县",
            "next": []
          },
          {
            "code": "510821",
            "name": "旺苍县",
            "next": []
          },
          {
            "code": "510812",
            "name": "朝天区",
            "next": []
          },
          {
            "code": "510811",
            "name": "元坝区",
            "next": []
          },
          {
            "code": "510824",
            "name": "苍溪县",
            "next": []
          }
        ]
      },
      {
        "code": "511500",
        "name": "宜宾市",
        "next": [
          {
            "code": "511502",
            "name": "翠屏区",
            "next": []
          },
          {
            "code": "511501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "511528",
            "name": "兴文县",
            "next": []
          },
          {
            "code": "511529",
            "name": "屏山县",
            "next": []
          },
          {
            "code": "511524",
            "name": "长宁县",
            "next": []
          },
          {
            "code": "511525",
            "name": "高县",
            "next": []
          },
          {
            "code": "511526",
            "name": "珙县",
            "next": []
          },
          {
            "code": "511527",
            "name": "筠连县",
            "next": []
          },
          {
            "code": "511521",
            "name": "宜宾县",
            "next": []
          },
          {
            "code": "511522",
            "name": "南溪县",
            "next": []
          },
          {
            "code": "511523",
            "name": "江安县",
            "next": []
          }
        ]
      },
      {
        "code": "510300",
        "name": "自贡市",
        "next": [
          {
            "code": "510303",
            "name": "贡井区",
            "next": []
          },
          {
            "code": "510302",
            "name": "自流井区",
            "next": []
          },
          {
            "code": "510301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "510311",
            "name": "沿滩区",
            "next": []
          },
          {
            "code": "510304",
            "name": "大安区",
            "next": []
          },
          {
            "code": "510321",
            "name": "荣县",
            "next": []
          },
          {
            "code": "510322",
            "name": "富顺县",
            "next": []
          }
        ]
      },
      {
        "code": "513400",
        "name": "凉山州",
        "next": [
          {
            "code": "513437",
            "name": "雷波县",
            "next": []
          },
          {
            "code": "513430",
            "name": "金阳县",
            "next": []
          },
          {
            "code": "513431",
            "name": "昭觉县",
            "next": []
          },
          {
            "code": "513401",
            "name": "西昌市",
            "next": []
          },
          {
            "code": "513434",
            "name": "越西县",
            "next": []
          },
          {
            "code": "513429",
            "name": "布拖县",
            "next": []
          },
          {
            "code": "513428",
            "name": "普格县",
            "next": []
          },
          {
            "code": "513432",
            "name": "喜德县",
            "next": []
          },
          {
            "code": "513435",
            "name": "甘洛县",
            "next": []
          },
          {
            "code": "513423",
            "name": "盐源县",
            "next": []
          },
          {
            "code": "513422",
            "name": "木里藏族自治县",
            "next": []
          },
          {
            "code": "513436",
            "name": "美姑县",
            "next": []
          },
          {
            "code": "513433",
            "name": "冕宁县",
            "next": []
          },
          {
            "code": "513427",
            "name": "宁南县",
            "next": []
          },
          {
            "code": "513426",
            "name": "会东县",
            "next": []
          },
          {
            "code": "513425",
            "name": "会理县",
            "next": []
          },
          {
            "code": "513424",
            "name": "德昌",
            "next": []
          }
        ]
      },
      {
        "code": "511100",
        "name": "乐山市",
        "next": [
          {
            "code": "511123",
            "name": "犍为县",
            "next": []
          },
          {
            "code": "511111",
            "name": "沙湾区",
            "next": []
          },
          {
            "code": "511126",
            "name": "夹江县",
            "next": []
          },
          {
            "code": "511113",
            "name": "金口河区",
            "next": []
          },
          {
            "code": "511112",
            "name": "五通桥区",
            "next": []
          },
          {
            "code": "511129",
            "name": "沐川县",
            "next": []
          },
          {
            "code": "511101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "511133",
            "name": "马边彝族自治县",
            "next": []
          },
          {
            "code": "511132",
            "name": "峨边彝族自治县",
            "next": []
          },
          {
            "code": "511124",
            "name": "井研县",
            "next": []
          },
          {
            "code": "511102",
            "name": "市中区",
            "next": []
          },
          {
            "code": "511181",
            "name": "峨眉山市",
            "next": []
          }
        ]
      },
      {
        "code": "510700",
        "name": "绵阳市",
        "next": [
          {
            "code": "510704",
            "name": "游仙区",
            "next": []
          },
          {
            "code": "510703",
            "name": "涪城区",
            "next": []
          },
          {
            "code": "510701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "510781",
            "name": "江油市",
            "next": []
          },
          {
            "code": "510725",
            "name": "梓潼县",
            "next": []
          },
          {
            "code": "510724",
            "name": "安县",
            "next": []
          },
          {
            "code": "510727",
            "name": "平武县",
            "next": []
          },
          {
            "code": "510726",
            "name": "北川羌族自治县",
            "next": []
          },
          {
            "code": "510723",
            "name": "盐亭县",
            "next": []
          },
          {
            "code": "510722",
            "name": "三台县",
            "next": []
          }
        ]
      },
      {
        "code": "510900",
        "name": "遂宁市",
        "next": [
          {
            "code": "510901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "510903",
            "name": "船山区",
            "next": []
          },
          {
            "code": "510904",
            "name": "安居区",
            "next": []
          },
          {
            "code": "510923",
            "name": "大英县",
            "next": []
          },
          {
            "code": "510922",
            "name": "射洪县",
            "next": []
          },
          {
            "code": "510921",
            "name": "蓬溪县",
            "next": []
          }
        ]
      },
      {
        "code": "511400",
        "name": "眉山市",
        "next": [
          {
            "code": "511421",
            "name": "仁寿县",
            "next": []
          },
          {
            "code": "511423",
            "name": "洪雅县",
            "next": []
          },
          {
            "code": "511422",
            "name": "彭山县",
            "next": []
          },
          {
            "code": "511425",
            "name": "青神县",
            "next": []
          },
          {
            "code": "511424",
            "name": "丹棱县",
            "next": []
          },
          {
            "code": "511402",
            "name": "东坡区",
            "next": []
          },
          {
            "code": "511401",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "510400",
        "name": "攀枝花市",
        "next": [
          {
            "code": "510422",
            "name": "盐边县",
            "next": []
          },
          {
            "code": "510421",
            "name": "米易县",
            "next": []
          },
          {
            "code": "510411",
            "name": "仁和区",
            "next": []
          },
          {
            "code": "510401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "510402",
            "name": "攀枝花东区",
            "next": []
          },
          {
            "code": "510403",
            "name": "西区",
            "next": []
          }
        ]
      },
      {
        "code": "511900",
        "name": "巴中市",
        "next": [
          {
            "code": "511921",
            "name": "通江县",
            "next": []
          },
          {
            "code": "511922",
            "name": "南江县",
            "next": []
          },
          {
            "code": "511923",
            "name": "平昌县",
            "next": []
          },
          {
            "code": "511902",
            "name": "巴州区",
            "next": []
          },
          {
            "code": "511901",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "511000",
        "name": "内江市",
        "next": [
          {
            "code": "511025",
            "name": "资中县",
            "next": []
          },
          {
            "code": "511011",
            "name": "东兴区",
            "next": []
          },
          {
            "code": "511024",
            "name": "威远县",
            "next": []
          },
          {
            "code": "511028",
            "name": "隆昌县",
            "next": []
          },
          {
            "code": "511001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "511002",
            "name": "市中区",
            "next": []
          }
        ]
      },
      {
        "code": "511700",
        "name": "达州市",
        "next": [
          {
            "code": "511781",
            "name": "万源市",
            "next": []
          },
          {
            "code": "511724",
            "name": "大竹县",
            "next": []
          },
          {
            "code": "511701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "511702",
            "name": "通川区",
            "next": []
          },
          {
            "code": "511725",
            "name": "渠县",
            "next": []
          },
          {
            "code": "511722",
            "name": "宣汉县",
            "next": []
          },
          {
            "code": "511723",
            "name": "开江县",
            "next": []
          },
          {
            "code": "511721",
            "name": "达县",
            "next": []
          }
        ]
      },
      {
        "code": "510100",
        "name": "成都市",
        "next": [
          {
            "code": "510122",
            "name": "双流县",
            "next": []
          },
          {
            "code": "510112",
            "name": "龙泉驿区",
            "next": []
          },
          {
            "code": "510114",
            "name": "新都区",
            "next": []
          },
          {
            "code": "510183",
            "name": "邛崃市",
            "next": []
          },
          {
            "code": "510115",
            "name": "温江区",
            "next": []
          },
          {
            "code": "510184",
            "name": "崇州市",
            "next": []
          },
          {
            "code": "510101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "510113",
            "name": "青白江区",
            "next": []
          },
          {
            "code": "510129",
            "name": "大邑县",
            "next": []
          },
          {
            "code": "510105",
            "name": "青羊区",
            "next": []
          },
          {
            "code": "510104",
            "name": "锦江区",
            "next": []
          },
          {
            "code": "510107",
            "name": "武侯区",
            "next": []
          },
          {
            "code": "510106",
            "name": "金牛区",
            "next": []
          },
          {
            "code": "510181",
            "name": "都江堰市",
            "next": []
          },
          {
            "code": "510108",
            "name": "成华区",
            "next": []
          },
          {
            "code": "510121",
            "name": "金堂县",
            "next": []
          },
          {
            "code": "510182",
            "name": "彭州市",
            "next": []
          },
          {
            "code": "510131",
            "name": "蒲江县",
            "next": []
          },
          {
            "code": "510132",
            "name": "新津县",
            "next": []
          },
          {
            "code": "510124",
            "name": "郫县",
            "next": []
          }
        ]
      },
      {
        "code": "511300",
        "name": "南充市",
        "next": [
          {
            "code": "511322",
            "name": "营山县",
            "next": []
          },
          {
            "code": "511323",
            "name": "蓬安县",
            "next": []
          },
          {
            "code": "511321",
            "name": "南部县",
            "next": []
          },
          {
            "code": "511381",
            "name": "阆中市",
            "next": []
          },
          {
            "code": "511324",
            "name": "仪陇县",
            "next": []
          },
          {
            "code": "511325",
            "name": "西充县",
            "next": []
          },
          {
            "code": "511304",
            "name": "嘉陵区",
            "next": []
          },
          {
            "code": "511301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "511302",
            "name": "顺庆区",
            "next": []
          },
          {
            "code": "511303",
            "name": "高坪区",
            "next": []
          }
        ]
      },
      {
        "code": "510500",
        "name": "泸州市",
        "next": [
          {
            "code": "510504",
            "name": "龙马潭区",
            "next": []
          },
          {
            "code": "510501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "510503",
            "name": "纳溪区",
            "next": []
          },
          {
            "code": "510502",
            "name": "江阳区",
            "next": []
          },
          {
            "code": "510525",
            "name": "古蔺县",
            "next": []
          },
          {
            "code": "510524",
            "name": "叙永县",
            "next": []
          },
          {
            "code": "510522",
            "name": "合江县",
            "next": []
          },
          {
            "code": "510521",
            "name": "泸县",
            "next": []
          }
        ]
      },
      {
        "code": "513200",
        "name": "阿坝州",
        "next": [
          {
            "code": "513232",
            "name": "若尔盖县",
            "next": []
          },
          {
            "code": "513231",
            "name": "阿坝县",
            "next": []
          },
          {
            "code": "513230",
            "name": "壤塘县",
            "next": []
          },
          {
            "code": "513229",
            "name": "马尔康县",
            "next": []
          },
          {
            "code": "513228",
            "name": "黑水县",
            "next": []
          },
          {
            "code": "513225",
            "name": "九寨沟县",
            "next": []
          },
          {
            "code": "513224",
            "name": "松潘县",
            "next": []
          },
          {
            "code": "513227",
            "name": "小金县",
            "next": []
          },
          {
            "code": "513226",
            "name": "金川县",
            "next": []
          },
          {
            "code": "513221",
            "name": "汶川县",
            "next": []
          },
          {
            "code": "513233",
            "name": "红原县",
            "next": []
          },
          {
            "code": "513223",
            "name": "茂县",
            "next": []
          },
          {
            "code": "513222",
            "name": "理县",
            "next": []
          }
        ]
      },
      {
        "code": "511800",
        "name": "雅安市",
        "next": [
          {
            "code": "511825",
            "name": "天全县",
            "next": []
          },
          {
            "code": "511824",
            "name": "石棉县",
            "next": []
          },
          {
            "code": "511827",
            "name": "宝兴县",
            "next": []
          },
          {
            "code": "511826",
            "name": "芦山县",
            "next": []
          },
          {
            "code": "511821",
            "name": "名山县",
            "next": []
          },
          {
            "code": "511823",
            "name": "汉源县",
            "next": []
          },
          {
            "code": "511822",
            "name": "荥经县",
            "next": []
          },
          {
            "code": "511802",
            "name": "雨城区",
            "next": []
          },
          {
            "code": "511801",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "511600",
        "name": "广安市",
        "next": [
          {
            "code": "511623",
            "name": "邻水县",
            "next": []
          },
          {
            "code": "511622",
            "name": "武胜县",
            "next": []
          },
          {
            "code": "511621",
            "name": "岳池县",
            "next": []
          },
          {
            "code": "511681",
            "name": "华蓥市",
            "next": []
          },
          {
            "code": "511601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "511602",
            "name": "广安区",
            "next": []
          }
        ]
      },
      {
        "code": "512000",
        "name": "资阳市",
        "next": [
          {
            "code": "512021",
            "name": "安岳县",
            "next": []
          },
          {
            "code": "512022",
            "name": "乐至县",
            "next": []
          },
          {
            "code": "512081",
            "name": "简阳市",
            "next": []
          },
          {
            "code": "512002",
            "name": "雁江区",
            "next": []
          },
          {
            "code": "512001",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "513300",
        "name": "甘孜藏族自治州",
        "next": [
          {
            "code": "513337",
            "name": "稻城县",
            "next": []
          },
          {
            "code": "513336",
            "name": "乡城县",
            "next": []
          },
          {
            "code": "513335",
            "name": "巴塘县",
            "next": []
          },
          {
            "code": "513334",
            "name": "理塘县",
            "next": []
          },
          {
            "code": "513333",
            "name": "色达县",
            "next": []
          },
          {
            "code": "513332",
            "name": "石渠县",
            "next": []
          },
          {
            "code": "513331",
            "name": "白玉县",
            "next": []
          },
          {
            "code": "513330",
            "name": "德格县",
            "next": []
          },
          {
            "code": "513338",
            "name": "得荣县",
            "next": []
          },
          {
            "code": "513328",
            "name": "甘孜县",
            "next": []
          },
          {
            "code": "513329",
            "name": "新龙县",
            "next": []
          },
          {
            "code": "513321",
            "name": "康定县",
            "next": []
          },
          {
            "code": "513322",
            "name": "泸定县",
            "next": []
          },
          {
            "code": "513323",
            "name": "丹巴县",
            "next": []
          },
          {
            "code": "513324",
            "name": "九龙县",
            "next": []
          },
          {
            "code": "513325",
            "name": "雅江县",
            "next": []
          },
          {
            "code": "513326",
            "name": "道孚县",
            "next": []
          },
          {
            "code": "513327",
            "name": "炉霍县",
            "next": []
          }
        ]
      },
      {
        "code": "510600",
        "name": "德阳市",
        "next": [
          {
            "code": "510682",
            "name": "什邡市",
            "next": []
          },
          {
            "code": "510683",
            "name": "绵竹市",
            "next": []
          },
          {
            "code": "510681",
            "name": "广汉市",
            "next": []
          },
          {
            "code": "510623",
            "name": "中江县",
            "next": []
          },
          {
            "code": "510603",
            "name": "旌阳区",
            "next": []
          },
          {
            "code": "510626",
            "name": "罗江县",
            "next": []
          },
          {
            "code": "510601",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "120000",
    "name": "天津市",
    "next": [
      {
        "code": "120100",
        "name": "天津市",
        "next": [
          {
            "code": "120125",
            "name": "蓟县",
            "next": []
          },
          {
            "code": "120123",
            "name": "静海县",
            "next": []
          },
          {
            "code": "120121",
            "name": "宁河县",
            "next": []
          },
          {
            "code": "120108",
            "name": "汉沽区",
            "next": []
          },
          {
            "code": "120109",
            "name": "大港区",
            "next": []
          },
          {
            "code": "120106",
            "name": "红桥区",
            "next": []
          },
          {
            "code": "120107",
            "name": "塘沽区",
            "next": []
          },
          {
            "code": "120104",
            "name": "南开区",
            "next": []
          },
          {
            "code": "120105",
            "name": "河北区",
            "next": []
          },
          {
            "code": "120102",
            "name": "河东区",
            "next": []
          },
          {
            "code": "120103",
            "name": "河西区",
            "next": []
          },
          {
            "code": "120113",
            "name": "北辰区",
            "next": []
          },
          {
            "code": "120101",
            "name": "和平区",
            "next": []
          },
          {
            "code": "120115",
            "name": "宝坻区",
            "next": []
          },
          {
            "code": "120114",
            "name": "武清区",
            "next": []
          },
          {
            "code": "120112",
            "name": "津南区",
            "next": []
          },
          {
            "code": "120110",
            "name": "东丽区",
            "next": []
          },
          {
            "code": "120111",
            "name": "西青区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "650000",
    "name": "新疆维吾尔自治区",
    "next": [
      {
        "code": "652300",
        "name": "昌吉州",
        "next": [
          {
            "code": "652301",
            "name": "昌吉市",
            "next": []
          },
          {
            "code": "652302",
            "name": "阜康市",
            "next": []
          },
          {
            "code": "652325",
            "name": "奇台县",
            "next": []
          },
          {
            "code": "652323",
            "name": "呼图壁县",
            "next": []
          },
          {
            "code": "652327",
            "name": "吉木萨尔县",
            "next": []
          },
          {
            "code": "652324",
            "name": "玛纳斯",
            "next": []
          },
          {
            "code": "652328",
            "name": "木垒县",
            "next": []
          },
          {
            "code": "652303",
            "name": "米泉市",
            "next": []
          }
        ]
      },
      {
        "code": "659000",
        "name": "省直辖",
        "next": [
          {
            "code": "659002",
            "name": "阿拉尔市",
            "next": []
          },
          {
            "code": "659003",
            "name": "图木舒克市",
            "next": []
          },
          {
            "code": "659001",
            "name": "石河子市",
            "next": []
          },
          {
            "code": "659004",
            "name": "五家渠市",
            "next": []
          }
        ]
      },
      {
        "code": "652800",
        "name": "巴音郭楞蒙古自治州",
        "next": [
          {
            "code": "652801",
            "name": "库尔勒市",
            "next": []
          },
          {
            "code": "652829",
            "name": "博湖县",
            "next": []
          },
          {
            "code": "652828",
            "name": "和硕县",
            "next": []
          },
          {
            "code": "652823",
            "name": "尉犁县",
            "next": []
          },
          {
            "code": "652822",
            "name": "轮台县",
            "next": []
          },
          {
            "code": "652825",
            "name": "且末县",
            "next": []
          },
          {
            "code": "652824",
            "name": "若羌县",
            "next": []
          },
          {
            "code": "652827",
            "name": "和静县",
            "next": []
          },
          {
            "code": "652826",
            "name": "焉耆县",
            "next": []
          }
        ]
      },
      {
        "code": "652700",
        "name": "博尔塔拉蒙古自治州",
        "next": [
          {
            "code": "652722",
            "name": "精河县",
            "next": []
          },
          {
            "code": "652723",
            "name": "温泉县",
            "next": []
          },
          {
            "code": "652701",
            "name": "博乐市",
            "next": []
          }
        ]
      },
      {
        "code": "654300",
        "name": "阿勒泰地区",
        "next": [
          {
            "code": "654321",
            "name": "布尔津县",
            "next": []
          },
          {
            "code": "654322",
            "name": "富蕴县",
            "next": []
          },
          {
            "code": "654323",
            "name": "福海县",
            "next": []
          },
          {
            "code": "654324",
            "name": "哈巴河县",
            "next": []
          },
          {
            "code": "654325",
            "name": "青河县",
            "next": []
          },
          {
            "code": "654326",
            "name": "吉木乃县",
            "next": []
          },
          {
            "code": "654301",
            "name": "阿勒泰市",
            "next": []
          }
        ]
      },
      {
        "code": "652200",
        "name": "哈密地区",
        "next": [
          {
            "code": "652201",
            "name": "哈密市",
            "next": []
          },
          {
            "code": "652222",
            "name": "巴里坤县",
            "next": []
          },
          {
            "code": "652223",
            "name": "伊吾县",
            "next": []
          }
        ]
      },
      {
        "code": "653100",
        "name": "喀什地区",
        "next": [
          {
            "code": "653130",
            "name": "巴楚县",
            "next": []
          },
          {
            "code": "653131",
            "name": "塔什库尔干县",
            "next": []
          },
          {
            "code": "653101",
            "name": "喀什市",
            "next": []
          },
          {
            "code": "653127",
            "name": "麦盖提县",
            "next": []
          },
          {
            "code": "653126",
            "name": "叶城县",
            "next": []
          },
          {
            "code": "653125",
            "name": "莎车县",
            "next": []
          },
          {
            "code": "653124",
            "name": "泽普县",
            "next": []
          },
          {
            "code": "653123",
            "name": "英吉沙县",
            "next": []
          },
          {
            "code": "653122",
            "name": "疏勒县",
            "next": []
          },
          {
            "code": "653121",
            "name": "疏附县",
            "next": []
          },
          {
            "code": "653129",
            "name": "伽师县",
            "next": []
          },
          {
            "code": "653128",
            "name": "岳普湖县",
            "next": []
          }
        ]
      },
      {
        "code": "654200",
        "name": "塔城地区",
        "next": [
          {
            "code": "654225",
            "name": "裕民县",
            "next": []
          },
          {
            "code": "654224",
            "name": "托里县",
            "next": []
          },
          {
            "code": "654226",
            "name": "和布克赛尔蒙古自治县",
            "next": []
          },
          {
            "code": "654221",
            "name": "额敏县",
            "next": []
          },
          {
            "code": "654223",
            "name": "沙湾县",
            "next": []
          },
          {
            "code": "654202",
            "name": "乌苏市",
            "next": []
          },
          {
            "code": "654201",
            "name": "塔城市",
            "next": []
          }
        ]
      },
      {
        "code": "652100",
        "name": "吐鲁番地区",
        "next": [
          {
            "code": "652101",
            "name": "吐鲁番市",
            "next": []
          },
          {
            "code": "652122",
            "name": "鄯善县",
            "next": []
          },
          {
            "code": "652123",
            "name": "托克逊县",
            "next": []
          }
        ]
      },
      {
        "code": "650200",
        "name": "克拉玛依市",
        "next": [
          {
            "code": "650203",
            "name": "克拉玛依区",
            "next": []
          },
          {
            "code": "650202",
            "name": "独山子区",
            "next": []
          },
          {
            "code": "650201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "650205",
            "name": "乌尔禾区",
            "next": []
          },
          {
            "code": "650204",
            "name": "白碱滩区",
            "next": []
          }
        ]
      },
      {
        "code": "653200",
        "name": "和田地区",
        "next": [
          {
            "code": "653227",
            "name": "民丰县",
            "next": []
          },
          {
            "code": "653221",
            "name": "和田县",
            "next": []
          },
          {
            "code": "653222",
            "name": "墨玉县",
            "next": []
          },
          {
            "code": "653223",
            "name": "皮山县",
            "next": []
          },
          {
            "code": "653224",
            "name": "洛浦县",
            "next": []
          },
          {
            "code": "653225",
            "name": "策勒县",
            "next": []
          },
          {
            "code": "653226",
            "name": "于田县",
            "next": []
          },
          {
            "code": "653201",
            "name": "和田市",
            "next": []
          }
        ]
      },
      {
        "code": "650100",
        "name": "乌鲁木齐市",
        "next": [
          {
            "code": "650108",
            "name": "东山区",
            "next": []
          },
          {
            "code": "650121",
            "name": "乌鲁木齐县",
            "next": []
          },
          {
            "code": "650101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "650102",
            "name": "天山区",
            "next": []
          },
          {
            "code": "650103",
            "name": "沙依巴克区",
            "next": []
          },
          {
            "code": "650104",
            "name": "新市区",
            "next": []
          },
          {
            "code": "650105",
            "name": "水磨沟区",
            "next": []
          },
          {
            "code": "650106",
            "name": "头屯河区",
            "next": []
          },
          {
            "code": "650107",
            "name": "达坂城区",
            "next": []
          }
        ]
      },
      {
        "code": "653000",
        "name": "克州",
        "next": [
          {
            "code": "653022",
            "name": "阿克陶县",
            "next": []
          },
          {
            "code": "653023",
            "name": "阿合奇县",
            "next": []
          },
          {
            "code": "653001",
            "name": "阿图什市",
            "next": []
          },
          {
            "code": "653024",
            "name": "乌恰县",
            "next": []
          }
        ]
      },
      {
        "code": "652900",
        "name": "阿克苏地区",
        "next": [
          {
            "code": "652924",
            "name": "沙雅县",
            "next": []
          },
          {
            "code": "652925",
            "name": "新和县",
            "next": []
          },
          {
            "code": "652926",
            "name": "拜城县",
            "next": []
          },
          {
            "code": "652927",
            "name": "乌什县",
            "next": []
          },
          {
            "code": "652922",
            "name": "温宿县",
            "next": []
          },
          {
            "code": "652923",
            "name": "库车县",
            "next": []
          },
          {
            "code": "652928",
            "name": "阿瓦提县",
            "next": []
          },
          {
            "code": "652929",
            "name": "柯坪县",
            "next": []
          },
          {
            "code": "652901",
            "name": "阿克苏市",
            "next": []
          }
        ]
      },
      {
        "code": "654000",
        "name": "伊犁州",
        "next": [
          {
            "code": "654027",
            "name": "特克斯县",
            "next": []
          },
          {
            "code": "654026",
            "name": "昭苏县",
            "next": []
          },
          {
            "code": "654025",
            "name": "新源县",
            "next": []
          },
          {
            "code": "654024",
            "name": "巩留县",
            "next": []
          },
          {
            "code": "654023",
            "name": "霍城县",
            "next": []
          },
          {
            "code": "654022",
            "name": "察布查尔县",
            "next": []
          },
          {
            "code": "654021",
            "name": "伊宁县",
            "next": []
          },
          {
            "code": "654028",
            "name": "尼勒克县",
            "next": []
          },
          {
            "code": "654003",
            "name": "奎屯市",
            "next": []
          },
          {
            "code": "654002",
            "name": "伊宁市",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "530000",
    "name": "云南省",
    "next": [
      {
        "code": "533300",
        "name": "怒江州",
        "next": [
          {
            "code": "533324",
            "name": "贡山县",
            "next": []
          },
          {
            "code": "533325",
            "name": "兰坪县",
            "next": []
          },
          {
            "code": "533323",
            "name": "福贡县",
            "next": []
          },
          {
            "code": "533321",
            "name": "泸水县",
            "next": []
          }
        ]
      },
      {
        "code": "530300",
        "name": "曲靖市",
        "next": [
          {
            "code": "530301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "530302",
            "name": "麒麟区",
            "next": []
          },
          {
            "code": "530323",
            "name": "师宗县",
            "next": []
          },
          {
            "code": "530322",
            "name": "陆良县",
            "next": []
          },
          {
            "code": "530321",
            "name": "马龙县",
            "next": []
          },
          {
            "code": "530326",
            "name": "会泽县",
            "next": []
          },
          {
            "code": "530325",
            "name": "富源县",
            "next": []
          },
          {
            "code": "530324",
            "name": "罗平县",
            "next": []
          },
          {
            "code": "530381",
            "name": "宣威市",
            "next": []
          },
          {
            "code": "530328",
            "name": "沾益县",
            "next": []
          }
        ]
      },
      {
        "code": "530800",
        "name": "思茅市",
        "next": [
          {
            "code": "530802",
            "name": "翠云区",
            "next": []
          },
          {
            "code": "530801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "530828",
            "name": "澜沧县",
            "next": []
          },
          {
            "code": "530829",
            "name": "西盟县",
            "next": []
          },
          {
            "code": "530824",
            "name": "景谷县",
            "next": []
          },
          {
            "code": "530825",
            "name": "镇沅县",
            "next": []
          },
          {
            "code": "530826",
            "name": "江城县",
            "next": []
          },
          {
            "code": "530827",
            "name": "孟连县",
            "next": []
          },
          {
            "code": "530821",
            "name": "普洱县",
            "next": []
          },
          {
            "code": "530822",
            "name": "墨江县",
            "next": []
          },
          {
            "code": "530823",
            "name": "景东县",
            "next": []
          }
        ]
      },
      {
        "code": "530700",
        "name": "丽江市",
        "next": [
          {
            "code": "530701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "530702",
            "name": "古城区",
            "next": []
          },
          {
            "code": "530724",
            "name": "宁蒗县",
            "next": []
          },
          {
            "code": "530723",
            "name": "华坪县",
            "next": []
          },
          {
            "code": "530722",
            "name": "永胜县",
            "next": []
          },
          {
            "code": "530721",
            "name": "玉龙县",
            "next": []
          }
        ]
      },
      {
        "code": "532500",
        "name": "红河州",
        "next": [
          {
            "code": "532532",
            "name": "河口县",
            "next": []
          },
          {
            "code": "532501",
            "name": "个旧市",
            "next": []
          },
          {
            "code": "532502",
            "name": "开远市",
            "next": []
          },
          {
            "code": "532523",
            "name": "屏边县",
            "next": []
          },
          {
            "code": "532522",
            "name": "蒙自县",
            "next": []
          },
          {
            "code": "532527",
            "name": "泸西县",
            "next": []
          },
          {
            "code": "532526",
            "name": "弥勒县",
            "next": []
          },
          {
            "code": "532525",
            "name": "石屏县",
            "next": []
          },
          {
            "code": "532524",
            "name": "建水县",
            "next": []
          },
          {
            "code": "532530",
            "name": "金平县",
            "next": []
          },
          {
            "code": "532529",
            "name": "红河县",
            "next": []
          },
          {
            "code": "532528",
            "name": "元阳县",
            "next": []
          },
          {
            "code": "532531",
            "name": "绿春县",
            "next": []
          }
        ]
      },
      {
        "code": "530900",
        "name": "临沧市",
        "next": [
          {
            "code": "530921",
            "name": "凤庆县",
            "next": []
          },
          {
            "code": "530923",
            "name": "永德县",
            "next": []
          },
          {
            "code": "530922",
            "name": "云县",
            "next": []
          },
          {
            "code": "530925",
            "name": "双江县",
            "next": []
          },
          {
            "code": "530924",
            "name": "镇康县",
            "next": []
          },
          {
            "code": "530927",
            "name": "沧源县",
            "next": []
          },
          {
            "code": "530926",
            "name": "耿马县",
            "next": []
          },
          {
            "code": "530902",
            "name": "临翔区",
            "next": []
          },
          {
            "code": "530901",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "532800",
        "name": "西双版纳州",
        "next": [
          {
            "code": "532822",
            "name": "勐海县",
            "next": []
          },
          {
            "code": "532823",
            "name": "勐腊县",
            "next": []
          },
          {
            "code": "532801",
            "name": "景洪市",
            "next": []
          }
        ]
      },
      {
        "code": "533100",
        "name": "德宏州",
        "next": [
          {
            "code": "533102",
            "name": "瑞丽市",
            "next": []
          },
          {
            "code": "533103",
            "name": "潞西市",
            "next": []
          },
          {
            "code": "533124",
            "name": "陇川县",
            "next": []
          },
          {
            "code": "533122",
            "name": "梁河县",
            "next": []
          },
          {
            "code": "533123",
            "name": "盈江县",
            "next": []
          }
        ]
      },
      {
        "code": "530400",
        "name": "玉溪市",
        "next": [
          {
            "code": "530428",
            "name": "元江县",
            "next": []
          },
          {
            "code": "530402",
            "name": "红塔区",
            "next": []
          },
          {
            "code": "530421",
            "name": "江川县",
            "next": []
          },
          {
            "code": "530422",
            "name": "澄江县",
            "next": []
          },
          {
            "code": "530423",
            "name": "通海县",
            "next": []
          },
          {
            "code": "530424",
            "name": "华宁县",
            "next": []
          },
          {
            "code": "530425",
            "name": "易门县",
            "next": []
          },
          {
            "code": "530426",
            "name": "峨山县",
            "next": []
          },
          {
            "code": "530401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "530427",
            "name": "新平县",
            "next": []
          }
        ]
      },
      {
        "code": "532600",
        "name": "文山州",
        "next": [
          {
            "code": "532628",
            "name": "富宁县",
            "next": []
          },
          {
            "code": "532624",
            "name": "麻栗坡县",
            "next": []
          },
          {
            "code": "532625",
            "name": "马关县",
            "next": []
          },
          {
            "code": "532626",
            "name": "丘北县",
            "next": []
          },
          {
            "code": "532627",
            "name": "广南县",
            "next": []
          },
          {
            "code": "532621",
            "name": "文山县",
            "next": []
          },
          {
            "code": "532622",
            "name": "砚山县",
            "next": []
          },
          {
            "code": "532623",
            "name": "西畴县",
            "next": []
          }
        ]
      },
      {
        "code": "530100",
        "name": "昆明市",
        "next": [
          {
            "code": "530129",
            "name": "寻甸县",
            "next": []
          },
          {
            "code": "530128",
            "name": "禄劝县",
            "next": []
          },
          {
            "code": "530121",
            "name": "呈贡县",
            "next": []
          },
          {
            "code": "530181",
            "name": "安宁市",
            "next": []
          },
          {
            "code": "530122",
            "name": "晋宁县",
            "next": []
          },
          {
            "code": "530125",
            "name": "宜良县",
            "next": []
          },
          {
            "code": "530124",
            "name": "富民县",
            "next": []
          },
          {
            "code": "530127",
            "name": "嵩明县",
            "next": []
          },
          {
            "code": "530126",
            "name": "石林县",
            "next": []
          },
          {
            "code": "530103",
            "name": "盘龙区",
            "next": []
          },
          {
            "code": "530102",
            "name": "五华区",
            "next": []
          },
          {
            "code": "530101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "530111",
            "name": "官渡区",
            "next": []
          },
          {
            "code": "530112",
            "name": "西山区",
            "next": []
          },
          {
            "code": "530113",
            "name": "东川区",
            "next": []
          }
        ]
      },
      {
        "code": "532900",
        "name": "大理州",
        "next": [
          {
            "code": "532930",
            "name": "洱源县",
            "next": []
          },
          {
            "code": "532931",
            "name": "剑川县",
            "next": []
          },
          {
            "code": "532932",
            "name": "鹤庆县",
            "next": []
          },
          {
            "code": "532901",
            "name": "大理市",
            "next": []
          },
          {
            "code": "532929",
            "name": "云龙县",
            "next": []
          },
          {
            "code": "532928",
            "name": "永平县",
            "next": []
          },
          {
            "code": "532927",
            "name": "巍山县",
            "next": []
          },
          {
            "code": "532926",
            "name": "南涧县",
            "next": []
          },
          {
            "code": "532925",
            "name": "弥渡县",
            "next": []
          },
          {
            "code": "532924",
            "name": "宾川县",
            "next": []
          },
          {
            "code": "532923",
            "name": "祥云县",
            "next": []
          },
          {
            "code": "532922",
            "name": "漾濞县",
            "next": []
          }
        ]
      },
      {
        "code": "530500",
        "name": "保山市",
        "next": [
          {
            "code": "530524",
            "name": "昌宁县",
            "next": []
          },
          {
            "code": "530521",
            "name": "施甸县",
            "next": []
          },
          {
            "code": "530523",
            "name": "龙陵县",
            "next": []
          },
          {
            "code": "530522",
            "name": "腾冲县",
            "next": []
          },
          {
            "code": "530502",
            "name": "隆阳区",
            "next": []
          },
          {
            "code": "530501",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "533400",
        "name": "迪庆州",
        "next": [
          {
            "code": "533421",
            "name": "香格里拉县",
            "next": []
          },
          {
            "code": "533423",
            "name": "维西县",
            "next": []
          },
          {
            "code": "533422",
            "name": "德钦县",
            "next": []
          }
        ]
      },
      {
        "code": "530600",
        "name": "昭通市",
        "next": [
          {
            "code": "530630",
            "name": "水富县",
            "next": []
          },
          {
            "code": "530622",
            "name": "巧家县",
            "next": []
          },
          {
            "code": "530623",
            "name": "盐津县",
            "next": []
          },
          {
            "code": "530621",
            "name": "鲁甸县",
            "next": []
          },
          {
            "code": "530626",
            "name": "绥江县",
            "next": []
          },
          {
            "code": "530627",
            "name": "镇雄县",
            "next": []
          },
          {
            "code": "530624",
            "name": "大关县",
            "next": []
          },
          {
            "code": "530625",
            "name": "永善县",
            "next": []
          },
          {
            "code": "530628",
            "name": "彝良县",
            "next": []
          },
          {
            "code": "530629",
            "name": "威信县",
            "next": []
          },
          {
            "code": "530601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "530602",
            "name": "昭阳区",
            "next": []
          }
        ]
      },
      {
        "code": "532300",
        "name": "楚雄州",
        "next": [
          {
            "code": "532331",
            "name": "禄丰县",
            "next": []
          },
          {
            "code": "532325",
            "name": "姚安县",
            "next": []
          },
          {
            "code": "532324",
            "name": "南华县",
            "next": []
          },
          {
            "code": "532327",
            "name": "永仁县",
            "next": []
          },
          {
            "code": "532326",
            "name": "大姚县",
            "next": []
          },
          {
            "code": "532323",
            "name": "牟定县",
            "next": []
          },
          {
            "code": "532322",
            "name": "双柏县",
            "next": []
          },
          {
            "code": "532329",
            "name": "武定县",
            "next": []
          },
          {
            "code": "532328",
            "name": "元谋县",
            "next": []
          },
          {
            "code": "532301",
            "name": "楚雄市",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "370000",
    "name": "山东省",
    "next": [
      {
        "code": "370800",
        "name": "济宁市",
        "next": [
          {
            "code": "370826",
            "name": "微山县",
            "next": []
          },
          {
            "code": "370801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370802",
            "name": "市中区",
            "next": []
          },
          {
            "code": "370831",
            "name": "泗水县",
            "next": []
          },
          {
            "code": "370830",
            "name": "汶上县",
            "next": []
          },
          {
            "code": "370827",
            "name": "鱼台县",
            "next": []
          },
          {
            "code": "370832",
            "name": "梁山县",
            "next": []
          },
          {
            "code": "370828",
            "name": "金乡县",
            "next": []
          },
          {
            "code": "370829",
            "name": "嘉祥县",
            "next": []
          },
          {
            "code": "370811",
            "name": "任城区",
            "next": []
          },
          {
            "code": "370881",
            "name": "曲阜市",
            "next": []
          },
          {
            "code": "370882",
            "name": "兖州市",
            "next": []
          },
          {
            "code": "370883",
            "name": "邹城市",
            "next": []
          }
        ]
      },
      {
        "code": "371500",
        "name": "聊城市",
        "next": [
          {
            "code": "371502",
            "name": "东昌府区",
            "next": []
          },
          {
            "code": "371501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "371524",
            "name": "东阿县",
            "next": []
          },
          {
            "code": "371525",
            "name": "冠县",
            "next": []
          },
          {
            "code": "371526",
            "name": "高唐县",
            "next": []
          },
          {
            "code": "371581",
            "name": "临清市",
            "next": []
          },
          {
            "code": "371521",
            "name": "阳谷县",
            "next": []
          },
          {
            "code": "371522",
            "name": "莘县",
            "next": []
          },
          {
            "code": "371523",
            "name": "茌平县",
            "next": []
          }
        ]
      },
      {
        "code": "370300",
        "name": "淄博市",
        "next": [
          {
            "code": "370303",
            "name": "张店区",
            "next": []
          },
          {
            "code": "370302",
            "name": "淄川区",
            "next": []
          },
          {
            "code": "370301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370306",
            "name": "周村区",
            "next": []
          },
          {
            "code": "370305",
            "name": "临淄区",
            "next": []
          },
          {
            "code": "370304",
            "name": "博山区",
            "next": []
          },
          {
            "code": "370321",
            "name": "桓台县",
            "next": []
          },
          {
            "code": "370323",
            "name": "沂源县",
            "next": []
          },
          {
            "code": "370322",
            "name": "高青县",
            "next": []
          }
        ]
      },
      {
        "code": "371100",
        "name": "日照市",
        "next": [
          {
            "code": "371121",
            "name": "五莲县",
            "next": []
          },
          {
            "code": "371122",
            "name": "莒县",
            "next": []
          },
          {
            "code": "371102",
            "name": "东港区",
            "next": []
          },
          {
            "code": "371103",
            "name": "岚山区",
            "next": []
          },
          {
            "code": "371101",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "370700",
        "name": "潍坊市",
        "next": [
          {
            "code": "370705",
            "name": "奎文区",
            "next": []
          },
          {
            "code": "370704",
            "name": "坊子区",
            "next": []
          },
          {
            "code": "370703",
            "name": "寒亭区",
            "next": []
          },
          {
            "code": "370702",
            "name": "潍城区",
            "next": []
          },
          {
            "code": "370701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370786",
            "name": "昌邑市",
            "next": []
          },
          {
            "code": "370785",
            "name": "高密市",
            "next": []
          },
          {
            "code": "370784",
            "name": "安丘市",
            "next": []
          },
          {
            "code": "370783",
            "name": "寿光市",
            "next": []
          },
          {
            "code": "370782",
            "name": "诸城市",
            "next": []
          },
          {
            "code": "370781",
            "name": "青州市",
            "next": []
          },
          {
            "code": "370725",
            "name": "昌乐县",
            "next": []
          },
          {
            "code": "370724",
            "name": "临朐县",
            "next": []
          }
        ]
      },
      {
        "code": "370900",
        "name": "泰安市",
        "next": [
          {
            "code": "370983",
            "name": "肥城市",
            "next": []
          },
          {
            "code": "370982",
            "name": "新泰市",
            "next": []
          },
          {
            "code": "370901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370903",
            "name": "岱岳区",
            "next": []
          },
          {
            "code": "370902",
            "name": "泰山区",
            "next": []
          },
          {
            "code": "370923",
            "name": "东平县",
            "next": []
          },
          {
            "code": "370921",
            "name": "宁阳县",
            "next": []
          }
        ]
      },
      {
        "code": "371400",
        "name": "德州市",
        "next": [
          {
            "code": "371421",
            "name": "陵县",
            "next": []
          },
          {
            "code": "371423",
            "name": "庆云县",
            "next": []
          },
          {
            "code": "371422",
            "name": "宁津县",
            "next": []
          },
          {
            "code": "371425",
            "name": "齐河县",
            "next": []
          },
          {
            "code": "371424",
            "name": "临邑县",
            "next": []
          },
          {
            "code": "371427",
            "name": "夏津县",
            "next": []
          },
          {
            "code": "371426",
            "name": "平原县",
            "next": []
          },
          {
            "code": "371402",
            "name": "德城区",
            "next": []
          },
          {
            "code": "371401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "371482",
            "name": "禹城市",
            "next": []
          },
          {
            "code": "371481",
            "name": "乐陵市",
            "next": []
          },
          {
            "code": "371428",
            "name": "武城县",
            "next": []
          }
        ]
      },
      {
        "code": "370400",
        "name": "枣庄市",
        "next": [
          {
            "code": "370404",
            "name": "峄城区",
            "next": []
          },
          {
            "code": "370405",
            "name": "台儿庄区",
            "next": []
          },
          {
            "code": "370406",
            "name": "山亭区",
            "next": []
          },
          {
            "code": "370401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370402",
            "name": "市中区",
            "next": []
          },
          {
            "code": "370403",
            "name": "薛城区",
            "next": []
          },
          {
            "code": "370481",
            "name": "滕州市",
            "next": []
          }
        ]
      },
      {
        "code": "371000",
        "name": "威海市",
        "next": [
          {
            "code": "371081",
            "name": "文登市",
            "next": []
          },
          {
            "code": "371083",
            "name": "乳山市",
            "next": []
          },
          {
            "code": "371002",
            "name": "环翠区",
            "next": []
          },
          {
            "code": "371001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "371082",
            "name": "荣成市",
            "next": []
          }
        ]
      },
      {
        "code": "371700",
        "name": "菏泽市",
        "next": [
          {
            "code": "371727",
            "name": "定陶县",
            "next": []
          },
          {
            "code": "371702",
            "name": "牡丹区",
            "next": []
          },
          {
            "code": "371726",
            "name": "鄄城县",
            "next": []
          },
          {
            "code": "371701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "371724",
            "name": "巨野县",
            "next": []
          },
          {
            "code": "371725",
            "name": "郓城县",
            "next": []
          },
          {
            "code": "371722",
            "name": "单县",
            "next": []
          },
          {
            "code": "371723",
            "name": "成武县",
            "next": []
          },
          {
            "code": "371721",
            "name": "曹县",
            "next": []
          },
          {
            "code": "371728",
            "name": "东明县",
            "next": []
          }
        ]
      },
      {
        "code": "370100",
        "name": "济南市",
        "next": [
          {
            "code": "370112",
            "name": "历城区",
            "next": []
          },
          {
            "code": "370101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370113",
            "name": "长清区",
            "next": []
          },
          {
            "code": "370103",
            "name": "市中区",
            "next": []
          },
          {
            "code": "370102",
            "name": "历下区",
            "next": []
          },
          {
            "code": "370105",
            "name": "天桥区",
            "next": []
          },
          {
            "code": "370104",
            "name": "槐荫区",
            "next": []
          },
          {
            "code": "370181",
            "name": "章丘市",
            "next": []
          },
          {
            "code": "370126",
            "name": "商河县",
            "next": []
          },
          {
            "code": "370125",
            "name": "济阳县",
            "next": []
          },
          {
            "code": "370124",
            "name": "平阴县",
            "next": []
          }
        ]
      },
      {
        "code": "371300",
        "name": "临沂市",
        "next": [
          {
            "code": "371328",
            "name": "蒙阴县",
            "next": []
          },
          {
            "code": "371329",
            "name": "临沭县",
            "next": []
          },
          {
            "code": "371322",
            "name": "郯城县",
            "next": []
          },
          {
            "code": "371323",
            "name": "沂水县",
            "next": []
          },
          {
            "code": "371321",
            "name": "沂南县",
            "next": []
          },
          {
            "code": "371326",
            "name": "平邑县",
            "next": []
          },
          {
            "code": "371327",
            "name": "莒南县",
            "next": []
          },
          {
            "code": "371324",
            "name": "苍山县",
            "next": []
          },
          {
            "code": "371325",
            "name": "费县",
            "next": []
          },
          {
            "code": "371312",
            "name": "河东区",
            "next": []
          },
          {
            "code": "371311",
            "name": "罗庄区",
            "next": []
          },
          {
            "code": "371301",
            "name": "临沂市辖区",
            "next": []
          },
          {
            "code": "371302",
            "name": "兰山区",
            "next": []
          }
        ]
      },
      {
        "code": "370500",
        "name": "东营市",
        "next": [
          {
            "code": "370501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370503",
            "name": "河口区",
            "next": []
          },
          {
            "code": "370502",
            "name": "东营区",
            "next": []
          },
          {
            "code": "370523",
            "name": "广饶县",
            "next": []
          },
          {
            "code": "370522",
            "name": "利津县",
            "next": []
          },
          {
            "code": "370521",
            "name": "垦利县",
            "next": []
          }
        ]
      },
      {
        "code": "371600",
        "name": "滨州市",
        "next": [
          {
            "code": "371623",
            "name": "无棣县",
            "next": []
          },
          {
            "code": "371622",
            "name": "阳信县",
            "next": []
          },
          {
            "code": "371621",
            "name": "惠民县",
            "next": []
          },
          {
            "code": "371626",
            "name": "邹平县",
            "next": []
          },
          {
            "code": "371625",
            "name": "博兴县",
            "next": []
          },
          {
            "code": "371624",
            "name": "沾化县",
            "next": []
          },
          {
            "code": "371601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "371602",
            "name": "滨城区",
            "next": []
          }
        ]
      },
      {
        "code": "370200",
        "name": "青岛市",
        "next": [
          {
            "code": "370201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370283",
            "name": "平度市",
            "next": []
          },
          {
            "code": "370282",
            "name": "即墨市",
            "next": []
          },
          {
            "code": "370211",
            "name": "黄岛区",
            "next": []
          },
          {
            "code": "370281",
            "name": "胶州市",
            "next": []
          },
          {
            "code": "370284",
            "name": "胶南市",
            "next": []
          },
          {
            "code": "370285",
            "name": "莱西市",
            "next": []
          },
          {
            "code": "370202",
            "name": "市南区",
            "next": []
          },
          {
            "code": "370203",
            "name": "市北区",
            "next": []
          },
          {
            "code": "370213",
            "name": "李沧区",
            "next": []
          },
          {
            "code": "370212",
            "name": "崂山区",
            "next": []
          },
          {
            "code": "370214",
            "name": "城阳区",
            "next": []
          },
          {
            "code": "370205",
            "name": "四方区",
            "next": []
          }
        ]
      },
      {
        "code": "371200",
        "name": "莱芜市",
        "next": [
          {
            "code": "371201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "371203",
            "name": "钢城区",
            "next": []
          },
          {
            "code": "371202",
            "name": "莱城区",
            "next": []
          }
        ]
      },
      {
        "code": "370600",
        "name": "烟台市",
        "next": [
          {
            "code": "370686",
            "name": "栖霞市",
            "next": []
          },
          {
            "code": "370687",
            "name": "海阳市",
            "next": []
          },
          {
            "code": "370684",
            "name": "蓬莱市",
            "next": []
          },
          {
            "code": "370634",
            "name": "长岛县",
            "next": []
          },
          {
            "code": "370682",
            "name": "莱阳市",
            "next": []
          },
          {
            "code": "370683",
            "name": "莱州市",
            "next": []
          },
          {
            "code": "370681",
            "name": "龙口市",
            "next": []
          },
          {
            "code": "370602",
            "name": "芝罘区",
            "next": []
          },
          {
            "code": "370685",
            "name": "招远市",
            "next": []
          },
          {
            "code": "370601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "370611",
            "name": "福山区",
            "next": []
          },
          {
            "code": "370613",
            "name": "莱山区",
            "next": []
          },
          {
            "code": "370612",
            "name": "牟平区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "330000",
    "name": "浙江省",
    "next": [
      {
        "code": "330700",
        "name": "金华市",
        "next": [
          {
            "code": "330703",
            "name": "金东区",
            "next": []
          },
          {
            "code": "330702",
            "name": "婺城区",
            "next": []
          },
          {
            "code": "330701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "330783",
            "name": "东阳市",
            "next": []
          },
          {
            "code": "330782",
            "name": "义乌市",
            "next": []
          },
          {
            "code": "330723",
            "name": "武义县",
            "next": []
          },
          {
            "code": "330784",
            "name": "永康市",
            "next": []
          },
          {
            "code": "330781",
            "name": "兰溪市",
            "next": []
          },
          {
            "code": "330727",
            "name": "磐安县",
            "next": []
          },
          {
            "code": "330726",
            "name": "浦江县",
            "next": []
          }
        ]
      },
      {
        "code": "330800",
        "name": "衢州市",
        "next": [
          {
            "code": "330801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "330802",
            "name": "柯城区",
            "next": []
          },
          {
            "code": "330803",
            "name": "衢江区",
            "next": []
          },
          {
            "code": "330822",
            "name": "常山县",
            "next": []
          },
          {
            "code": "330881",
            "name": "江山市",
            "next": []
          },
          {
            "code": "330824",
            "name": "开化县",
            "next": []
          },
          {
            "code": "330825",
            "name": "龙游县",
            "next": []
          }
        ]
      },
      {
        "code": "330300",
        "name": "温州市",
        "next": [
          {
            "code": "330304",
            "name": "瓯海区",
            "next": []
          },
          {
            "code": "330303",
            "name": "龙湾区",
            "next": []
          },
          {
            "code": "330302",
            "name": "鹿城区",
            "next": []
          },
          {
            "code": "330301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "330382",
            "name": "乐清市",
            "next": []
          },
          {
            "code": "330381",
            "name": "瑞安市",
            "next": []
          },
          {
            "code": "330329",
            "name": "泰顺县",
            "next": []
          },
          {
            "code": "330328",
            "name": "文成县",
            "next": []
          },
          {
            "code": "330324",
            "name": "永嘉县",
            "next": []
          },
          {
            "code": "330327",
            "name": "苍南县",
            "next": []
          },
          {
            "code": "330326",
            "name": "平阳县",
            "next": []
          },
          {
            "code": "330322",
            "name": "洞头县",
            "next": []
          }
        ]
      },
      {
        "code": "330400",
        "name": "嘉兴市",
        "next": [
          {
            "code": "330401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "330402",
            "name": "南湖区",
            "next": []
          },
          {
            "code": "330421",
            "name": "嘉善县",
            "next": []
          },
          {
            "code": "330481",
            "name": "海宁市",
            "next": []
          },
          {
            "code": "330482",
            "name": "平湖市",
            "next": []
          },
          {
            "code": "330483",
            "name": "桐乡市",
            "next": []
          },
          {
            "code": "330411",
            "name": "秀洲区",
            "next": []
          },
          {
            "code": "330424",
            "name": "海盐县",
            "next": []
          }
        ]
      },
      {
        "code": "330900",
        "name": "舟山市",
        "next": [
          {
            "code": "330922",
            "name": "嵊泗县",
            "next": []
          },
          {
            "code": "330901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "330921",
            "name": "岱山县",
            "next": []
          },
          {
            "code": "330903",
            "name": "普陀区",
            "next": []
          },
          {
            "code": "330902",
            "name": "定海区",
            "next": []
          }
        ]
      },
      {
        "code": "330500",
        "name": "湖州市",
        "next": [
          {
            "code": "330501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "330503",
            "name": "南浔区",
            "next": []
          },
          {
            "code": "330502",
            "name": "吴兴区",
            "next": []
          },
          {
            "code": "330523",
            "name": "安吉县",
            "next": []
          },
          {
            "code": "330522",
            "name": "长兴县",
            "next": []
          },
          {
            "code": "330521",
            "name": "德清县",
            "next": []
          }
        ]
      },
      {
        "code": "331000",
        "name": "台州市",
        "next": [
          {
            "code": "331003",
            "name": "黄岩区",
            "next": []
          },
          {
            "code": "331002",
            "name": "椒江区",
            "next": []
          },
          {
            "code": "331001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "331004",
            "name": "路桥区",
            "next": []
          },
          {
            "code": "331021",
            "name": "玉环县",
            "next": []
          },
          {
            "code": "331082",
            "name": "临海市",
            "next": []
          },
          {
            "code": "331023",
            "name": "天台县",
            "next": []
          },
          {
            "code": "331022",
            "name": "三门县",
            "next": []
          },
          {
            "code": "331024",
            "name": "仙居县",
            "next": []
          },
          {
            "code": "331081",
            "name": "温岭市",
            "next": []
          }
        ]
      },
      {
        "code": "330100",
        "name": "杭州市",
        "next": [
          {
            "code": "330110",
            "name": "余杭区",
            "next": []
          },
          {
            "code": "330185",
            "name": "临安市",
            "next": []
          },
          {
            "code": "330183",
            "name": "富阳市",
            "next": []
          },
          {
            "code": "330122",
            "name": "桐庐县",
            "next": []
          },
          {
            "code": "330105",
            "name": "拱墅区",
            "next": []
          },
          {
            "code": "330104",
            "name": "江干区",
            "next": []
          },
          {
            "code": "330106",
            "name": "西湖区",
            "next": []
          },
          {
            "code": "330101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "330103",
            "name": "下城区",
            "next": []
          },
          {
            "code": "330102",
            "name": "上城区",
            "next": []
          },
          {
            "code": "330127",
            "name": "淳安县",
            "next": []
          },
          {
            "code": "330182",
            "name": "建德市",
            "next": []
          },
          {
            "code": "330109",
            "name": "萧山区",
            "next": []
          },
          {
            "code": "330108",
            "name": "滨江区",
            "next": []
          }
        ]
      },
      {
        "code": "330600",
        "name": "绍兴市",
        "next": [
          {
            "code": "330624",
            "name": "新昌县",
            "next": []
          },
          {
            "code": "330621",
            "name": "绍兴县",
            "next": []
          },
          {
            "code": "330682",
            "name": "上虞市",
            "next": []
          },
          {
            "code": "330683",
            "name": "嵊州市",
            "next": []
          },
          {
            "code": "330681",
            "name": "诸暨市",
            "next": []
          },
          {
            "code": "330602",
            "name": "越城区",
            "next": []
          },
          {
            "code": "330601",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "331100",
        "name": "丽水市",
        "next": [
          {
            "code": "331124",
            "name": "松阳县",
            "next": []
          },
          {
            "code": "331125",
            "name": "云和县",
            "next": []
          },
          {
            "code": "331126",
            "name": "庆元县",
            "next": []
          },
          {
            "code": "331127",
            "name": "景宁畲族自治县",
            "next": []
          },
          {
            "code": "331121",
            "name": "青田县",
            "next": []
          },
          {
            "code": "331122",
            "name": "缙云县",
            "next": []
          },
          {
            "code": "331123",
            "name": "遂昌县",
            "next": []
          },
          {
            "code": "331181",
            "name": "龙泉市",
            "next": []
          },
          {
            "code": "331102",
            "name": "莲都区",
            "next": []
          },
          {
            "code": "331101",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "330200",
        "name": "宁波市",
        "next": [
          {
            "code": "330282",
            "name": "慈溪市",
            "next": []
          },
          {
            "code": "330212",
            "name": "鄞州区",
            "next": []
          },
          {
            "code": "330281",
            "name": "余姚市",
            "next": []
          },
          {
            "code": "330283",
            "name": "奉化市",
            "next": []
          },
          {
            "code": "330225",
            "name": "象山县",
            "next": []
          },
          {
            "code": "330206",
            "name": "北仑区",
            "next": []
          },
          {
            "code": "330204",
            "name": "江东区",
            "next": []
          },
          {
            "code": "330205",
            "name": "江北区",
            "next": []
          },
          {
            "code": "330211",
            "name": "镇海区",
            "next": []
          },
          {
            "code": "330203",
            "name": "海曙区",
            "next": []
          },
          {
            "code": "330226",
            "name": "宁海县",
            "next": []
          },
          {
            "code": "330201",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "210000",
    "name": "辽宁省",
    "next": [
      {
        "code": "210900",
        "name": "阜新市",
        "next": [
          {
            "code": "210901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210902",
            "name": "海州区",
            "next": []
          },
          {
            "code": "210903",
            "name": "新邱区",
            "next": []
          },
          {
            "code": "210904",
            "name": "太平区",
            "next": []
          },
          {
            "code": "210905",
            "name": "清河门区",
            "next": []
          },
          {
            "code": "210921",
            "name": "阜新蒙古族自治县",
            "next": []
          },
          {
            "code": "210911",
            "name": "细河区",
            "next": []
          },
          {
            "code": "210922",
            "name": "彰武县",
            "next": []
          }
        ]
      },
      {
        "code": "210200",
        "name": "大连市",
        "next": [
          {
            "code": "210203",
            "name": "西岗区",
            "next": []
          },
          {
            "code": "210202",
            "name": "中山区",
            "next": []
          },
          {
            "code": "210201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210211",
            "name": "甘井子区",
            "next": []
          },
          {
            "code": "210212",
            "name": "旅顺口区",
            "next": []
          },
          {
            "code": "210204",
            "name": "沙河口区",
            "next": []
          },
          {
            "code": "210213",
            "name": "金州区",
            "next": []
          },
          {
            "code": "210283",
            "name": "庄河市",
            "next": []
          },
          {
            "code": "210282",
            "name": "普兰店市",
            "next": []
          },
          {
            "code": "210281",
            "name": "瓦房店市",
            "next": []
          },
          {
            "code": "210224",
            "name": "长海县",
            "next": []
          }
        ]
      },
      {
        "code": "210600",
        "name": "丹东市",
        "next": [
          {
            "code": "210604",
            "name": "振安区",
            "next": []
          },
          {
            "code": "210603",
            "name": "振兴区",
            "next": []
          },
          {
            "code": "210602",
            "name": "元宝区",
            "next": []
          },
          {
            "code": "210601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210682",
            "name": "凤城市",
            "next": []
          },
          {
            "code": "210681",
            "name": "东港市",
            "next": []
          },
          {
            "code": "210624",
            "name": "宽甸满族自治县",
            "next": []
          }
        ]
      },
      {
        "code": "210100",
        "name": "沈阳市",
        "next": [
          {
            "code": "210101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210102",
            "name": "和平区",
            "next": []
          },
          {
            "code": "210103",
            "name": "沈河区",
            "next": []
          },
          {
            "code": "210104",
            "name": "大东区",
            "next": []
          },
          {
            "code": "210105",
            "name": "皇姑区",
            "next": []
          },
          {
            "code": "210106",
            "name": "铁西区",
            "next": []
          },
          {
            "code": "210123",
            "name": "康平县",
            "next": []
          },
          {
            "code": "210181",
            "name": "新民市",
            "next": []
          },
          {
            "code": "210114",
            "name": "于洪区",
            "next": []
          },
          {
            "code": "210113",
            "name": "新城子区",
            "next": []
          },
          {
            "code": "210112",
            "name": "东陵区",
            "next": []
          },
          {
            "code": "210111",
            "name": "苏家屯区",
            "next": []
          },
          {
            "code": "210122",
            "name": "辽中县",
            "next": []
          },
          {
            "code": "210124",
            "name": "法库县",
            "next": []
          }
        ]
      },
      {
        "code": "210800",
        "name": "营口市",
        "next": [
          {
            "code": "210881",
            "name": "盖州市",
            "next": []
          },
          {
            "code": "210811",
            "name": "老边区",
            "next": []
          },
          {
            "code": "210801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210803",
            "name": "西市区",
            "next": []
          },
          {
            "code": "210802",
            "name": "站前区",
            "next": []
          },
          {
            "code": "210804",
            "name": "鲅鱼圈区",
            "next": []
          },
          {
            "code": "210882",
            "name": "大石桥市",
            "next": []
          }
        ]
      },
      {
        "code": "210500",
        "name": "本溪市",
        "next": [
          {
            "code": "210522",
            "name": "桓仁满族自治县",
            "next": []
          },
          {
            "code": "210521",
            "name": "本溪满族自治县",
            "next": []
          },
          {
            "code": "210504",
            "name": "明山区",
            "next": []
          },
          {
            "code": "210505",
            "name": "南芬区",
            "next": []
          },
          {
            "code": "210501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210502",
            "name": "平山区",
            "next": []
          },
          {
            "code": "210503",
            "name": "溪湖区",
            "next": []
          }
        ]
      },
      {
        "code": "211400",
        "name": "葫芦岛市",
        "next": [
          {
            "code": "211481",
            "name": "兴城市",
            "next": []
          },
          {
            "code": "211403",
            "name": "龙港区",
            "next": []
          },
          {
            "code": "211421",
            "name": "绥中县",
            "next": []
          },
          {
            "code": "211422",
            "name": "建昌县",
            "next": []
          },
          {
            "code": "211402",
            "name": "连山区",
            "next": []
          },
          {
            "code": "211404",
            "name": "南票区",
            "next": []
          },
          {
            "code": "211401",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "211200",
        "name": "铁岭市",
        "next": [
          {
            "code": "211201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "211202",
            "name": "银州区",
            "next": []
          },
          {
            "code": "211204",
            "name": "清河区",
            "next": []
          },
          {
            "code": "211223",
            "name": "西丰县",
            "next": []
          },
          {
            "code": "211221",
            "name": "铁岭县",
            "next": []
          },
          {
            "code": "211281",
            "name": "调兵山市",
            "next": []
          },
          {
            "code": "211282",
            "name": "开原市",
            "next": []
          },
          {
            "code": "211224",
            "name": "昌图县",
            "next": []
          }
        ]
      },
      {
        "code": "211100",
        "name": "盘锦市",
        "next": [
          {
            "code": "211103",
            "name": "兴隆台区",
            "next": []
          },
          {
            "code": "211102",
            "name": "双台子区",
            "next": []
          },
          {
            "code": "211101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "211121",
            "name": "大洼县",
            "next": []
          },
          {
            "code": "211122",
            "name": "盘山县",
            "next": []
          }
        ]
      },
      {
        "code": "210400",
        "name": "抚顺市",
        "next": [
          {
            "code": "210402",
            "name": "新抚区",
            "next": []
          },
          {
            "code": "210404",
            "name": "望花区",
            "next": []
          },
          {
            "code": "210401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210403",
            "name": "东洲区",
            "next": []
          },
          {
            "code": "210411",
            "name": "顺城区",
            "next": []
          },
          {
            "code": "210423",
            "name": "清原满族自治县",
            "next": []
          },
          {
            "code": "210422",
            "name": "新宾满族自治县",
            "next": []
          },
          {
            "code": "210421",
            "name": "抚顺县",
            "next": []
          }
        ]
      },
      {
        "code": "210300",
        "name": "鞍山市",
        "next": [
          {
            "code": "210321",
            "name": "台安县",
            "next": []
          },
          {
            "code": "210323",
            "name": "岫岩县",
            "next": []
          },
          {
            "code": "210311",
            "name": "千山区",
            "next": []
          },
          {
            "code": "210381",
            "name": "海城市",
            "next": []
          },
          {
            "code": "210302",
            "name": "铁东区",
            "next": []
          },
          {
            "code": "210303",
            "name": "铁西区",
            "next": []
          },
          {
            "code": "210301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210304",
            "name": "立山区",
            "next": []
          }
        ]
      },
      {
        "code": "211300",
        "name": "朝阳市",
        "next": [
          {
            "code": "211301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "211303",
            "name": "龙城区",
            "next": []
          },
          {
            "code": "211302",
            "name": "双塔区",
            "next": []
          },
          {
            "code": "211381",
            "name": "北票市",
            "next": []
          },
          {
            "code": "211322",
            "name": "建平县",
            "next": []
          },
          {
            "code": "211321",
            "name": "朝阳县",
            "next": []
          },
          {
            "code": "211382",
            "name": "凌源市",
            "next": []
          },
          {
            "code": "211324",
            "name": "喀喇沁左翼蒙古族自治县",
            "next": []
          }
        ]
      },
      {
        "code": "211000",
        "name": "辽阳市",
        "next": [
          {
            "code": "211021",
            "name": "辽阳县",
            "next": []
          },
          {
            "code": "211011",
            "name": "太子河区",
            "next": []
          },
          {
            "code": "211081",
            "name": "灯塔市",
            "next": []
          },
          {
            "code": "211002",
            "name": "白塔区",
            "next": []
          },
          {
            "code": "211003",
            "name": "文圣区",
            "next": []
          },
          {
            "code": "211001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "211004",
            "name": "宏伟区",
            "next": []
          },
          {
            "code": "211005",
            "name": "弓长岭区",
            "next": []
          }
        ]
      },
      {
        "code": "210700",
        "name": "锦州市",
        "next": [
          {
            "code": "210782",
            "name": "北镇市",
            "next": []
          },
          {
            "code": "210781",
            "name": "凌海市",
            "next": []
          },
          {
            "code": "210702",
            "name": "古塔区",
            "next": []
          },
          {
            "code": "210701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "210711",
            "name": "太和区",
            "next": []
          },
          {
            "code": "210703",
            "name": "凌河区",
            "next": []
          },
          {
            "code": "210726",
            "name": "黑山县",
            "next": []
          },
          {
            "code": "210727",
            "name": "义县",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "620000",
    "name": "甘肃省",
    "next": [
      {
        "code": "620600",
        "name": "武威市",
        "next": [
          {
            "code": "620601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "620602",
            "name": "凉州区",
            "next": []
          },
          {
            "code": "620622",
            "name": "古浪县",
            "next": []
          },
          {
            "code": "620623",
            "name": "天祝县",
            "next": []
          },
          {
            "code": "620621",
            "name": "民勤县",
            "next": []
          }
        ]
      },
      {
        "code": "620200",
        "name": "嘉峪关市",
        "next": [
          {
            "code": "620201",
            "name": "市辖",
            "next": []
          }
        ]
      },
      {
        "code": "620900",
        "name": "酒泉市",
        "next": [
          {
            "code": "620902",
            "name": "肃州区",
            "next": []
          },
          {
            "code": "620901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "620982",
            "name": "敦煌市",
            "next": []
          },
          {
            "code": "620981",
            "name": "玉门市",
            "next": []
          },
          {
            "code": "620924",
            "name": "阿克塞县",
            "next": []
          },
          {
            "code": "620921",
            "name": "金塔县",
            "next": []
          },
          {
            "code": "620923",
            "name": "肃北蒙古族自治县",
            "next": []
          },
          {
            "code": "620922",
            "name": "瓜州县",
            "next": []
          }
        ]
      },
      {
        "code": "620700",
        "name": "张掖市",
        "next": [
          {
            "code": "620701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "620702",
            "name": "甘州区",
            "next": []
          },
          {
            "code": "620723",
            "name": "临泽县",
            "next": []
          },
          {
            "code": "620722",
            "name": "民乐县",
            "next": []
          },
          {
            "code": "620721",
            "name": "肃南裕固族自治县",
            "next": []
          },
          {
            "code": "620725",
            "name": "山丹县",
            "next": []
          },
          {
            "code": "620724",
            "name": "高台县",
            "next": []
          }
        ]
      },
      {
        "code": "623000",
        "name": "甘南州",
        "next": [
          {
            "code": "623001",
            "name": "合作市",
            "next": []
          },
          {
            "code": "623025",
            "name": "玛曲县",
            "next": []
          },
          {
            "code": "623024",
            "name": "迭部县",
            "next": []
          },
          {
            "code": "623027",
            "name": "夏河县",
            "next": []
          },
          {
            "code": "623026",
            "name": "碌曲县",
            "next": []
          },
          {
            "code": "623021",
            "name": "临潭县",
            "next": []
          },
          {
            "code": "623023",
            "name": "舟曲县",
            "next": []
          },
          {
            "code": "623022",
            "name": "卓尼县",
            "next": []
          }
        ]
      },
      {
        "code": "621200",
        "name": "陇南市",
        "next": [
          {
            "code": "621228",
            "name": "两当县",
            "next": []
          },
          {
            "code": "621225",
            "name": "西和县",
            "next": []
          },
          {
            "code": "621224",
            "name": "康县",
            "next": []
          },
          {
            "code": "621227",
            "name": "徽县",
            "next": []
          },
          {
            "code": "621226",
            "name": "礼县",
            "next": []
          },
          {
            "code": "621221",
            "name": "成县",
            "next": []
          },
          {
            "code": "621223",
            "name": "宕昌县",
            "next": []
          },
          {
            "code": "621222",
            "name": "文县",
            "next": []
          },
          {
            "code": "621202",
            "name": "武都区",
            "next": []
          },
          {
            "code": "621201",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "620300",
        "name": "金昌市",
        "next": [
          {
            "code": "620301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "620321",
            "name": "永昌县",
            "next": []
          },
          {
            "code": "620302",
            "name": "金川区",
            "next": []
          }
        ]
      },
      {
        "code": "621000",
        "name": "庆阳市",
        "next": [
          {
            "code": "621001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "621002",
            "name": "西峰区",
            "next": []
          },
          {
            "code": "621027",
            "name": "镇原县",
            "next": []
          },
          {
            "code": "621026",
            "name": "宁县",
            "next": []
          },
          {
            "code": "621025",
            "name": "正宁县",
            "next": []
          },
          {
            "code": "621024",
            "name": "合水县",
            "next": []
          },
          {
            "code": "621023",
            "name": "华池县",
            "next": []
          },
          {
            "code": "621022",
            "name": "环县",
            "next": []
          },
          {
            "code": "621021",
            "name": "庆城县",
            "next": []
          }
        ]
      },
      {
        "code": "622900",
        "name": "临夏州",
        "next": [
          {
            "code": "622901",
            "name": "临夏市",
            "next": []
          },
          {
            "code": "622923",
            "name": "永靖县",
            "next": []
          },
          {
            "code": "622922",
            "name": "康乐县",
            "next": []
          },
          {
            "code": "622921",
            "name": "临夏县",
            "next": []
          },
          {
            "code": "622927",
            "name": "积石山县",
            "next": []
          },
          {
            "code": "622926",
            "name": "东乡族自治县",
            "next": []
          },
          {
            "code": "622925",
            "name": "和政县",
            "next": []
          },
          {
            "code": "622924",
            "name": "广河县",
            "next": []
          }
        ]
      },
      {
        "code": "620400",
        "name": "白银市",
        "next": [
          {
            "code": "620402",
            "name": "白银区",
            "next": []
          },
          {
            "code": "620403",
            "name": "平川区",
            "next": []
          },
          {
            "code": "620401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "620421",
            "name": "靖远县",
            "next": []
          },
          {
            "code": "620422",
            "name": "会宁县",
            "next": []
          },
          {
            "code": "620423",
            "name": "景泰县",
            "next": []
          }
        ]
      },
      {
        "code": "621100",
        "name": "定西市",
        "next": [
          {
            "code": "621101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "621102",
            "name": "安定区",
            "next": []
          },
          {
            "code": "621122",
            "name": "陇西县",
            "next": []
          },
          {
            "code": "621123",
            "name": "渭源县",
            "next": []
          },
          {
            "code": "621121",
            "name": "通渭县",
            "next": []
          },
          {
            "code": "621126",
            "name": "岷县",
            "next": []
          },
          {
            "code": "621124",
            "name": "临洮县",
            "next": []
          },
          {
            "code": "621125",
            "name": "漳县",
            "next": []
          }
        ]
      },
      {
        "code": "620500",
        "name": "天水市",
        "next": [
          {
            "code": "620521",
            "name": "清水县",
            "next": []
          },
          {
            "code": "620523",
            "name": "甘谷县",
            "next": []
          },
          {
            "code": "620522",
            "name": "秦安县",
            "next": []
          },
          {
            "code": "620525",
            "name": "张家川县",
            "next": []
          },
          {
            "code": "620524",
            "name": "武山县",
            "next": []
          },
          {
            "code": "620503",
            "name": "麦积区",
            "next": []
          },
          {
            "code": "620502",
            "name": "秦州区",
            "next": []
          },
          {
            "code": "620501",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "620800",
        "name": "平凉市",
        "next": [
          {
            "code": "620824",
            "name": "华亭县",
            "next": []
          },
          {
            "code": "620821",
            "name": "泾川县",
            "next": []
          },
          {
            "code": "620822",
            "name": "灵台县",
            "next": []
          },
          {
            "code": "620823",
            "name": "崇信县",
            "next": []
          },
          {
            "code": "620802",
            "name": "崆峒区",
            "next": []
          },
          {
            "code": "620825",
            "name": "庄浪县",
            "next": []
          },
          {
            "code": "620826",
            "name": "静宁县",
            "next": []
          },
          {
            "code": "620801",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "620100",
        "name": "兰州市",
        "next": [
          {
            "code": "620111",
            "name": "红古区",
            "next": []
          },
          {
            "code": "620121",
            "name": "永登县",
            "next": []
          },
          {
            "code": "620123",
            "name": "榆中县",
            "next": []
          },
          {
            "code": "620122",
            "name": "皋兰县",
            "next": []
          },
          {
            "code": "620105",
            "name": "安宁区",
            "next": []
          },
          {
            "code": "620104",
            "name": "兰州市西固区",
            "next": []
          },
          {
            "code": "620103",
            "name": "七里河区",
            "next": []
          },
          {
            "code": "620102",
            "name": "城关区",
            "next": []
          },
          {
            "code": "620101",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "430000",
    "name": "湖南省",
    "next": [
      {
        "code": "430800",
        "name": "张家界市",
        "next": [
          {
            "code": "430801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430822",
            "name": "桑植县",
            "next": []
          },
          {
            "code": "430821",
            "name": "慈利县",
            "next": []
          },
          {
            "code": "430802",
            "name": "永定区",
            "next": []
          },
          {
            "code": "430811",
            "name": "武陵源区",
            "next": []
          }
        ]
      },
      {
        "code": "430300",
        "name": "湘潭市",
        "next": [
          {
            "code": "430302",
            "name": "雨湖区",
            "next": []
          },
          {
            "code": "430301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430304",
            "name": "岳塘区",
            "next": []
          },
          {
            "code": "430382",
            "name": "韶山市",
            "next": []
          },
          {
            "code": "430381",
            "name": "湘乡市",
            "next": []
          },
          {
            "code": "430321",
            "name": "湘潭县",
            "next": []
          }
        ]
      },
      {
        "code": "431100",
        "name": "永州市",
        "next": [
          {
            "code": "431121",
            "name": "祁阳县",
            "next": []
          },
          {
            "code": "431123",
            "name": "双牌县",
            "next": []
          },
          {
            "code": "431122",
            "name": "东安县",
            "next": []
          },
          {
            "code": "431125",
            "name": "江永县",
            "next": []
          },
          {
            "code": "431124",
            "name": "道县",
            "next": []
          },
          {
            "code": "431127",
            "name": "蓝山县",
            "next": []
          },
          {
            "code": "431126",
            "name": "宁远县",
            "next": []
          },
          {
            "code": "431103",
            "name": "冷水滩区",
            "next": []
          },
          {
            "code": "431102",
            "name": "零陵区",
            "next": []
          },
          {
            "code": "431101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "431129",
            "name": "江华县",
            "next": []
          },
          {
            "code": "431128",
            "name": "新田县",
            "next": []
          }
        ]
      },
      {
        "code": "433100",
        "name": "湘西土家族苗族自治州",
        "next": [
          {
            "code": "433130",
            "name": "龙山县",
            "next": []
          },
          {
            "code": "433101",
            "name": "吉首市",
            "next": []
          },
          {
            "code": "433127",
            "name": "永顺县",
            "next": []
          },
          {
            "code": "433126",
            "name": "古丈县",
            "next": []
          },
          {
            "code": "433125",
            "name": "保靖县",
            "next": []
          },
          {
            "code": "433124",
            "name": "花垣县",
            "next": []
          },
          {
            "code": "433123",
            "name": "凤凰县",
            "next": []
          },
          {
            "code": "433122",
            "name": "泸溪县",
            "next": []
          }
        ]
      },
      {
        "code": "430700",
        "name": "常德市",
        "next": [
          {
            "code": "430721",
            "name": "安乡县",
            "next": []
          },
          {
            "code": "430722",
            "name": "汉寿县",
            "next": []
          },
          {
            "code": "430723",
            "name": "澧县",
            "next": []
          },
          {
            "code": "430702",
            "name": "武陵区",
            "next": []
          },
          {
            "code": "430703",
            "name": "鼎城区",
            "next": []
          },
          {
            "code": "430726",
            "name": "石门县",
            "next": []
          },
          {
            "code": "430701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430724",
            "name": "临澧县",
            "next": []
          },
          {
            "code": "430781",
            "name": "津市市",
            "next": []
          },
          {
            "code": "430725",
            "name": "桃源县",
            "next": []
          }
        ]
      },
      {
        "code": "430200",
        "name": "株洲市",
        "next": [
          {
            "code": "430221",
            "name": "株洲县",
            "next": []
          },
          {
            "code": "430223",
            "name": "攸县",
            "next": []
          },
          {
            "code": "430225",
            "name": "炎陵县",
            "next": []
          },
          {
            "code": "430224",
            "name": "茶陵县",
            "next": []
          },
          {
            "code": "430203",
            "name": "芦淞区",
            "next": []
          },
          {
            "code": "430202",
            "name": "荷塘区",
            "next": []
          },
          {
            "code": "430201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430211",
            "name": "天元区",
            "next": []
          },
          {
            "code": "430204",
            "name": "石峰区",
            "next": []
          },
          {
            "code": "430281",
            "name": "醴陵市",
            "next": []
          }
        ]
      },
      {
        "code": "431000",
        "name": "郴州市",
        "next": [
          {
            "code": "431002",
            "name": "北湖区",
            "next": []
          },
          {
            "code": "431003",
            "name": "苏仙区",
            "next": []
          },
          {
            "code": "431001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "431028",
            "name": "安仁县",
            "next": []
          },
          {
            "code": "431024",
            "name": "嘉禾县",
            "next": []
          },
          {
            "code": "431025",
            "name": "临武县",
            "next": []
          },
          {
            "code": "431026",
            "name": "汝城县",
            "next": []
          },
          {
            "code": "431027",
            "name": "桂东县",
            "next": []
          },
          {
            "code": "431021",
            "name": "桂阳县",
            "next": []
          },
          {
            "code": "431022",
            "name": "宜章县",
            "next": []
          },
          {
            "code": "431023",
            "name": "永兴县",
            "next": []
          },
          {
            "code": "431081",
            "name": "资兴市",
            "next": []
          }
        ]
      },
      {
        "code": "431200",
        "name": "怀化市",
        "next": [
          {
            "code": "431227",
            "name": "新晃侗族自治县",
            "next": []
          },
          {
            "code": "431281",
            "name": "洪江市",
            "next": []
          },
          {
            "code": "431224",
            "name": "溆浦县",
            "next": []
          },
          {
            "code": "431226",
            "name": "麻阳苗族自治县",
            "next": []
          },
          {
            "code": "431201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "431202",
            "name": "鹤城区",
            "next": []
          },
          {
            "code": "431225",
            "name": "会同县",
            "next": []
          },
          {
            "code": "431222",
            "name": "沅陵县",
            "next": []
          },
          {
            "code": "431223",
            "name": "辰溪县",
            "next": []
          },
          {
            "code": "431230",
            "name": "通道侗族自治县",
            "next": []
          },
          {
            "code": "431221",
            "name": "中方县",
            "next": []
          },
          {
            "code": "431228",
            "name": "芷江侗族自治县",
            "next": []
          },
          {
            "code": "431229",
            "name": "靖州苗族侗族县",
            "next": []
          }
        ]
      },
      {
        "code": "430600",
        "name": "岳阳市",
        "next": [
          {
            "code": "430611",
            "name": "君山区",
            "next": []
          },
          {
            "code": "430626",
            "name": "平江县",
            "next": []
          },
          {
            "code": "430621",
            "name": "岳阳县",
            "next": []
          },
          {
            "code": "430681",
            "name": "汩罗市",
            "next": []
          },
          {
            "code": "430623",
            "name": "华容县",
            "next": []
          },
          {
            "code": "430624",
            "name": "湘阴县",
            "next": []
          },
          {
            "code": "430603",
            "name": "云溪区",
            "next": []
          },
          {
            "code": "430602",
            "name": "岳阳楼区",
            "next": []
          },
          {
            "code": "430601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430682",
            "name": "临湘市",
            "next": []
          }
        ]
      },
      {
        "code": "430100",
        "name": "长沙市",
        "next": [
          {
            "code": "430181",
            "name": "浏阳市",
            "next": []
          },
          {
            "code": "430124",
            "name": "宁乡县",
            "next": []
          },
          {
            "code": "430101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430102",
            "name": "芙蓉区",
            "next": []
          },
          {
            "code": "430103",
            "name": "天心区",
            "next": []
          },
          {
            "code": "430104",
            "name": "岳麓区",
            "next": []
          },
          {
            "code": "430105",
            "name": "开福区",
            "next": []
          },
          {
            "code": "430121",
            "name": "长沙县",
            "next": []
          },
          {
            "code": "430122",
            "name": "望城县",
            "next": []
          },
          {
            "code": "430111",
            "name": "雨花区",
            "next": []
          }
        ]
      },
      {
        "code": "430500",
        "name": "邵阳市",
        "next": [
          {
            "code": "430528",
            "name": "新宁县",
            "next": []
          },
          {
            "code": "430529",
            "name": "城步苗族自治县",
            "next": []
          },
          {
            "code": "430522",
            "name": "新邵县",
            "next": []
          },
          {
            "code": "430523",
            "name": "邵阳县",
            "next": []
          },
          {
            "code": "430521",
            "name": "邵东县",
            "next": []
          },
          {
            "code": "430527",
            "name": "绥宁县",
            "next": []
          },
          {
            "code": "430524",
            "name": "隆回县",
            "next": []
          },
          {
            "code": "430525",
            "name": "洞口县",
            "next": []
          },
          {
            "code": "430511",
            "name": "北塔区",
            "next": []
          },
          {
            "code": "430501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430502",
            "name": "双清区",
            "next": []
          },
          {
            "code": "430503",
            "name": "大祥区",
            "next": []
          },
          {
            "code": "430581",
            "name": "武冈市",
            "next": []
          }
        ]
      },
      {
        "code": "430900",
        "name": "益阳市",
        "next": [
          {
            "code": "430981",
            "name": "沅江市",
            "next": []
          },
          {
            "code": "430901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430902",
            "name": "资阳区",
            "next": []
          },
          {
            "code": "430903",
            "name": "赫山区",
            "next": []
          },
          {
            "code": "430922",
            "name": "桃江县",
            "next": []
          },
          {
            "code": "430923",
            "name": "安化县",
            "next": []
          },
          {
            "code": "430921",
            "name": "南县",
            "next": []
          }
        ]
      },
      {
        "code": "431300",
        "name": "娄底市",
        "next": [
          {
            "code": "431322",
            "name": "新化县",
            "next": []
          },
          {
            "code": "431321",
            "name": "双峰县",
            "next": []
          },
          {
            "code": "431381",
            "name": "冷水江市",
            "next": []
          },
          {
            "code": "431382",
            "name": "涟源市",
            "next": []
          },
          {
            "code": "431301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "431302",
            "name": "娄星区",
            "next": []
          }
        ]
      },
      {
        "code": "430400",
        "name": "衡阳市",
        "next": [
          {
            "code": "430426",
            "name": "祁东县",
            "next": []
          },
          {
            "code": "430424",
            "name": "衡东县",
            "next": []
          },
          {
            "code": "430423",
            "name": "衡山县",
            "next": []
          },
          {
            "code": "430422",
            "name": "衡南县",
            "next": []
          },
          {
            "code": "430421",
            "name": "衡阳县",
            "next": []
          },
          {
            "code": "430482",
            "name": "常宁市",
            "next": []
          },
          {
            "code": "430401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "430408",
            "name": "蒸湘区",
            "next": []
          },
          {
            "code": "430405",
            "name": "珠晖区",
            "next": []
          },
          {
            "code": "430481",
            "name": "耒阳市",
            "next": []
          },
          {
            "code": "430407",
            "name": "石鼓区",
            "next": []
          },
          {
            "code": "430406",
            "name": "雁峰区",
            "next": []
          },
          {
            "code": "430412",
            "name": "南岳区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "340000",
    "name": "安徽省",
    "next": [
      {
        "code": "340300",
        "name": "蚌埠市",
        "next": [
          {
            "code": "340301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "340302",
            "name": "龙子湖区",
            "next": []
          },
          {
            "code": "340303",
            "name": "蚌山区",
            "next": []
          },
          {
            "code": "340304",
            "name": "禹会区",
            "next": []
          },
          {
            "code": "340323",
            "name": "固镇县",
            "next": []
          },
          {
            "code": "340321",
            "name": "怀远县",
            "next": []
          },
          {
            "code": "340311",
            "name": "淮上区",
            "next": []
          },
          {
            "code": "340322",
            "name": "五河县",
            "next": []
          }
        ]
      },
      {
        "code": "341400",
        "name": "巢湖市",
        "next": [
          {
            "code": "341401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "341402",
            "name": "居巢区",
            "next": []
          },
          {
            "code": "341422",
            "name": "无为县",
            "next": []
          },
          {
            "code": "341423",
            "name": "含山县",
            "next": []
          },
          {
            "code": "341421",
            "name": "庐江县",
            "next": []
          },
          {
            "code": "341424",
            "name": "和县",
            "next": []
          }
        ]
      },
      {
        "code": "341600",
        "name": "亳州市",
        "next": [
          {
            "code": "341602",
            "name": "谯城区",
            "next": []
          },
          {
            "code": "341601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "341621",
            "name": "涡阳县",
            "next": []
          },
          {
            "code": "341622",
            "name": "蒙城县",
            "next": []
          },
          {
            "code": "341623",
            "name": "利辛县",
            "next": []
          }
        ]
      },
      {
        "code": "340800",
        "name": "安庆市",
        "next": [
          {
            "code": "340803",
            "name": "大观区",
            "next": []
          },
          {
            "code": "340802",
            "name": "迎江区",
            "next": []
          },
          {
            "code": "340801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "340811",
            "name": "宜秀区",
            "next": []
          },
          {
            "code": "340828",
            "name": "岳西县",
            "next": []
          },
          {
            "code": "340881",
            "name": "桐城市",
            "next": []
          },
          {
            "code": "340823",
            "name": "枞阳县",
            "next": []
          },
          {
            "code": "340822",
            "name": "怀宁县",
            "next": []
          },
          {
            "code": "340825",
            "name": "太湖县",
            "next": []
          },
          {
            "code": "340824",
            "name": "潜山县",
            "next": []
          },
          {
            "code": "340827",
            "name": "望江县",
            "next": []
          },
          {
            "code": "340826",
            "name": "宿松县",
            "next": []
          }
        ]
      },
      {
        "code": "340700",
        "name": "铜陵市",
        "next": [
          {
            "code": "340711",
            "name": "铜陵市郊区",
            "next": []
          },
          {
            "code": "340721",
            "name": "铜陵县",
            "next": []
          },
          {
            "code": "340701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "340702",
            "name": "铜官山区",
            "next": []
          },
          {
            "code": "340703",
            "name": "狮子山区",
            "next": []
          }
        ]
      },
      {
        "code": "341200",
        "name": "阜阳市",
        "next": [
          {
            "code": "341282",
            "name": "界首市",
            "next": []
          },
          {
            "code": "341204",
            "name": "颍泉区",
            "next": []
          },
          {
            "code": "341221",
            "name": "临泉县",
            "next": []
          },
          {
            "code": "341222",
            "name": "太和县",
            "next": []
          },
          {
            "code": "341202",
            "name": "颍州区",
            "next": []
          },
          {
            "code": "341203",
            "name": "颍东区",
            "next": []
          },
          {
            "code": "341226",
            "name": "颍上县",
            "next": []
          },
          {
            "code": "341201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "341225",
            "name": "阜南县",
            "next": []
          }
        ]
      },
      {
        "code": "340200",
        "name": "芜湖市",
        "next": [
          {
            "code": "340208",
            "name": "三山区",
            "next": []
          },
          {
            "code": "340201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "340203",
            "name": "弋江区",
            "next": []
          },
          {
            "code": "340202",
            "name": "镜湖区",
            "next": []
          },
          {
            "code": "340207",
            "name": "鸠江区",
            "next": []
          },
          {
            "code": "340223",
            "name": "南陵县",
            "next": []
          },
          {
            "code": "340222",
            "name": "繁昌县",
            "next": []
          },
          {
            "code": "340221",
            "name": "芜湖县",
            "next": []
          }
        ]
      },
      {
        "code": "341800",
        "name": "宣城市",
        "next": [
          {
            "code": "341822",
            "name": "广德县",
            "next": []
          },
          {
            "code": "341823",
            "name": "泾县",
            "next": []
          },
          {
            "code": "341821",
            "name": "郎溪县",
            "next": []
          },
          {
            "code": "341824",
            "name": "绩溪县",
            "next": []
          },
          {
            "code": "341825",
            "name": "旌德县",
            "next": []
          },
          {
            "code": "341801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "341802",
            "name": "宣州区",
            "next": []
          },
          {
            "code": "341881",
            "name": "宁国市",
            "next": []
          }
        ]
      },
      {
        "code": "340600",
        "name": "淮北市",
        "next": [
          {
            "code": "340604",
            "name": "烈山区",
            "next": []
          },
          {
            "code": "340601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "340621",
            "name": "濉溪县",
            "next": []
          },
          {
            "code": "340603",
            "name": "相山区",
            "next": []
          },
          {
            "code": "340602",
            "name": "杜集区",
            "next": []
          }
        ]
      },
      {
        "code": "341100",
        "name": "滁州市",
        "next": [
          {
            "code": "341101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "341103",
            "name": "南谯区",
            "next": []
          },
          {
            "code": "341102",
            "name": "琅琊区",
            "next": []
          },
          {
            "code": "341126",
            "name": "凤阳县",
            "next": []
          },
          {
            "code": "341125",
            "name": "定远县",
            "next": []
          },
          {
            "code": "341124",
            "name": "全椒县",
            "next": []
          },
          {
            "code": "341181",
            "name": "天长市",
            "next": []
          },
          {
            "code": "341122",
            "name": "来安县",
            "next": []
          },
          {
            "code": "341182",
            "name": "明光市",
            "next": []
          }
        ]
      },
      {
        "code": "340100",
        "name": "合肥市",
        "next": [
          {
            "code": "340111",
            "name": "包河区",
            "next": []
          },
          {
            "code": "340102",
            "name": "瑶海区",
            "next": []
          },
          {
            "code": "340103",
            "name": "庐阳区",
            "next": []
          },
          {
            "code": "340101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "340104",
            "name": "蜀山区",
            "next": []
          },
          {
            "code": "340121",
            "name": "长丰县",
            "next": []
          },
          {
            "code": "340122",
            "name": "肥东县",
            "next": []
          },
          {
            "code": "340123",
            "name": "肥西县",
            "next": []
          }
        ]
      },
      {
        "code": "340500",
        "name": "马鞍山市",
        "next": [
          {
            "code": "340521",
            "name": "当涂县",
            "next": []
          },
          {
            "code": "340504",
            "name": "雨山区",
            "next": []
          },
          {
            "code": "340502",
            "name": "金家庄区",
            "next": []
          },
          {
            "code": "340503",
            "name": "花山区",
            "next": []
          },
          {
            "code": "340501",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "341500",
        "name": "六安市",
        "next": [
          {
            "code": "341501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "341503",
            "name": "裕安区",
            "next": []
          },
          {
            "code": "341502",
            "name": "金安区",
            "next": []
          },
          {
            "code": "341523",
            "name": "舒城县",
            "next": []
          },
          {
            "code": "341522",
            "name": "霍邱县",
            "next": []
          },
          {
            "code": "341521",
            "name": "寿县",
            "next": []
          },
          {
            "code": "341525",
            "name": "霍山县",
            "next": []
          },
          {
            "code": "341524",
            "name": "金寨县",
            "next": []
          }
        ]
      },
      {
        "code": "341000",
        "name": "黄山市",
        "next": [
          {
            "code": "341004",
            "name": "徽州区",
            "next": []
          },
          {
            "code": "341001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "341002",
            "name": "屯溪区",
            "next": []
          },
          {
            "code": "341003",
            "name": "黄山区",
            "next": []
          },
          {
            "code": "341022",
            "name": "休宁县",
            "next": []
          },
          {
            "code": "341023",
            "name": "黟县",
            "next": []
          },
          {
            "code": "341021",
            "name": "歙县",
            "next": []
          },
          {
            "code": "341024",
            "name": "祁门县",
            "next": []
          }
        ]
      },
      {
        "code": "341300",
        "name": "宿州市",
        "next": [
          {
            "code": "341324",
            "name": "泗县",
            "next": []
          },
          {
            "code": "341321",
            "name": "砀山县",
            "next": []
          },
          {
            "code": "341323",
            "name": "灵璧县",
            "next": []
          },
          {
            "code": "341322",
            "name": "萧县",
            "next": []
          },
          {
            "code": "341302",
            "name": "墉桥区",
            "next": []
          },
          {
            "code": "341301",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "341700",
        "name": "池州市",
        "next": [
          {
            "code": "341721",
            "name": "东至县",
            "next": []
          },
          {
            "code": "341702",
            "name": "贵池区",
            "next": []
          },
          {
            "code": "341701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "341722",
            "name": "石台县",
            "next": []
          },
          {
            "code": "341723",
            "name": "青阳县",
            "next": []
          }
        ]
      },
      {
        "code": "340400",
        "name": "淮南市",
        "next": [
          {
            "code": "340421",
            "name": "凤台县",
            "next": []
          },
          {
            "code": "340406",
            "name": "潘集区",
            "next": []
          },
          {
            "code": "340405",
            "name": "八公山区",
            "next": []
          },
          {
            "code": "340404",
            "name": "谢家集区",
            "next": []
          },
          {
            "code": "340403",
            "name": "田家庵区",
            "next": []
          },
          {
            "code": "340402",
            "name": "大通区",
            "next": []
          },
          {
            "code": "340401",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "630000",
    "name": "青海省",
    "next": [
      {
        "code": "632500",
        "name": "海南州",
        "next": [
          {
            "code": "632524",
            "name": "兴海县",
            "next": []
          },
          {
            "code": "632525",
            "name": "贵南县",
            "next": []
          },
          {
            "code": "632522",
            "name": "同德县",
            "next": []
          },
          {
            "code": "632523",
            "name": "贵德县",
            "next": []
          },
          {
            "code": "632521",
            "name": "共和县",
            "next": []
          }
        ]
      },
      {
        "code": "632100",
        "name": "海东地区",
        "next": [
          {
            "code": "632128",
            "name": "循化县",
            "next": []
          },
          {
            "code": "632122",
            "name": "民和县",
            "next": []
          },
          {
            "code": "632123",
            "name": "乐都县",
            "next": []
          },
          {
            "code": "632121",
            "name": "平安县",
            "next": []
          },
          {
            "code": "632126",
            "name": "互助县",
            "next": []
          },
          {
            "code": "632127",
            "name": "化隆回族自治县",
            "next": []
          }
        ]
      },
      {
        "code": "632700",
        "name": "玉树州",
        "next": [
          {
            "code": "632724",
            "name": "治多县",
            "next": []
          },
          {
            "code": "632725",
            "name": "囊谦县",
            "next": []
          },
          {
            "code": "632726",
            "name": "曲麻莱县",
            "next": []
          },
          {
            "code": "632721",
            "name": "玉树县",
            "next": []
          },
          {
            "code": "632722",
            "name": "杂多县",
            "next": []
          },
          {
            "code": "632723",
            "name": "称多县",
            "next": []
          }
        ]
      },
      {
        "code": "632800",
        "name": "海西州",
        "next": [
          {
            "code": "632823",
            "name": "天峻县",
            "next": []
          },
          {
            "code": "632801",
            "name": "格尔木市",
            "next": []
          },
          {
            "code": "632822",
            "name": "都兰县",
            "next": []
          },
          {
            "code": "632821",
            "name": "乌兰县",
            "next": []
          },
          {
            "code": "632802",
            "name": "德令哈市",
            "next": []
          }
        ]
      },
      {
        "code": "632300",
        "name": "黄南州",
        "next": [
          {
            "code": "632321",
            "name": "同仁县",
            "next": []
          },
          {
            "code": "632322",
            "name": "尖扎县",
            "next": []
          },
          {
            "code": "632323",
            "name": "泽库县",
            "next": []
          },
          {
            "code": "632324",
            "name": "河南县",
            "next": []
          }
        ]
      },
      {
        "code": "632600",
        "name": "果洛州",
        "next": [
          {
            "code": "632621",
            "name": "玛沁县",
            "next": []
          },
          {
            "code": "632623",
            "name": "甘德县",
            "next": []
          },
          {
            "code": "632622",
            "name": "班玛县",
            "next": []
          },
          {
            "code": "632625",
            "name": "久治县",
            "next": []
          },
          {
            "code": "632624",
            "name": "达日县",
            "next": []
          },
          {
            "code": "632626",
            "name": "玛多县",
            "next": []
          }
        ]
      },
      {
        "code": "630100",
        "name": "西宁市",
        "next": [
          {
            "code": "630123",
            "name": "湟源县",
            "next": []
          },
          {
            "code": "630103",
            "name": "城中区",
            "next": []
          },
          {
            "code": "630121",
            "name": "大通回族土族自治县",
            "next": []
          },
          {
            "code": "630122",
            "name": "湟中县",
            "next": []
          },
          {
            "code": "630105",
            "name": "城北区",
            "next": []
          },
          {
            "code": "630102",
            "name": "城东区",
            "next": []
          },
          {
            "code": "630104",
            "name": "城西区",
            "next": []
          }
        ]
      },
      {
        "code": "632200",
        "name": "海北州",
        "next": [
          {
            "code": "632224",
            "name": "刚察县",
            "next": []
          },
          {
            "code": "632221",
            "name": "门源县",
            "next": []
          },
          {
            "code": "632223",
            "name": "海晏县",
            "next": []
          },
          {
            "code": "632222",
            "name": "祁连县",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "350000",
    "name": "福建省",
    "next": [
      {
        "code": "350300",
        "name": "莆田市",
        "next": [
          {
            "code": "350301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350303",
            "name": "涵江区",
            "next": []
          },
          {
            "code": "350302",
            "name": "城厢区",
            "next": []
          },
          {
            "code": "350305",
            "name": "秀屿区",
            "next": []
          },
          {
            "code": "350304",
            "name": "荔城区",
            "next": []
          },
          {
            "code": "350322",
            "name": "仙游县",
            "next": []
          }
        ]
      },
      {
        "code": "350800",
        "name": "龙岩市",
        "next": [
          {
            "code": "350802",
            "name": "新罗区",
            "next": []
          },
          {
            "code": "350801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350824",
            "name": "武平县",
            "next": []
          },
          {
            "code": "350825",
            "name": "连城县",
            "next": []
          },
          {
            "code": "350881",
            "name": "漳平市",
            "next": []
          },
          {
            "code": "350821",
            "name": "长汀县",
            "next": []
          },
          {
            "code": "350822",
            "name": "永定县",
            "next": []
          },
          {
            "code": "350823",
            "name": "上杭县",
            "next": []
          }
        ]
      },
      {
        "code": "350700",
        "name": "南平市",
        "next": [
          {
            "code": "350701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350702",
            "name": "延平区",
            "next": []
          },
          {
            "code": "350725",
            "name": "政和县",
            "next": []
          },
          {
            "code": "350724",
            "name": "松溪县",
            "next": []
          },
          {
            "code": "350723",
            "name": "光泽县",
            "next": []
          },
          {
            "code": "350722",
            "name": "浦城县",
            "next": []
          },
          {
            "code": "350721",
            "name": "顺昌县",
            "next": []
          },
          {
            "code": "350784",
            "name": "建阳市",
            "next": []
          },
          {
            "code": "350781",
            "name": "邵武市",
            "next": []
          },
          {
            "code": "350783",
            "name": "建瓯市",
            "next": []
          },
          {
            "code": "350782",
            "name": "武夷山市",
            "next": []
          }
        ]
      },
      {
        "code": "350900",
        "name": "宁德市",
        "next": [
          {
            "code": "350921",
            "name": "霞浦县",
            "next": []
          },
          {
            "code": "350923",
            "name": "屏南县",
            "next": []
          },
          {
            "code": "350922",
            "name": "古田县",
            "next": []
          },
          {
            "code": "350925",
            "name": "周宁县",
            "next": []
          },
          {
            "code": "350924",
            "name": "寿宁县",
            "next": []
          },
          {
            "code": "350926",
            "name": "柘荣县",
            "next": []
          },
          {
            "code": "350902",
            "name": "蕉城区",
            "next": []
          },
          {
            "code": "350901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350982",
            "name": "福鼎市",
            "next": []
          },
          {
            "code": "350981",
            "name": "福安市",
            "next": []
          }
        ]
      },
      {
        "code": "350400",
        "name": "三明市",
        "next": [
          {
            "code": "350428",
            "name": "将乐县",
            "next": []
          },
          {
            "code": "350429",
            "name": "泰宁县",
            "next": []
          },
          {
            "code": "350421",
            "name": "明溪县",
            "next": []
          },
          {
            "code": "350423",
            "name": "清流县",
            "next": []
          },
          {
            "code": "350402",
            "name": "梅列区",
            "next": []
          },
          {
            "code": "350403",
            "name": "三元区",
            "next": []
          },
          {
            "code": "350426",
            "name": "尤溪县",
            "next": []
          },
          {
            "code": "350401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350481",
            "name": "永安市",
            "next": []
          },
          {
            "code": "350430",
            "name": "建宁县",
            "next": []
          },
          {
            "code": "350427",
            "name": "沙县",
            "next": []
          },
          {
            "code": "350425",
            "name": "大田县",
            "next": []
          },
          {
            "code": "350424",
            "name": "宁化县",
            "next": []
          }
        ]
      },
      {
        "code": "350100",
        "name": "福州市",
        "next": [
          {
            "code": "350128",
            "name": "平潭县",
            "next": []
          },
          {
            "code": "350121",
            "name": "闽侯县",
            "next": []
          },
          {
            "code": "350182",
            "name": "长乐市",
            "next": []
          },
          {
            "code": "350123",
            "name": "罗源县",
            "next": []
          },
          {
            "code": "350122",
            "name": "连江县",
            "next": []
          },
          {
            "code": "350125",
            "name": "永泰县",
            "next": []
          },
          {
            "code": "350124",
            "name": "闽清县",
            "next": []
          },
          {
            "code": "350103",
            "name": "台江区",
            "next": []
          },
          {
            "code": "350102",
            "name": "鼓楼区",
            "next": []
          },
          {
            "code": "350101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350111",
            "name": "晋安区",
            "next": []
          },
          {
            "code": "350105",
            "name": "马尾区",
            "next": []
          },
          {
            "code": "350104",
            "name": "仓山区",
            "next": []
          },
          {
            "code": "350181",
            "name": "福清市",
            "next": []
          }
        ]
      },
      {
        "code": "350500",
        "name": "泉州市",
        "next": [
          {
            "code": "350525",
            "name": "永春县",
            "next": []
          },
          {
            "code": "350524",
            "name": "安溪县",
            "next": []
          },
          {
            "code": "350527",
            "name": "金门县",
            "next": []
          },
          {
            "code": "350526",
            "name": "德化县",
            "next": []
          },
          {
            "code": "350521",
            "name": "惠安县",
            "next": []
          },
          {
            "code": "350505",
            "name": "泉港区",
            "next": []
          },
          {
            "code": "350504",
            "name": "洛江区",
            "next": []
          },
          {
            "code": "350503",
            "name": "丰泽区",
            "next": []
          },
          {
            "code": "350502",
            "name": "鲤城区",
            "next": []
          },
          {
            "code": "350501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350583",
            "name": "南安市",
            "next": []
          },
          {
            "code": "350582",
            "name": "晋江市",
            "next": []
          },
          {
            "code": "350581",
            "name": "石狮市",
            "next": []
          }
        ]
      },
      {
        "code": "350200",
        "name": "厦门市",
        "next": [
          {
            "code": "350213",
            "name": "翔安区",
            "next": []
          },
          {
            "code": "350212",
            "name": "同安区",
            "next": []
          },
          {
            "code": "350211",
            "name": "集美区",
            "next": []
          },
          {
            "code": "350201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350203",
            "name": "思明区",
            "next": []
          },
          {
            "code": "350205",
            "name": "海沧区",
            "next": []
          },
          {
            "code": "350206",
            "name": "湖里区",
            "next": []
          }
        ]
      },
      {
        "code": "350600",
        "name": "漳州市",
        "next": [
          {
            "code": "350681",
            "name": "龙海市",
            "next": []
          },
          {
            "code": "350622",
            "name": "云霄县",
            "next": []
          },
          {
            "code": "350623",
            "name": "漳浦县",
            "next": []
          },
          {
            "code": "350626",
            "name": "东山县",
            "next": []
          },
          {
            "code": "350627",
            "name": "南靖县",
            "next": []
          },
          {
            "code": "350624",
            "name": "诏安县",
            "next": []
          },
          {
            "code": "350625",
            "name": "长泰县",
            "next": []
          },
          {
            "code": "350628",
            "name": "平和县",
            "next": []
          },
          {
            "code": "350629",
            "name": "华安县",
            "next": []
          },
          {
            "code": "350601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "350602",
            "name": "芗城区",
            "next": []
          },
          {
            "code": "350603",
            "name": "龙文区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "310000",
    "name": "上海市",
    "next": [
      {
        "code": "310100",
        "name": "上海市",
        "next": [
          {
            "code": "310118",
            "name": "青浦区",
            "next": []
          },
          {
            "code": "310119",
            "name": "南汇区",
            "next": []
          },
          {
            "code": "310110",
            "name": "杨浦区",
            "next": []
          },
          {
            "code": "310112",
            "name": "闵行区",
            "next": []
          },
          {
            "code": "310113",
            "name": "宝山区",
            "next": []
          },
          {
            "code": "310114",
            "name": "嘉定区",
            "next": []
          },
          {
            "code": "310115",
            "name": "浦东新区",
            "next": []
          },
          {
            "code": "310116",
            "name": "金山区",
            "next": []
          },
          {
            "code": "310117",
            "name": "松江区",
            "next": []
          },
          {
            "code": "310107",
            "name": "普陀区",
            "next": []
          },
          {
            "code": "310106",
            "name": "静安区",
            "next": []
          },
          {
            "code": "310105",
            "name": "长宁区",
            "next": []
          },
          {
            "code": "310104",
            "name": "徐汇区",
            "next": []
          },
          {
            "code": "310103",
            "name": "卢湾区",
            "next": []
          },
          {
            "code": "310101",
            "name": "黄浦区",
            "next": []
          },
          {
            "code": "310120",
            "name": "奉贤区",
            "next": []
          },
          {
            "code": "310109",
            "name": "虹口区",
            "next": []
          },
          {
            "code": "310108",
            "name": "闸北区",
            "next": []
          },
          {
            "code": "310130",
            "name": "崇明县",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "540000",
    "name": "西藏自治区",
    "next": [
      {
        "code": "542600",
        "name": "林芝地区",
        "next": [
          {
            "code": "542623",
            "name": "米林县",
            "next": []
          },
          {
            "code": "542622",
            "name": "工布江达县",
            "next": []
          },
          {
            "code": "542621",
            "name": "林芝县",
            "next": []
          },
          {
            "code": "542627",
            "name": "朗县",
            "next": []
          },
          {
            "code": "542626",
            "name": "察隅县",
            "next": []
          },
          {
            "code": "542625",
            "name": "波密县",
            "next": []
          },
          {
            "code": "542624",
            "name": "墨脱县",
            "next": []
          }
        ]
      },
      {
        "code": "542200",
        "name": "山南地区",
        "next": [
          {
            "code": "542231",
            "name": "隆子县",
            "next": []
          },
          {
            "code": "542232",
            "name": "错那县",
            "next": []
          },
          {
            "code": "542233",
            "name": "浪卡子县",
            "next": []
          },
          {
            "code": "542229",
            "name": "加查县",
            "next": []
          },
          {
            "code": "542228",
            "name": "洛扎县",
            "next": []
          },
          {
            "code": "542227",
            "name": "措美县",
            "next": []
          },
          {
            "code": "542226",
            "name": "曲松县",
            "next": []
          },
          {
            "code": "542225",
            "name": "琼结县",
            "next": []
          },
          {
            "code": "542224",
            "name": "桑日县",
            "next": []
          },
          {
            "code": "542223",
            "name": "贡嘎县",
            "next": []
          },
          {
            "code": "542222",
            "name": "扎囊县",
            "next": []
          },
          {
            "code": "542221",
            "name": "乃东县",
            "next": []
          }
        ]
      },
      {
        "code": "542500",
        "name": "阿里地区",
        "next": [
          {
            "code": "542524",
            "name": "日土县",
            "next": []
          },
          {
            "code": "542525",
            "name": "革吉县",
            "next": []
          },
          {
            "code": "542526",
            "name": "改则县",
            "next": []
          },
          {
            "code": "542527",
            "name": "措勤县",
            "next": []
          },
          {
            "code": "542521",
            "name": "普兰县",
            "next": []
          },
          {
            "code": "542522",
            "name": "札达县",
            "next": []
          },
          {
            "code": "542523",
            "name": "噶尔县",
            "next": []
          }
        ]
      },
      {
        "code": "542100",
        "name": "昌都地区",
        "next": [
          {
            "code": "542128",
            "name": "左贡县",
            "next": []
          },
          {
            "code": "542129",
            "name": "芒康县",
            "next": []
          },
          {
            "code": "542121",
            "name": "昌都县",
            "next": []
          },
          {
            "code": "542122",
            "name": "江达县",
            "next": []
          },
          {
            "code": "542123",
            "name": "贡觉县",
            "next": []
          },
          {
            "code": "542124",
            "name": "类乌齐县",
            "next": []
          },
          {
            "code": "542125",
            "name": "丁青县",
            "next": []
          },
          {
            "code": "542126",
            "name": "察亚县",
            "next": []
          },
          {
            "code": "542127",
            "name": "八宿县",
            "next": []
          },
          {
            "code": "542133",
            "name": "边坝县",
            "next": []
          },
          {
            "code": "542132",
            "name": "洛隆县",
            "next": []
          }
        ]
      },
      {
        "code": "542400",
        "name": "那曲地区",
        "next": [
          {
            "code": "542429",
            "name": "巴青县",
            "next": []
          },
          {
            "code": "542428",
            "name": "班戈县",
            "next": []
          },
          {
            "code": "542421",
            "name": "那曲县",
            "next": []
          },
          {
            "code": "542423",
            "name": "比如县",
            "next": []
          },
          {
            "code": "542422",
            "name": "嘉黎县",
            "next": []
          },
          {
            "code": "542425",
            "name": "安多县",
            "next": []
          },
          {
            "code": "542424",
            "name": "聂荣县",
            "next": []
          },
          {
            "code": "542427",
            "name": "索县",
            "next": []
          },
          {
            "code": "542426",
            "name": "申扎县",
            "next": []
          },
          {
            "code": "542430",
            "name": "尼玛县",
            "next": []
          }
        ]
      },
      {
        "code": "540100",
        "name": "拉萨市",
        "next": [
          {
            "code": "540122",
            "name": "当雄县",
            "next": []
          },
          {
            "code": "540123",
            "name": "尼木县",
            "next": []
          },
          {
            "code": "540121",
            "name": "林周县",
            "next": []
          },
          {
            "code": "540126",
            "name": "达孜县",
            "next": []
          },
          {
            "code": "540127",
            "name": "墨竹工卡县",
            "next": []
          },
          {
            "code": "540124",
            "name": "曲水县",
            "next": []
          },
          {
            "code": "540125",
            "name": "堆龙德庆",
            "next": []
          },
          {
            "code": "540102",
            "name": "城关区",
            "next": []
          }
        ]
      },
      {
        "code": "542300",
        "name": "日喀则地区",
        "next": [
          {
            "code": "542331",
            "name": "康马县",
            "next": []
          },
          {
            "code": "542337",
            "name": "萨嘎县",
            "next": []
          },
          {
            "code": "542330",
            "name": "仁布县",
            "next": []
          },
          {
            "code": "542338",
            "name": "岗巴县",
            "next": []
          },
          {
            "code": "542336",
            "name": "聂拉木县",
            "next": []
          },
          {
            "code": "542322",
            "name": "南木林县",
            "next": []
          },
          {
            "code": "542323",
            "name": "江孜县",
            "next": []
          },
          {
            "code": "542333",
            "name": "仲巴县",
            "next": []
          },
          {
            "code": "542332",
            "name": "定结县",
            "next": []
          },
          {
            "code": "542326",
            "name": "拉孜县",
            "next": []
          },
          {
            "code": "542327",
            "name": "昂仁县",
            "next": []
          },
          {
            "code": "542324",
            "name": "定日县",
            "next": []
          },
          {
            "code": "542325",
            "name": "萨迦县",
            "next": []
          },
          {
            "code": "542335",
            "name": "吉隆县",
            "next": []
          },
          {
            "code": "542328",
            "name": "谢通门县",
            "next": []
          },
          {
            "code": "542329",
            "name": "白朗县",
            "next": []
          },
          {
            "code": "542301",
            "name": "日喀则市",
            "next": []
          },
          {
            "code": "542334",
            "name": "亚东县",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "320000",
    "name": "江苏省",
    "next": [
      {
        "code": "320700",
        "name": "连云港市",
        "next": [
          {
            "code": "320703",
            "name": "连云区",
            "next": []
          },
          {
            "code": "320701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "320706",
            "name": "海州区",
            "next": []
          },
          {
            "code": "320705",
            "name": "新浦区",
            "next": []
          },
          {
            "code": "320724",
            "name": "灌南县",
            "next": []
          },
          {
            "code": "320721",
            "name": "赣榆县",
            "next": []
          },
          {
            "code": "320722",
            "name": "东海县",
            "next": []
          },
          {
            "code": "320723",
            "name": "灌云县",
            "next": []
          }
        ]
      },
      {
        "code": "320800",
        "name": "淮安市",
        "next": [
          {
            "code": "320830",
            "name": "盱眙县",
            "next": []
          },
          {
            "code": "320804",
            "name": "淮阴区",
            "next": []
          },
          {
            "code": "320801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "320829",
            "name": "洪泽县",
            "next": []
          },
          {
            "code": "320803",
            "name": "楚州区",
            "next": []
          },
          {
            "code": "320811",
            "name": "清浦区",
            "next": []
          },
          {
            "code": "320826",
            "name": "涟水县",
            "next": []
          },
          {
            "code": "320802",
            "name": "清河区",
            "next": []
          },
          {
            "code": "320831",
            "name": "金湖县",
            "next": []
          }
        ]
      },
      {
        "code": "320300",
        "name": "徐州市",
        "next": [
          {
            "code": "320321",
            "name": "丰县",
            "next": []
          },
          {
            "code": "320304",
            "name": "九里区",
            "next": []
          },
          {
            "code": "320305",
            "name": "贾汪区",
            "next": []
          },
          {
            "code": "320311",
            "name": "泉山区",
            "next": []
          },
          {
            "code": "320303",
            "name": "云龙区",
            "next": []
          },
          {
            "code": "320301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "320322",
            "name": "沛县",
            "next": []
          },
          {
            "code": "320324",
            "name": "睢宁县",
            "next": []
          },
          {
            "code": "320323",
            "name": "铜山县",
            "next": []
          },
          {
            "code": "320302",
            "name": "鼓楼区",
            "next": []
          },
          {
            "code": "320382",
            "name": "邳州市",
            "next": []
          },
          {
            "code": "320381",
            "name": "新沂市",
            "next": []
          }
        ]
      },
      {
        "code": "320600",
        "name": "南通市",
        "next": [
          {
            "code": "320621",
            "name": "海安县",
            "next": []
          },
          {
            "code": "320623",
            "name": "如东",
            "next": []
          },
          {
            "code": "320602",
            "name": "崇川区",
            "next": []
          },
          {
            "code": "320601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "320611",
            "name": "港闸区",
            "next": []
          },
          {
            "code": "320683",
            "name": "通州市",
            "next": []
          },
          {
            "code": "320682",
            "name": "如皋市",
            "next": []
          },
          {
            "code": "320681",
            "name": "启东市",
            "next": []
          },
          {
            "code": "320684",
            "name": "海门市",
            "next": []
          }
        ]
      },
      {
        "code": "320200",
        "name": "无锡市",
        "next": [
          {
            "code": "320211",
            "name": "滨湖区",
            "next": []
          },
          {
            "code": "320282",
            "name": "宜兴市",
            "next": []
          },
          {
            "code": "320281",
            "name": "江阴市",
            "next": []
          },
          {
            "code": "320206",
            "name": "惠山区",
            "next": []
          },
          {
            "code": "320205",
            "name": "锡山区",
            "next": []
          },
          {
            "code": "320204",
            "name": "北塘区",
            "next": []
          },
          {
            "code": "320203",
            "name": "南长区",
            "next": []
          },
          {
            "code": "320202",
            "name": "崇安区",
            "next": []
          },
          {
            "code": "320201",
            "name": "市辖区",
            "next": []
          }
        ]
      },
      {
        "code": "320500",
        "name": "苏州市",
        "next": [
          {
            "code": "320581",
            "name": "常熟市",
            "next": []
          },
          {
            "code": "320582",
            "name": "张家港市",
            "next": []
          },
          {
            "code": "320583",
            "name": "昆山市",
            "next": []
          },
          {
            "code": "320584",
            "name": "吴江市",
            "next": []
          },
          {
            "code": "320585",
            "name": "太仓市",
            "next": []
          },
          {
            "code": "320501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "320502",
            "name": "沧浪区",
            "next": []
          },
          {
            "code": "320503",
            "name": "平江区",
            "next": []
          },
          {
            "code": "320504",
            "name": "金阊区",
            "next": []
          },
          {
            "code": "320505",
            "name": "苏州高新区虎丘区",
            "next": []
          },
          {
            "code": "320506",
            "name": "吴中区",
            "next": []
          },
          {
            "code": "320507",
            "name": "相城区",
            "next": []
          }
        ]
      },
      {
        "code": "320100",
        "name": "南京市",
        "next": [
          {
            "code": "320113",
            "name": "栖霞区",
            "next": []
          },
          {
            "code": "320115",
            "name": "江宁区",
            "next": []
          },
          {
            "code": "320114",
            "name": "雨花台区",
            "next": []
          },
          {
            "code": "320111",
            "name": "浦口区",
            "next": []
          },
          {
            "code": "320124",
            "name": "溧水县",
            "next": []
          },
          {
            "code": "320125",
            "name": "高淳县",
            "next": []
          },
          {
            "code": "320104",
            "name": "秦淮区",
            "next": []
          },
          {
            "code": "320105",
            "name": "建邺区",
            "next": []
          },
          {
            "code": "320106",
            "name": "鼓楼区",
            "next": []
          },
          {
            "code": "320107",
            "name": "下关区",
            "next": []
          },
          {
            "code": "320101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "320102",
            "name": "玄武区",
            "next": []
          },
          {
            "code": "320103",
            "name": "白下区",
            "next": []
          },
          {
            "code": "320116",
            "name": "六合区",
            "next": []
          }
        ]
      },
      {
        "code": "321200",
        "name": "泰州市",
        "next": [
          {
            "code": "321284",
            "name": "姜堰市",
            "next": []
          },
          {
            "code": "321281",
            "name": "兴化市",
            "next": []
          },
          {
            "code": "321282",
            "name": "靖江市",
            "next": []
          },
          {
            "code": "321283",
            "name": "泰兴市",
            "next": []
          },
          {
            "code": "321201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "321202",
            "name": "海陵区",
            "next": []
          },
          {
            "code": "321203",
            "name": "高港区",
            "next": []
          }
        ]
      },
      {
        "code": "321000",
        "name": "扬州市",
        "next": [
          {
            "code": "321023",
            "name": "宝应县",
            "next": []
          },
          {
            "code": "321011",
            "name": "维扬区",
            "next": []
          },
          {
            "code": "321003",
            "name": "邗江区",
            "next": []
          },
          {
            "code": "321001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "321088",
            "name": "江都市",
            "next": []
          },
          {
            "code": "321002",
            "name": "广陵区",
            "next": []
          },
          {
            "code": "321084",
            "name": "高邮市",
            "next": []
          },
          {
            "code": "321081",
            "name": "仪征市",
            "next": []
          }
        ]
      },
      {
        "code": "320400",
        "name": "常州市",
        "next": [
          {
            "code": "320411",
            "name": "新北区",
            "next": []
          },
          {
            "code": "320481",
            "name": "溧阳市",
            "next": []
          },
          {
            "code": "320412",
            "name": "武进区",
            "next": []
          },
          {
            "code": "320482",
            "name": "金坛市",
            "next": []
          },
          {
            "code": "320401",
            "name": "常州市区",
            "next": []
          },
          {
            "code": "320402",
            "name": "天宁区",
            "next": []
          },
          {
            "code": "320405",
            "name": "戚墅堰区",
            "next": []
          },
          {
            "code": "320404",
            "name": "钟楼区",
            "next": []
          }
        ]
      },
      {
        "code": "321100",
        "name": "镇江市",
        "next": [
          {
            "code": "321111",
            "name": "润州区",
            "next": []
          },
          {
            "code": "321112",
            "name": "丹徒区",
            "next": []
          },
          {
            "code": "321183",
            "name": "句容市",
            "next": []
          },
          {
            "code": "321182",
            "name": "扬中市",
            "next": []
          },
          {
            "code": "321181",
            "name": "丹阳市",
            "next": []
          },
          {
            "code": "321102",
            "name": "京口区",
            "next": []
          },
          {
            "code": "321101",
            "name": "市区",
            "next": []
          }
        ]
      },
      {
        "code": "320900",
        "name": "盐城市",
        "next": [
          {
            "code": "320981",
            "name": "东台市",
            "next": []
          },
          {
            "code": "320982",
            "name": "大丰市",
            "next": []
          },
          {
            "code": "320922",
            "name": "滨海县",
            "next": []
          },
          {
            "code": "320923",
            "name": "阜宁县",
            "next": []
          },
          {
            "code": "320921",
            "name": "响水县",
            "next": []
          },
          {
            "code": "320924",
            "name": "射阳县",
            "next": []
          },
          {
            "code": "320925",
            "name": "建湖县",
            "next": []
          },
          {
            "code": "320901",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "320902",
            "name": "亭湖区",
            "next": []
          },
          {
            "code": "320903",
            "name": "盐都区",
            "next": []
          }
        ]
      },
      {
        "code": "321300",
        "name": "宿迁市",
        "next": [
          {
            "code": "321324",
            "name": "泗洪县",
            "next": []
          },
          {
            "code": "321323",
            "name": "泗阳县",
            "next": []
          },
          {
            "code": "321322",
            "name": "沭阳县",
            "next": []
          },
          {
            "code": "321302",
            "name": "宿城区",
            "next": []
          },
          {
            "code": "321301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "321311",
            "name": "宿豫区",
            "next": []
          }
        ]
      }
    ]
  },
  {
    "code": "450000",
    "name": "广西壮族自治区",
    "next": [
      {
        "code": "450700",
        "name": "钦州市",
        "next": [
          {
            "code": "450701",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "450702",
            "name": "钦南区",
            "next": []
          },
          {
            "code": "450703",
            "name": "钦北区",
            "next": []
          },
          {
            "code": "450722",
            "name": "浦北县",
            "next": []
          },
          {
            "code": "450721",
            "name": "灵山县",
            "next": []
          }
        ]
      },
      {
        "code": "451100",
        "name": "贺州市",
        "next": [
          {
            "code": "451101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "451122",
            "name": "钟山县",
            "next": []
          },
          {
            "code": "451121",
            "name": "昭平县",
            "next": []
          },
          {
            "code": "451102",
            "name": "八步区",
            "next": []
          },
          {
            "code": "451123",
            "name": "富川瑶族自治县",
            "next": []
          }
        ]
      },
      {
        "code": "450300",
        "name": "桂林市",
        "next": [
          {
            "code": "450304",
            "name": "象山区",
            "next": []
          },
          {
            "code": "450305",
            "name": "七星区",
            "next": []
          },
          {
            "code": "450311",
            "name": "雁山区",
            "next": []
          },
          {
            "code": "450332",
            "name": "恭城县",
            "next": []
          },
          {
            "code": "450301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "450302",
            "name": "秀峰区",
            "next": []
          },
          {
            "code": "450303",
            "name": "叠彩区",
            "next": []
          },
          {
            "code": "450331",
            "name": "荔浦县",
            "next": []
          },
          {
            "code": "450328",
            "name": "龙胜各族自治县",
            "next": []
          },
          {
            "code": "450329",
            "name": "资源县",
            "next": []
          },
          {
            "code": "450330",
            "name": "平乐县",
            "next": []
          },
          {
            "code": "450322",
            "name": "临桂县",
            "next": []
          },
          {
            "code": "450323",
            "name": "灵川县",
            "next": []
          },
          {
            "code": "450321",
            "name": "阳朔县",
            "next": []
          },
          {
            "code": "450326",
            "name": "永福县",
            "next": []
          },
          {
            "code": "450327",
            "name": "灌阳县",
            "next": []
          },
          {
            "code": "450324",
            "name": "全州县",
            "next": []
          },
          {
            "code": "450325",
            "name": "兴安县",
            "next": []
          }
        ]
      },
      {
        "code": "450800",
        "name": "贵港市",
        "next": [
          {
            "code": "450804",
            "name": "覃塘区",
            "next": []
          },
          {
            "code": "450803",
            "name": "港南区",
            "next": []
          },
          {
            "code": "450802",
            "name": "港北区",
            "next": []
          },
          {
            "code": "450801",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "450881",
            "name": "桂平市",
            "next": []
          },
          {
            "code": "450821",
            "name": "平南县",
            "next": []
          }
        ]
      },
      {
        "code": "450600",
        "name": "防城港市",
        "next": [
          {
            "code": "450601",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "450681",
            "name": "东兴市",
            "next": []
          },
          {
            "code": "450603",
            "name": "防城区",
            "next": []
          },
          {
            "code": "450602",
            "name": "港口区",
            "next": []
          },
          {
            "code": "450621",
            "name": "上思县",
            "next": []
          }
        ]
      },
      {
        "code": "451200",
        "name": "河池市",
        "next": [
          {
            "code": "451281",
            "name": "宜州市",
            "next": []
          },
          {
            "code": "451202",
            "name": "金城江区",
            "next": []
          },
          {
            "code": "451201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "451224",
            "name": "东兰县",
            "next": []
          },
          {
            "code": "451225",
            "name": "罗城仫佬族自治县",
            "next": []
          },
          {
            "code": "451226",
            "name": "环江毛南族自治县",
            "next": []
          },
          {
            "code": "451227",
            "name": "巴马瑶族自治县",
            "next": []
          },
          {
            "code": "451221",
            "name": "南丹县",
            "next": []
          },
          {
            "code": "451222",
            "name": "天峨县",
            "next": []
          },
          {
            "code": "451223",
            "name": "凤山县",
            "next": []
          },
          {
            "code": "451228",
            "name": "都安瑶族自治县",
            "next": []
          },
          {
            "code": "451229",
            "name": "大化瑶族自治县",
            "next": []
          }
        ]
      },
      {
        "code": "450200",
        "name": "柳州市",
        "next": [
          {
            "code": "450205",
            "name": "柳北区",
            "next": []
          },
          {
            "code": "450204",
            "name": "柳南区",
            "next": []
          },
          {
            "code": "450201",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "450203",
            "name": "鱼峰区",
            "next": []
          },
          {
            "code": "450202",
            "name": "城中区",
            "next": []
          },
          {
            "code": "450226",
            "name": "三江侗族自治县",
            "next": []
          },
          {
            "code": "450225",
            "name": "融水苗族自治县",
            "next": []
          },
          {
            "code": "450224",
            "name": "融安县",
            "next": []
          },
          {
            "code": "450223",
            "name": "鹿寨县",
            "next": []
          },
          {
            "code": "450222",
            "name": "柳城县",
            "next": []
          },
          {
            "code": "450221",
            "name": "柳江县",
            "next": []
          }
        ]
      },
      {
        "code": "450500",
        "name": "北海市",
        "next": [
          {
            "code": "450502",
            "name": "海城区",
            "next": []
          },
          {
            "code": "450503",
            "name": "银海区",
            "next": []
          },
          {
            "code": "450512",
            "name": "铁山港区",
            "next": []
          },
          {
            "code": "450501",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "450521",
            "name": "合浦县",
            "next": []
          }
        ]
      },
      {
        "code": "451300",
        "name": "来宾市",
        "next": [
          {
            "code": "451321",
            "name": "忻城县",
            "next": []
          },
          {
            "code": "451323",
            "name": "武宣县",
            "next": []
          },
          {
            "code": "451322",
            "name": "象州县",
            "next": []
          },
          {
            "code": "451324",
            "name": "金秀瑶族自治县",
            "next": []
          },
          {
            "code": "451302",
            "name": "兴宾区",
            "next": []
          },
          {
            "code": "451301",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "451381",
            "name": "合山市",
            "next": []
          }
        ]
      },
      {
        "code": "450100",
        "name": "南宁市",
        "next": [
          {
            "code": "450123",
            "name": "隆安县",
            "next": []
          },
          {
            "code": "450127",
            "name": "横县",
            "next": []
          },
          {
            "code": "450125",
            "name": "上林县",
            "next": []
          },
          {
            "code": "450107",
            "name": "西乡塘区",
            "next": []
          },
          {
            "code": "450122",
            "name": "武鸣县",
            "next": []
          },
          {
            "code": "450105",
            "name": "江南区",
            "next": []
          },
          {
            "code": "450102",
            "name": "兴宁区",
            "next": []
          },
          {
            "code": "450103",
            "name": "青秀区",
            "next": []
          },
          {
            "code": "450126",
            "name": "宾阳县",
            "next": []
          },
          {
            "code": "450101",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "450124",
            "name": "马山县",
            "next": []
          },
          {
            "code": "450108",
            "name": "良庆区",
            "next": []
          },
          {
            "code": "450109",
            "name": "邕宁区",
            "next": []
          }
        ]
      },
      {
        "code": "451000",
        "name": "百色市",
        "next": [
          {
            "code": "451031",
            "name": "隆林各族自治县",
            "next": []
          },
          {
            "code": "451029",
            "name": "田林县",
            "next": []
          },
          {
            "code": "451030",
            "name": "西林县",
            "next": []
          },
          {
            "code": "451023",
            "name": "平果县",
            "next": []
          },
          {
            "code": "451028",
            "name": "乐业县",
            "next": []
          },
          {
            "code": "451027",
            "name": "凌云县",
            "next": []
          },
          {
            "code": "451026",
            "name": "那坡县",
            "next": []
          },
          {
            "code": "451001",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "451002",
            "name": "右江区",
            "next": []
          },
          {
            "code": "451025",
            "name": "靖西县",
            "next": []
          },
          {
            "code": "451022",
            "name": "田东县",
            "next": []
          },
          {
            "code": "451024",
            "name": "德保县",
            "next": []
          },
          {
            "code": "451021",
            "name": "田阳县",
            "next": []
          }
        ]
      },
      {
        "code": "450400",
        "name": "梧州市",
        "next": [
          {
            "code": "450481",
            "name": "岑溪市",
            "next": []
          },
          {
            "code": "450421",
            "name": "苍梧县",
            "next": []
          },
          {
            "code": "450423",
            "name": "蒙山县",
            "next": []
          },
          {
            "code": "450422",
            "name": "藤县",
            "next": []
          },
          {
            "code": "450403",
            "name": "万秀区",
            "next": []
          },
          {
            "code": "450401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "450405",
            "name": "长洲区",
            "next": []
          },
          {
            "code": "450404",
            "name": "蝶山区",
            "next": []
          }
        ]
      },
      {
        "code": "451400",
        "name": "崇左市",
        "next": [
          {
            "code": "451481",
            "name": "凭祥市",
            "next": []
          },
          {
            "code": "451422",
            "name": "宁明县",
            "next": []
          },
          {
            "code": "451423",
            "name": "龙州县",
            "next": []
          },
          {
            "code": "451421",
            "name": "扶绥县",
            "next": []
          },
          {
            "code": "451424",
            "name": "大新县",
            "next": []
          },
          {
            "code": "451425",
            "name": "天等县",
            "next": []
          },
          {
            "code": "451401",
            "name": "市辖区",
            "next": []
          },
          {
            "code": "451402",
            "name": "江州区",
            "next": []
          }
        ]
      },
      {
        "code": "450900",
        "name": "玉林市",
        "next": [
          {
            "code": "450981",
            "name": "北流市",
            "next": []
          },
          {
            "code": "450924",
            "name": "兴业县",
            "next": []
          },
          {
            "code": "450921",
            "name": "容县",
            "next": []
          },
          {
            "code": "450922",
            "name": "陆川县",
            "next": []
          },
          {
            "code": "450923",
            "name": "博白县",
            "next": []
          },
          {
            "code": "450902",
            "name": "玉州区",
            "next": []
          },
          {
            "code": "450901",
            "name": "市辖区",
            "next": []
          }
        ]
      }
    ]
  }
]
''';